Repository: elric/deb-l10n
Catalog: debhelper.po
Languages: es

source: This program used to make symlinks to the undocumented.7 man page for man pages not present in a package. Debian policy now frowns on use of the undocumented.7 man page, and so this program does nothing, and should not be used.
es: Este programa se usa para crear enlaces simbólicos a la página de manual undocumented.7 para páginas de manual no presentes en un paquete. Las normas de Debian ahora desaprueban el uso de la página de manual undocumented.7, y debido a eso este programa no hace nada y no debe ser usado.

source: dh_usrlocal - migrate usr/local directories to maintainer scripts
es: dh_usrlocal - migra directorios usr/local a programas de desarrollador

source: B<dh_usrlocal> [S<I<debhelper options>>] [B<-n>]
es: B<dh_usrlocal> [S<I<opciones debhelper>>] [B<-n>]

source: dh_usrlocal is a debhelper program that can be used for building packages that will provide a subdirectory in /usr/local when installed.
es: dh_usrlocal es un programa de debhelper que puede ser usado para construir paquetes que proveerán un subdirectorio en /usr/local cuando se instalen.

source: If the directories found in the build tree have unusual owners, groups, or permissions, then those values will be preserved in the directories made by the postinst script. However, as a special exception, if a directory is owned by root.root, it will be treated as if it is owned by root.staff and is mode 2775. This is useful, since that is the group and mode policy recommends for directories in /usr/local.
es: Si los directorios encontrados en el árbol de construcción tienen propietarios, grupos o permisos inusuales, entonces estos valores serán preservados en los directorios hechos por el programa postinst. Sin embargo, como una excepción especial, si un directorio tiene como propietario root.root, éste será tratado como si tuviese como dueño root.staff y en modo 2775. Esto es útil, puesto que esa es la norma recomendada para el grupo y modo de los directorios en /usr/local.

source: Do not modify F<postinst>/F<prerm> scripts.
es: No modifica programas F<postinst>/F<prerm>.

source: Debian policy, version 2.2
es: Normas de Debian, versión 2.2
