Repository: elric/deb-l10n
Catalog: debhelper.po
Languages: es

source: dh_installexamples is a debhelper program that is responsible for installing examples into usr/share/doc/package/examples in package build directories.
es: dh_installexamples es un programa de debhelper responsable de instalar ejemplos en «usr/share/doc/paquete/examples» en los directorios de construcción del paquete.

source: debian/I<package>.examples
es: debian/I<paquete>.examples

source: Lists example files or directories to be installed.
es: Lista ficheros de ejemplo o directorios a instalar.

source: Install any files specified by command line parameters in ALL packages acted on.
es: Instala todos los ficheros especificados en los parámetros de la línea de órdenes en TODOS los paquetes sobre los que actúa.

source: Install these files (or directories) as examples into the first package acted on. (Or into all packages if -A is specified.)
es: Instala esos ficheros (o directorios) como ejemplos en el primer paquete sobre el que actúa. (O en todos si se define «-A»).

source: Note that dh_installexamples will happily copy entire directory hierarchies if you ask it to (similar to cp -a). If it is asked to install a directory, it will install the complete contents of the directory.
es: Tenga en cuenta que dh_installexamples copiará directamente jerarquías de directorio enteras si se le pide (similar a «cp -a»). Si le pide instalar un directorio instalará todos sus contenidos.

source: B<dh_installifupdown> [S<I<debhelper options>>] [B<--name=>I<name>]
es: B<dh_installifupdown> [S<I<opciones-de-debhelper>>] [B<--name=>I<nombre>]

source: debian/I<package>.if-up
es: debian/I<paquete>.if-up

source: debian/I<package>.if-down
es: debian/I<paquete>.if-down

source: debian/I<package>.if-pre-up
es: debian/I<paquete>.if-pre-up

source: debian/I<package>.if-post-down
es: debian/I<paquete>.if-post-down

source: These files are installed into etc/network/if-*.d/I<package> in the package build directory.
es: Estos ficheros se instalan en «etc/network/if-*.d/I<paquete>» en el directorio de construcción del paquete.

source: Look for files named debian/package.name.if-* and install them as etc/network/if-*/name, instead of using the usual files and installing them as the package name.
es: Busca ficheros llamados «debian/paquete.nombre.if-*» y los instala como «etc/network/if-*/nombre», en vez de usar los ficheros usuales e instalarlos con el nombre del paquete.

source: dh_installinfo - install info files
es: dh_installinfo - Instala ficheros info

source: B<dh_installinfo> [S<I<debhelper options>>] [B<-A>] [S<I<file ...>>]
es: B<dh_installinfo> [S<I<opciones-de-debhelper>>] [B<-A>] [S<I<fichero ...>>]

source: dh_installinfo is a debhelper program that is responsible for installing info files into usr/share/info in the package build directory.
es: dh_installinfo es un programa de debhelper responsable de instalar ficheros infor en «usr/share/info» en el directorio de construcción del paquete.

source: debian/I<package>.info
es: debian/I<paquete>.info

source: List info files to be installed.
es: Lista los ficheros info a instalar.

source: Install these info files into the first package acted on. (Or in all packages if -A is specified).
es: Instala estos ficheros info en el primer paquete sobre el que actúa. (O en todos los paquete si se define «-A»).

source: dh_installinit - install upstart jobs or init scripts into package build directories
es: dh_installinit - Instala tareas de upstart o scripts de init en los directorios de construcción del paquete

source: B<dh_installinit> [S<I<debhelper options>>] [B<--name=>I<name>] [B<-n>] [B<-R>] [B<-r>] [B<-d>] [B<-O>] [S<B<--> I<params>>]
es: B<dh_installinit> [S<I<opciones-de-debhelper>>] [B<--name=>I<nombre>] [B<-n>] [B<-R>] [B<-r>] [B<-d>] [B<-O>] [S<B<--> I<parámetros>>]

source: dh_installinit is a debhelper program that is responsible for installing upstart job files or init scripts with associated defaults files into package build directories, and in the former case providing compatibility handling for non-upstart systems.
es: dh_installinit es un programa de debhelper responsable de instalar ficheros de tareas de upstart o scripts de init con ficheros predeterminados asociados en los directorios de construcción del paquete, y en el primer caso, de proporcionar compatibilidad con sistemas diferentes de upstart.

source: It also automatically generates the postinst and postrm and prerm commands needed to set up the symlinks in /etc/rc*.d/ and to start and stop the init scripts.
es: Además, genera automáticamente las órdenes de «postinst», «postrm» y «prerm» necesarias para crear los enlaces simbólicos en «/etc/rc*.d/» y arrancar y parar los scripts de init.

source: debian/I<package>.upstart
es: debian/I<paquete>.upstart

source: If this exists, it is installed into etc/init/I<package>.conf in the package build directory.
es: Si existe, se instala en «etc/init/I<paquete>.conf» en el directorio de construcción del paquete.

source: debian/I<package>.init
es: debian/I<paquete>.init

source: Otherwise, if this exists, it is installed into etc/init.d/I<package> in the package build directory.
es: De lo contrario, si esto existe, se instalará en «etc/init.d/I<paquete>» en el directorio de construcción del paquete.

source: debian/I<package>.default
es: debian/I<paquete>.default

source: If this exists, it is installed into etc/default/I<package> in the package build directory.
es: Si esto existe, se instala en «etc/default/I<paquete>» en el directorio de construcción del paquete.

source: Do not modify postinst/postrm/prerm scripts.
es: No modifica los scripts postinst/postrm/prerm.

source: Only modify postinst/postrm/prerm scripts, do not actually install any init script, default files, or upstart job. May be useful if the init script or upstart job is shipped and/or installed by upstream in a way that doesn't make it easy to let dh_installinit find it.
es: Sólo modifica scripts postinst/postrm/prerm, no instala ningún script de init, ficheros predeterminados o tarea de upstart. Puede ser útil si el script de init o tarea upstart se proporciona o instala por la fuente original de software de una manera que dificulta que dh_installinit lo encuentre.

source: If no upstart job file is installed in the target directory when dh_installinit --onlyscripts is called, this program will assume that an init script is being installed and not provide the compatibility symlinks or upstart dependencies.
es: Si no se instala ninguna tarea de upstart en el directorio destino al invocar «dh_installinit --onlyscripts», el programa supondrá que se está instalando un script de init, y no ofrecerá los enlaces simbólicos de compatibilidad o dependencias de upstart.

source: Do not stop the init script until after the package upgrade has been completed. This is different than the default behavior, which stops the script in the prerm, and starts it again in the postinst.
es: No detiene el script de init hasta que se complete la actualización del paquete. Es diferente del comportamiento predeterminado, que detiene el script mediante, «prerm», y lo reinicia mediante «postinst».

source: This can be useful for daemons that should not have a possibly long downtime during upgrade. But you should make sure that the daemon will not get confused by the package being upgraded while it's running before using this option.
es: Puede ser útil para los demonios que no deberían tener un, posiblemente, largo tiempo de inactividad durante la actualización. Pero antes de usar esta opción debe comprobar que la actualización no confunde al demonio durante su ejecución.

source: Do not stop init script on upgrade.
es: No detiene el script de init durante una actualización.

source: Do not start the init script on install or upgrade, or stop it on removal. Only call update-rc.d. Useful for rcS scripts.
es: No inicia el script de init en una instalación o actualización, o no lo para cuando se desinstale. Sólo llama a update-rc.d. Útil para scripts de rcS.

source: Remove trailing "d" from the name of the package, and use the result for the filename the upstart job file is installed as in etc/init/ , or for the filename the init script is installed as in etc/init.d and the default file is installed as in etc/default/ . This may be useful for daemons with names ending in "d". (Note: this takes precedence over the --init-script parameter described below.)
es: Elimina la «d» final del nombre del paquete, y usa el resultado para el nombre del fichero de tarea de upstart que se instalará en «etc/init/», o para el nombre de fichero del script de init que se instala en «etc/init.d/», instalando el fichero de valores predefinidos en «etc/default/».Puede ser útil para demonios con nombres finalizados en «d». (Nota: Este parámetro tiene preferencia sobre «--init-script», descrito más abajo).

source: B<-u>I<params> B<--update-rcd-params=>I<params>
es: B<-u>I<parámetros> B<--update-rcd-params=>I<parámetros>

source: Pass "params" to L<update-rc.d(8)>. If not specified, "defaults" will be passed to L<update-rc.d(8)>.
es: Introduce los «parámetros» a L<update-rc.d(8)>. Si no se especifica, se introduce «defaults» a L<update-rc.d(8)>.

source: Install the upstart job file or the init script (and default file) using the filename I<name> instead of the default filename, which is the package name. When this parameter is used, dh_installinit looks for and installs files named debian/package.name.upstart, debian/package.name.init and debian/package.name.default, instead of the usual debian/package.upstart, debian/package.init and debian/package.default.
es: Instala la tarea de upstart o el script de init (y el fichero de valores predeterminados) usando el nombre de fichero I<nombre> en vez del nombre predeterminado, que es el nombre del paquete. Cuando se usa este parámetro, dh_installinit busca ficheros que se llamen «debian/paquete.nombre.upstart», «debian/paquete.nombre.init» y debian/paquete.nombre.default, en vez de los usuales «debian/paquete.upstart», «debian/paquete.init» y «debian/paquete.default», y los instala.

source: B<--init-script=>I<scriptname>
es: B<--init-script=>I<nombre-script>

source: Use "scriptname" as the filename the init script is installed as in etc/init.d/ (and also use it as the filename for the defaults file, if it is installed). If you use this parameter, dh_installinit will look to see if a file in the debian/ directory exists that looks like "package.scriptname" and if so will install it as the init script in preference to the files it normally installs.
es: Usa "nombrescript" como nombre del script de init a instalar en etc/init.d/ (y también usa este nombre para el fichero defaults, si se instala). Si usa este parámetro, dh_installinit mirará si existe un fichero cuyo nombre se parezca a "paquete.nombrescript" en el directorio debian/ y si es así lo instalará preferentemente como el script de init en lugar de los ficheros que instala normalmente.

source: This parameter is deprecated, use the --name parameter instead. This parameter will be ignored completely for upstart jobs.
es: Este parámetro está obsoleto, use en su lugar el parámetro «--name». Este parámetro se ignorará totalmente para tareas de upstart.

source: B<--error-handler=>I<function>
es: B<--error-handler=>I<función>

source: Call the named shell function if running the init script fails. The function should be provided in the prerm and postinst scripts, before the #DEBHELPER# token.
es: Invoca dicha función de la shell si la ejecución del script de init falla. La función debe proporcionarse en los scripts prerm y postinst, antes del símbolo #DEBHELPER#.

source: AUTHORS
es: AUTORES

source: dh_installlogcheck - install logcheck rulefiles into etc/logcheck/
es: dh_installlogcheck - instala ficheros de normas para logcheck en etc/logcheck/

source: B<dh_installlogcheck> [S<B<debhelper options>>]
es: B<dh_installlogcheck> [S<B<opciones debhelper>>]

source: debian/I<package>.logcheck.cracking
es: debian/I<paquete>.logcheck.cracking

source: debian/I<package>.logcheck.violations
es: debian/I<paquete>.logcheck.violations

source: debian/I<package>.logcheck.violations.ignore
es: debian/I<paquete>.logcheck.violations.ignore

source: debian/I<package>.logcheck.ignore.workstation
es: debian/I<paquete>.logcheck.ignore.workstation

source: debian/I<package>.logcheck.ignore.server
es: debian/I<paquete>.logcheck.ignore.server

source: debian/I<package>.logcheck.ignore.paranoid
es: debian/I<paquete>.logcheck.ignore.paranoid

source: Each of these files, if present, are installed into corresponding subdirectories of etc/logcheck/ in package build directories.
es: Cada uno de estos ficheros, si están presentes, se instalarán en sus subdirectorios correspondientes en «etc/logcheck/» en los directorios de construcción del paquete.

source: This program is a part of debhelper.
es: Este programa es parte de debhelper.

source: dh_installlogrotate - install logrotate config files
es: dh_installlogrotate - instala ficheros de configuración de logrotate

source: B<dh_installlogrotate> [S<I<debhelper options>>] [B<--name=>I<name>]
es: B<dh_installlogrotate> [S<I<opciones debhelper>>] [B<--name=>I<nombre>]

source: dh_installlogrotate is a debhelper program that is responsible for installing logrotate config files into etc/logrotate.d in package build directories. Files named debian/package.logrotate are installed.
es: dh_installlogrotate es un programa de debhelper responsable de instalar ficheros de configuración de logrotate en etc/logrotate.d en los directorios de construcción del paquete. Se instalan los ficheros llamados debian/paquete.logrotate.

source: Look for files named debian/package.name.logrotate and install them as etc/logrotate.d/name, instead of using the usual files and installing them as the package name.
es: Busca ficheros con el nombre debian/paquete.nombre.logrotate.* y los instala como etc/logrotate.*/nombre, en vez de usar los ficheros usuales e instalarlos con el nombre del paquete.

source: dh_installman - install man pages into package build directories
es: dh_installman - instala páginas de manual en los directorios de construcción

source: B<dh_installman> [S<I<debhelper options>>] [S<I<manpage ...>>]
es: B<dh_installman> [S<I<opciones-de-debhelper>>] [S<I<página-de-manual ...>>]

source: dh_installman is a debhelper program that handles installing man pages into the correct locations in package build directories. You tell it what man pages go in your packages, and it figures out where to install them based on the section field in their .TH line. If you have a properly formatted .TH line, your man page will be installed into the right directory, with the right name (this includes proper handling of pages with a subsection, like "3perl", which are placed in man3, and given an extension of ".3perl"). If your .TH line is incorrect or missing, the program may guess wrong based on the file extension.
es: dh_installman es un programa de debhelper que instala las páginas del manual en los lugares correctos de los directorios de construcción del paquete. Usted le informa de que páginas del manual van en los paquete, y el se encarga de averiguar donde deben instalarse en base al campo de la sección de su línea .TH. Si tiene una línea .TH con un formato correcto, su página del manual se instalará en el lugar correcto (esto incluye un manejo correcto de páginas con subsecciones, como "3perl", las cuales se colocan en man3, y se les da la extensión ".3perl"). Si su línea .TH es incorrecta o falta, probablemente lo adivine mal basándose en la extensión.

source: It also supports translated man pages, by looking for extensions like .ll.8 and .ll_LL.8, or by use of the --language switch.
es: También acepta páginas de manual traducidas, buscando extensiones como .«ll.8» y «.ll_LL.8», o mediante el uso de la opción «--language».

source: If dh_installman seems to install a man page into the wrong section or with the wrong extension, this is because the man page has the wrong section listed in its .TH line. Edit the man page and correct the section, and dh_installman will follow suit. See L<man(7)> for details about the .TH section. If dh_installman seems to install a man page into a directory like /usr/share/man/pl/man1/, that is because your program has a name like "foo.pl", and dh_installman assumes that means it is translated into Polish. Use --language=C to avoid this.
es: Si parece que dh_installman instala una página del manual en una sección incorrecta o con la extensión equivocada, es porque la página del manual tiene una sección incorrecta en su línea .TH. Edite la página de manual y corrija la sección, y dh_installman hará lo correcto. Para más detalles acerca de la sección .TH consulte L<man(7)> . Si parece que dh_installman instala la página del manual en un directorio como «/usr/share/man/pl/man1/», es porque su programa tiene un nombre como "tal.pl", y dh_installman asume que esto significa que está traducida al polaco. Para evitar esto use «--language=C».

source: After the man page installation step, dh_installman will check to see if any of the man pages in the temporary directories of any of the packages it is acting on contain ".so" links. If so, it changes them to symlinks.
es: Después del paso de instalación de la página del manual, dh_installman comprobará si alguna de las páginas del manual en los directorios temporales de cualquiera de los paquetes sobre los que está actuando contienen enlaces ".so". Si es así, los cambia por enlaces simbólicos.

source: Also, dh_installman will use man to guess the character encoding of each manual page and convert it to UTF-8. If the guesswork fails for some reason, you can override it using an encoding declaration. See L<manconv(1)> for details.
es: Así mismo, dh_installman usará man para averiguar la codificación de caracteres de cada página de manual, y lo convertirá a UTF-8. Si no logra averiguarlo por alguna razón, puede anularlo usando una declaración de codificación. Para más detalles consulte L<manconv(1)>.

source: debian/I<package>.manpages
es: debian/I<paquete>.manpages

source: Lists man pages to be installed.
es: Lista las páginas de manual a instalar.

source: Use this to specify that the man pages being acted on are written in the specified language.
es: Use esto para definir el lenguaje especificado de las páginas de manual sobre las que se actúa.

source: I<manpage ...>
es: I<página-de-manual ...>

source: Install these man pages into the first package acted on. (Or in all packages if -A is specified).
es: Instala estas páginas del manual en el primer paquete sobre el que actúe. (O en todos si se a especificado -A).

source: An older version of this program, L<dh_installmanpages(1)>, is still used by some packages, and so is still included in debhelper. It is, however, deprecated, due to its counterintuitive and inconsistent interface. Use this program instead.
es: Una versión anterior de este programa, L<dh_installmanpages(1)>, todavía es usado por algunos paquetes, y por eso se sigue incluyendo en debhelper. Sin embargo, su uso se desaconseja, debido a que tiene un interfaz poco intuitivo e inconsistente. Use este programa en su lugar.

source: dh_installmanpages - old-style man page installer (deprecated)
es: dh_installmanpages - Instalador al viejo estilo de páginas del manual (obsoleto)

source: B<dh_installmanpages> [S<I<debhelper options>>] [S<I<file ...>>]
es: B<dh_installmanpages> [S<I<opciones-de-debhelper>>] [S<I<fichero ...>>]

source: dh_installmanpages is a debhelper program that is responsible for automatically installing man pages into usr/share/man/ in package build directories.
es: dh_installmanpages es un programa de debhelper responsable de instalar automáticamente las páginas del manual en «usr/share/man/» en los directorios de construcción del paquete.

source: This is a DWIM-style program, with an interface unlike the rest of debhelper. It is deprecated, and you are encouraged to use L<dh_installman(1)> instead.
es: Este es un programa de estilo DWIM (N.T: Del inglés "Do what I mean", es decir, haz lo que quiero), con una interfaz diferente del resto de los programas de debhelper. Se desaprueba su uso, en su lugar se recomienda el uso de L<dh_installman(1)>.

source: dh_installmanpages scans the current directory and all subdirectories for filenames that look like man pages. (Note that only real files are looked at; symlinks are ignored.) It uses L<file(1)> to verify that the files are in the correct format. Then, based on the files' extensions, it installs them into the correct man directory.
es: dh_installmanpages analiza el directorio actual y sus subdirectorios en busca de nombres de ficheros que parezcan aptos para páginas del manual. (Dese cuenta de que sólo se miran ficheros reales, los enlaces simbólicos son ignorados). Usa L<file(1)> para verificar que los ficheros están en el formato correcto. Entonces, basándose en la extensión de los ficheros, los instala en los directorios correctos.

source: All filenames specified as parameters will be skipped by dh_installmanpages. This is useful if by default it installs some man pages that you do not want to be installed.
es: Todos los fichero especificados como parámetros serán saltados por dh_installmanpages. Esto es útil si por omisión instala alguna página del manual que no quiere instalar.

source: After the man page installation step, dh_installmanpages will check to see if any of the man pages are ".so" links. If so, it changes them to symlinks.
es: Después del paso de instalación de las páginas del manual, dh_installmanpages comprobará si alguna de las páginas del manual en los directorios temporales de cualquiera de los paquetes sobre los que está actuando contienen enlaces ".so". Si es así, los cambia por enlaces simbólicos.

source: Do not install these files as man pages, even if they look like valid man pages.
es: No instala estos ficheros como páginas del manual, incluso si parece que son páginas del manual válidas.

source: BUGS
es: FALLOS

source: dh_installmanpages will install the man pages it finds into B<all> packages you tell it to act on, since it can't tell what package the man pages belong in. This is almost never what you really want (use -p to work around this, or use the much better L<dh_installman(1)> program instead).
es: dh_installmanpages instalará las páginas del manual que encuentre en B<todos> los paquetes sobre los que actúa, ya que no puede determinar a que paquete pertenece cada página del manual. Esto casi nunca es lo que uno quiere (use -p para evitar esto, o use el programa L<dh_installman(1)> en su lugar).

source: Files ending in I<.man> will be ignored.
es: Se ignorarán ficheros que terminen con I<.man>.

source: Files specified as parameters that contain spaces in their filenames will not be processed properly.
es: Ficheros especificados como parámetros que contengan espacios en sus nombres so se procesarán correctamente.

source: dh_installmenu - install debian menu files into package build directories
es: dh_installmenu - Instala ficheros de menú de Debian en los directorios de construcción del paquete

source: B<dh_installmenu> [S<B<debhelper options>>] [B<-n>]
es: B<dh_installmenu> [S<B<opciones-de-debhelper>>] [B<-n>]

source: dh_installmenu is a debhelper program that is responsible for installing files used by the debian menu package into package build directories.
es: dh_installmenu es un programa de debhelper responsable de instalar ficheros usados por el paquete de menú de Debian en los directorios de construcción del paquete.
