Repository: elric/deb-l10n
Catalog: debhelper.po
Languages: es

source: Use this if you want the generated .deb files to be put in a directory other than the default of ".."
es: Use esta opción si quiere que los ficheros «.deb» generados se dejen en un directorio distinto de «..».

source: B<--filename=>I<name>
es: B<--filename=>I<nombre>

source: Use this if you want to force the generated .deb file to have a particular file name. Does not work well if more than one .deb is generated!
es: Use esta opción si quiere forzar un nombre para el fichero «.deb» generado. ¡No funciona bien si se genera más de un «.deb»!

source: Pass I<params> to L<dpkg-deb(1)> when it is used to build the package.
es: Introduce los I<parámetros> a L<dpkg-deb(1)> cuando se construye el paquete.

source: B<-u>I<params>
es: B<-u>I<parámetros>

source: This is another way to pass I<params> to L<dpkg-deb(1)>. It is deprecated; use B<--> instead.
es: Esta es otra manera de introducir I<parámetros> a L<dpkg-deb(1)>. Está obosoleta, use B<--> en su lugar.

source: dh_clean - clean up package build directories
es: dh_clean - Limpia los directorios de construcción de paquetes

source: B<dh_clean> [S<I<debhelper options>>] [B<-k>] [B<-d>] [B<-X>I<item>] [S<I<file ...>>]
es: B<dh_clean> [S<I<debhelper opciones>>] [B<-k>] [B<-d>] [B<-X>I<elemento>] [S<I<fichero ...>>]

source: dh_clean is a debhelper program that is responsible for cleaning up after a package is built. It removes the package build directories, and removes some other files including debian/files, and any detritus left behind by other debhelper commands. It also removes common files that should not appear in a debian diff: #*# *~ DEADJOE *.orig *.rej *.SUMS TAGS .deps/* *.P *-stamp
es: dh_clean es un programa de debhelper responsable de limpiar ficheros y directorios temporales después de construir el paquete. Elimina los directorios de construcción del paquete, otros ficheros incluyendo debian/files y todos los ficheros auxiliares que han ido dejando otras órdenes de debhelper. También elimina ficheros comunes que no deberían aparecer en un diff de Debian: #*# *~ DEADJOE *.orig *.rej *.SUMS TAGS .deps/* *.P *-stamp

source: It does not run "make clean" to clean up after the build process. Use L<dh_auto_clean(1)> to do things like that.
es: No ejecuta «make clean» para limpiar después del proceso de construcción. Para ello use L<dh_auto_clean(1)>.

source: dh_clean (or "dh clean") should be the last debhelper command run in the clean target in debian/rules.
es: dh_clean (o «dh clean») debería ser la última orden de debhelper a ejecutar en el objetivo «clean» en «debian/rules».

source: Can list other files to be removed.
es: Puede listar otros ficheros que desea eliminar.

source: This is deprecated, use L<dh_prep(1)> instead.
es: Está obsoleta, use L<dh_prep(1)>en su lugar.

source: Only clean the package build directories, do not clean up any other files at all.
es: Sólo limpia los directorios de construcción del paquete, no limpia ningún otro tipo de ficheros.

source: B<-X>I<item> B<--exclude=>I<item>
es: B<-X>I<elemento> B<--exclude=>I<elemento>

source: Exclude files that contain "item" anywhere in their filename from being deleted, even if they would normally be deleted. You may use this option multiple times to build up a list of things to exclude.
es: No borra los ficheros que contengan «elemento» en cualquier parte del nombre, incluso si se habrían borrado en condiciones normales. Puede usar esta opción varias veces para crear una lista de ficheros a excluir.

source: I<file ...>
es: I<fichero ...>

source: Delete these files too.
es: Borra también estos ficheros.

source: dh_compress - compress files and fix symlinks in package build directories
es: dh_compress - Comprime ficheros y arregla enlaces simbólicos en los directorios de construcción de los paquetes.

source: B<dh_compress> [S<I<debhelper options>>] [B<-X>I<item>] [B<-A>] [S<I<file ...>>]
es: B<dh_compress> [S<I<debhelper opciones>>] [B<-X>I<elemento>] [B<-A>] [S<I<fichero ...>>]

source: dh_compress is a debhelper program that is responsible for compressing the files in package build directories, and makes sure that any symlinks that pointed to the files before they were compressed are updated to point to the new files.
es: dh_compress es un programa de debhelper responsable de comprimir los ficheros en los directorios de construcción del paquete, y se asegura de que cualquier enlace simbólico que apuntaba a los ficheros antes la compresión se actualicen para apuntar a los nuevos ficheros.

source: By default, dh_compress compresses files that debian policy mandates should be compressed, namely all files in usr/share/info, usr/share/man, files in usr/share/doc that are larger than 4k in size, (except the copyright file, .html and .css files, image files, and files that appear to be already compressed based on their extensions), and all changelog files. Plus PCF fonts underneath usr/share/fonts/X11/
es: Por omisión, dh_compress comprime los ficheros que las normas de Debian obligan a comprimir, es decir, todos los ficheros en «usr/share/info», «usr/share/man», ficheros en «usr/share/doc» mayores de 4k, (excepto el fichero de derechos de autor, ficheros «.html» y «.css», y ficheros que ya parezcan estar comprimidos basándose en sus extensiones), y todos los ficheros de registro de cambios. Además de los tipos de letra PCF debajo de «usr/share/fonts/X11/».

source: debian/I<package>.compress
es: debian/I<paquete>.compress

source: These files are deprecated.
es: Estos ficheros están obsoletos.

source: If this file exists, the default files are not compressed. Instead, the file is ran as a shell script, and all filenames that the shell script outputs will be compressed. The shell script will be run from inside the package build directory. Note though that using -X is a much better idea in general; you should only use a debian/package.compress file if you really need to.
es: No se comprimirán los ficheros predeterminados si existe este fichero. Sin embargo, se ejecutará como un script de consola, y se comprimirán todos los ficheros que devuelva en vez de los ficheros predeterminados. El script de consola se ejecutará desde el interior del directorio de construcción del paquete. Tenga en cuenta que usar la opción «-X» es generalmente una mejor idea, sólo debe usar el fichero «debian/paquete.compress» cuando sea realmente necesario

source: Exclude files that contain "item" anywhere in their filename from being compressed. For example, -X.tiff will exclude tiff files from compression. You may use this option multiple times to build up a list of things to exclude.
es: Los ficheros que contengan «elemento» en cualquier parte de su nombre no se comprimirán. Por ejemplo, -«X.tiff» excluirá los ficheros tiff. Se puede usar esta opción varias veces para excluir una lista de elementos.

source: Compress all files specified by command line parameters in ALL packages acted on.
es: Comprime todos los ficheros especificados en los parámetros de la línea de órdenes en TODOS los paquetes sobre los que se actúa.

source: Add these files to the list of files to compress.
es: Añade estos ficheros a la lista de ficheros a comprimir.

source: CONFORMS TO
es: CONFORME A

source: Debian policy, version 3.0
es: Normas de Debian, versión 3.0

source: dh_desktop - deprecated no-op
es: dh_desktop - Nop obsoleto

source: B<dh_desktop> [S<I<debhelper options>>]
es: B<dh_desktop> [S<I<opciones-de-debhelper>>]

source: dh_desktop was a debhelper program that registers .desktop files. However, it no longer does anything, and is now deprecated.
es: dh_desktop es un programa de debhelper que registra ficheros «.desktop». Sin embargo, ya no hace nada y ha quedado obsoleto.

source: If a package ships desktop files, they just need to be installed in the correct location (/usr/share/applications) and they will be registered by the appropriate tools for the corresponding desktop environments.
es: Si un paquete proporciona ficheros «desktop», sólo se tiene que instalar en la ubicación correcta («/usr/share/applications)») y se registrarán mediante las herramientas apropiadas a cada entorno de escritorio.

source: dh_fixperms - fix permissions of files in package build directories
es: dh_fixperms - Arregla los permisos de los ficheros en los directorios de construcción.

source: B<dh_fixperms> [S<I<debhelper options>>] [B<-X>I<item>]
es: B<dh_fixperms> [S<I<opciones-de-debhelper>>] [B<-X>I<elemento>]

source: dh_fixperms is a debhelper program that is responsible for setting the permissions of files and directories in package build directories to a sane state -- a state that complies with Debian policy.
es: dh_fixperms en un programa de debhelper responsable de dejar en buen estado (es decir, que se ajusten a las normas de Debian) los permisos de los ficheros y directorios de los directorios de construcción del paquete.

source: dh_fixperms makes all files in usr/share/doc in the package build directory (excluding files in the examples/ directory) be mode 644. It also changes the permissions of all man pages to mode 644. It makes all files be owned by root, and it removes group and other write permission from all files. It removes execute permissions from any libraries, headers, perl modules, or desktop files that have it set. It makes all files in the standard bin and sbin directories, usr/games/ and etc/init.d executable (since v4). Finally, it removes the setuid and setgid bits from all files in the package.
es: dh_fixperms hace que el modo de todos los ficheros en« usr/share/doc» en el directorio de construcción del paquete (excluyendo los ficheros en el directorio «examples/)» tengan el modo 644. También cambia el modo de las páginas del manual a 644. Hace que todos los ficheros pertenezcan al administrador y elimina los permisos de escritura de grupo y de otros. Elimina los permisos de ejecución de cualquier biblioteca, paquetes para el desarrollo («headers»), modulos de Perl o ficheros «desktop» que lo puedan tener. Hace ejecutables todos los ficheros en «bin/», «/usr/games/» y «etc/init.d» (sólo v4). Finalmente, elimina los bit setuid y setgid de todos los ficheros en el paquete.

source: B<-X>I<item>, B<--exclude> I<item>
es: B<-X>I<elemento>, B<--exclude> I<elemento>

source: Exclude files that contain "item" anywhere in their filename from having their permissions changed. You may use this option multiple times to build up a list of things to exclude.
es: No se cambian los permisos de los ficheros que contengan «elemento» en su nombre. Puede usar la opción varias veces para construir una lista de ficheros a excluir.

source: dh_gconf - install GConf defaults files and register schemas
es: dh_gconf - Instala ficheros de valores predeterminados de GConf y registra esquemas

source: B<dh_gconf> [S<I<debhelper options>>] [B<--priority=<number>>]
es: B<dh_gconf> [S<I<opciones-de-debhelper>>] [B<--priority=<número>>]

source: dh_gconf is a debhelper program that is responsible for installing GConf defaults files and registering GConf schemas.
es: dh_gconf es un programa de debhelper responsable de la instalación de ficheros de valores pretederminados de GConf («defaults») y de registrar esquemas de GConf.

source: An appropriate dependency on gconf2 will be generated in ${misc:Depends}.
es: Se generará una dependencia apropiada sobre gconf2 en ${misc:Depends}.

source: debian/I<package>.gconf-defaults
es: debian/I<paquete>.gconf-defaults

source: Installed into usr/share/gconf/defaults/10_package in the package build directory, with "I<package>" replaced by the package name.
es: Se instala en «usr/share/gconf/defaults/10_paquete» en el directorio de construcción del paquete, con I<paquete> reemplazado por el nombre del paquete.

source: debian/I<package>.gconf-mandatory
es: debian/I<paquete>.gconf-mandatory

source: Installed into usr/share/gconf/mandatory/10_package in the package build directory, with "I<package>" replaced by the package name.
es: Se instala en «usr/share/gconf/mandatory/10_paquete» en el directorio de construcción del paquete, con I<paquete> reemplazado por el nombre del paquete.

source: B<--priority> I<priority>
es: B<--priority> I<prioridad>

source: dh_gencontrol - generate and install control file
es: dh_gencontrol - Genera e instala el fichero de control

source: B<dh_gencontrol> [S<I<debhelper options>>] [S<B<--> I<params>>]
es: B<dh_gencontrol> [S<I<opciones-de-debhelper>>] [S<B<--> I<parámetros>>]

source: dh_gencontrol is a debhelper program that is responsible for generating control files, and installing them into the DEBIAN directory with the proper permissions.
es: dh_gencontrol es un programa de debhelper que genera los ficheros de control, y los instala en el directorio DEBIAN con los permisos correctos.

source: This program is merely a wrapper around L<dpkg-gencontrol(1)>, which calls it once for each package being acted on, and passes in some additional useful flags.
es: El programa es simplemente una interfaz para L<dpkg-gencontrol(1)>, al que invoca una vez por cada paquete sobre el que actúa, introduciendo algunas opciones adicionales útiles.

source: Pass "params" to L<dpkg-gencontrol(1)>.
es: Pasa «parámetros» a L<dpkg-gencontrol(1)>.

source: B<-u>I<params>, B<--dpkg-gencontrol-params>=I<params>
es: B<-u>I<parámetros>, B<--dpkg-gencontrol-params>I<parámetros>

source: dh_icons - Update Freedesktop icon caches
es: dh_icons - Actualiza el almacén de iconos Freedesktop

source: B<dh_icons> [S<I<debhelper options>>] [B<-n>]
es: B<dh_icons> [S<I<opciones-de-debhelper>>] [B<-n>]

source: dh_icons is a debhelper program that updates Freedesktop icon caches when needed, using the update-icon-caches program provided by GTK+2.12. Currently this program does not handle installation of the files, though it may do so at a later date. It takes care of adding maintainer script fragments to call F<update-icon-caches>.
es: dh_desktop es un programa de debhelper que actualiza los almacenes de iconos Freedesktop cuando es necesario, usando el progrma update-icon-caches proporcionado por GTK+2.12. En el momento presente, el programa no gestiona la instalación de los ficheros, aunque puede que lo haga en el futuro. Se encarga de añadir fragmentos de script de encargado de paquete para invocar F<update-icon-caches>.

source: Do not modify maintainer scripts.
es: No modifica los scripts de mantenedor.

source: dh_install - install files into package build directories
es: dh_install - Instala ficheros en los directorios de construcción del paquete

source: B<dh_install> [B<-X>I<item>] [B<--autodest>] [B<--sourcedir=>I<dir>] [S<I<debhelper options>>] [S<I<file [...] dest>>]
es: B<dh_install> [B<-X>I<elemento>] [B<--autodest>] [B<--sourcedir=>I<dir>] [S<I<opciones debhelper>>] [S<I<fichero [...] dest>>]

source: dh_install is a debhelper program that handles installing files into package build directories. There are many dh_install* commands that handle installing specific types of files such as documentation, examples, man pages, and so on, and they should be used when possible as they often have extra intelligence for those particular tasks. dh_install, then, is useful for installing everything else, for which no particular intelligence is needed. It is a replacement for the old dh_movefiles command.
es: dh_install es un programa de debhelper que instala ficheros en los directorios de construcción del paquete. Hay muchas órdenes dh_install* que se encargan de instalar tipos de ficheros específicos, como documentación, ejemplos, páginas del manual... deben usarse siempre que sea posible, pues a menudo son más hábiles en estas tareas particulares. Entonces, dh_install, es útil para instalar el resto de las cosas para las cuales no se necesite ninguna habilidad especial. Es un reemplazo de la antigua orden dh_movefiles.

source: This program may be used in one of two ways. If you just have a file or two that the upstream Makefile does not install for you, you can run dh_install on them to move them into place. On the other hand, maybe you have a large package that builds multiple binary packages. You can use the upstream Makefile to install it all into debian/tmp, and then use dh_install to copy directories and files from there into the proper package build directories.
es: Este programa puede usarse de dos modos. Si solamente tiene uno o dos ficheros que el Makefile del desarrollador principal no instala por usted, puede usar dh_install para moverlos a su lugar. Por otro lado, quizá tenga un gran paquete que construye múltiples paquetes binarios. Puede usar el Makefile del desarrollador principal para instalarlo en debian/tmp, y después usar dh_install para copiar los directorios y ficheros desde ahí a los directorios de construcción del paquete correctos.

source: From debhelper compatibility level 7 on, dh_install will fall back to looking in debian/tmp for files, if it doesn't find them in the current directory (or whereever you've told it to look using --sourcedir).
es: A partir del nivel 7 de compatibilidad de debhelper en adelante, dh_install buscará por omisión ficheros en «debian/tmp», si no los encuentra en el directorio actual (o en la ubicación donde indicó que mirase usando «--sourcedir»).

source: debian/I<package>.install
es: debian/I<paquete>.install

source: List the files to install into each package and the directory they should be installed to. The format is a set of lines, where each line lists a file or files to install, and at the end of the line tells the directory it should be installed in. The name of the files (or directories) to install should be given relative to the current directory, while the installation directory is given relative to the package build directory. You may use wildcards in the names of the files to install (in v3 mode and above).
es: Los ficheros «debian/paquete.install» listan los ficheros a instalar en cada paquete y el directorio donde se deben instalar. El formato es un conjunto de líneas, cada línea lista un fichero o ficheros a instalar, y al final de ésta se encuentra el directorio donde se deben instalar. El nombre de los ficheros (o directorios) a instalar debe ser relativo al directorio actual, mientras que el directorio de instalación es relativo al directorio de construcción del paquete. Se pueden usar comodines en los nombres de los ficheros a instalar (en modo v3 o superior).

source: This option makes dh_install keep track of the files it installs, and then at the end, compare that list with the files in the source directory. If any of the files (and symlinks) in the source directory were not installed to somewhere, it will warn on stderr about that.
es: Esta opción hace que dh_install registre los ficheros que instala, y al final, compare esa lista con los ficheros en el directorio fuente. Si alguno de los ficheros (o enlaces simbólicos) en el directorio fuente no se instalaron en algún lugar, dará un aviso a través de la salida de error estándar.

source: This may be useful if you have a large package and want to make sure that you don't miss installing newly added files in new upstream releases.
es: Esto puede ser útil si tiene un paquete grande y quiere asegurarse de que no olvida instalar ningún fichero nuevo añadido en una nueva versión del programa.

source: Note that files that are excluded from being moved via the -X option are not warned about.
es: Tenga en cuenta de que no se avisa de los ficheros excluidos mediante la opción «-X».

source: This option is like --list-missing, except if a file was missed, it will not only list the missing files, but also fail with a nonzero exit code.
es: Esta opción es como «--list-missing», excepto que si se olvida un fichero, no sólo se listarán los ficheros olvidados, sino que además se devolverá un código de salida distinto de cero.

source: B<-Xitem>, B<--exclude=item>
es: B<-Xelemento>, B<--exclude=elemento>

source: Exclude files that contain "item" anywhere in their filename from being installed.
es: No instala los ficheros que contengan «elemento» en alguna parte de su nombre.

source: Look in the specified directory for files to be installed.
es: Busca en el directorio especificado los ficheros a instalar.

source: Note that this is not the same as the --sourcedirectory option used by the dh_auto_* commands. You rarely need to use this option, since dh_install automatically looks for files in debian/tmp in debhelper compatibility level 7 and above.
es: Tenga en cuenta que no es igual que la opción «--sourcedirectory» usada por las órdenes dh_auto_*. Rara vez usará esta opción, ya que dh_install busca ficheros en «debian/tmp» con el nivel 7 de compatibilidad o superior.

source: Guess as the destination directory to install things to. If this is specified, you should not list destination directories in debian/package.install files or on the command line. Instead, dh_install will guess as follows:
es: Averigua el directorio donde instalar las cosas. Si se define, no debería listar los directorios de destino en los ficheros «debian/paquete.install» o en la línea de órdenes. En vez de esto, dh_install lo averiguará del siguiente modo:

source: Strip off debian/tmp (or the sourcedir if one is given) from the front of the filename, if it is present, and install into the dirname of the filename. So if the filename is debian/tmp/usr/bin, then that directory will be copied to debian/package/usr/. If the filename is debian/tmp/etc/passwd, it will be copied to debian/package/etc/.
es: Si está presente, elimina debian/tmp (o el«sourcedir», si se proporciona) del principio del nombre del fichero y después lo instala en el directorio que forma parte del nombre del fichero. Esto es, si el nombre del fichero es «debian/tmp/usr/bin», el directorio se copiará a «debian/paquete/usr/». Si el nombre del fichero es «debian/tmp/etc/passwd», se copiará a« debian/paquete/etc/».

source: Note that if you list exactly one filename or wildcard-pattern on a line by itself in a debian/package.install file, with no explicit destination, then dh_install will automatically guess the destination even if this flag is not set.
es: Tenga en cuenta que si lista exactamente un nombre o patrón de comodines en una línea en el fichero «debian/paquete.install», sin ningún destino explícito, dh_install averiguará automáticamente el destino, incluso si esta opción no se define.

source: I<file [...] dest>
es: I<fichero [...] destino>

source: Lists files (or directories) to install and where to install them to. The files will be installed into the first package dh_install acts on.
es: Lista los ficheros (o directorios) a instalar y el lugar donde se instalarán. Los ficheros se instalarán en el primer paquete sobre el que actúe dh_install.

source: EXAMPLE
es: EJEMPLO

source: Suppose your package's upstream Makefile installs a binary, a man page, and a library into appropriate subdirectories of debian/tmp. You want to put the library into package libfoo, and the rest into package foo. Your rules file will run "dh_install --sourcedir=debian/tmp". Make debian/foo.install contain:
es: Suponga que el Makefile del desarrollador principal del paquete instala un binario, una página del manual, y una biblioteca en los directorios apropiados de debian/tmp. Quiere poner la biblioteca en el paquete libtal, y el resto en el paquete tal. Su fichero rules ejecutará "dh_install --sourcedir=debian/tmp". Haga un debian/tal.install que contenga:

source: While debian/libfoo.install contains:
es: Mientras que debian/libtal.install debe contener:

source: usr/lib/libfoo*.so.*
es: usr/libtal*.so.*

source: If you want a libfoo-dev package too, debian/libfoo-dev.install might contain:
es: Si además quiere un paquete libtal-dev, es posible que debian/libtal-dev.install contenga:

source: usr/include usr/lib/libfoo*.so usr/share/man/man3
es: usr/include usr/lib/libtal*.so usr/share/man/man3
