Repository: elric/deb-l10n
Catalog: debhelper.po
Languages: es

source: NAME
es: NOMBRE

source: debhelper - the debhelper tool suite
es: debhelper - El conjunto de herramientas debhelper

source: SYNOPSIS
es: SINOPSIS

source: B<dh_>I<*> [B<-v>] [B<-a>] [B<-i>] [B<-s>] [B<--no-act>] [B<-ppackage>] [B<-Npackage] [-Ptmpdir>]
es: B<dh_>I<*> [B<-v>] [B<-a>] [B<-i>] [B<-s>] [B<--no-act>] [B<-ppaquete>] [B<-Npaquete] [-Ptmpdir>]

source: DESCRIPTION
es: DESCRIPCIÓN

source: Debhelper is used to help you build a debian package. The philosophy behind debhelper is to provide a collection of small, simple, and easily understood tools that are used in debian/rules to automate various common aspects of building a package. This means less work for you, the packager. It also, to some degree means that these tools can be changed if debian policy changes, and packages that use them will require only a rebuild to comply with the new policy.
es: Debhelper ayuda a construir un paquete de Debian. La filosofía que se esconde detrás de Debhelper es ofrecer una colección de herramientas pequeñas, simples y fáciles de entender que son usadas en «debian/rules» para automatizar varios aspectos comunes a la hora de construir un paquete. Esto hace que usted, el empaquetador, tenga menos trabajo. Además, si cambian las directrices de Debian, los paquetes que necesiten cambios sólo necesitan ser reconstruidos para que se ajusten a las nuevas directrices.

source: A typical debian/rules file that uses debhelper will call several debhelper commands in sequence, or use L<dh(1)> to automate this process. Examples of rules files that use debhelper are in F</usr/share/doc/debhelper/examples/>
es: Un fichero «debian/rules» típico que use debhelper invocará órdenes de debhelper en cadena, usará L<dh(1)> para automatizar el proceso. Puede encontrar ejemplos de ficheros «rules» que usan debhelper en F</usr/share/doc/debhelper/examples/>

source: To create a new debian package using debhelper, you can just copy one of the sample rules files and edit it by hand. Or you can try the dh-make package, which contains a L<dh_make|dh_make(1)> command that partially automates the process. For a more gentle introduction, the maint-guide debian package contains a tutorial about making your first package using debhelper.
es: Para crear un nuevo paquete de Debian usando debhelper, simplemente puede copiar uno de los ficheros «rules» de ejemplo y editarlo a mano, o usar el paquete dh-make que contiene la orden L<dh_make|dh_make(1)> que automatiza parcialmente el proceso. Para una introducción más apropiada, el paquete maint-guide contiene una guía que muestra cómo hacer su primer paquete usando debhelper (existe una versión traducida al castellano en el paquete maint-guide-es)

source: DEBHELPER COMMANDS
es: ÓRDENES DE DEBHELPER

source: Here is the list of debhelper commands you can use. See their man pages for additional documentation.
es: A continuación se muestra una lista de las órdenes de debhelper que puede usar. Para más información consulte sus respectivas páginas del manual.

source: Deprecated Commands
es: Órdenes obsoletas

source: A few debhelper commands are deprecated and should not be used.
es: Existe un conjunto de órdenes de debhelper que han quedado obsoletas y que no se deberían usar.

source: Other Commands
es: Otras órdenes

source: If a program's name starts with "dh_", and the program is not on the above lists, then it is not part of the debhelper package, but it should still work like the other programs described on this page.
es: Si el nombre de un programa empieza con «dh_», y no está en las listas anteriores, no es parte del paquete debhelper, pero aún así debería funcionar como los programas descritos en está página.

source: DEBHELPER CONFIG FILES
es: FICHEROS DE CONFIGURACIÓN DE DEBHELPER

source: Many debhelper commands make use of files in F<debian/> to control what they do. Besides the common F<debian/changelog> and F<debian/control>, which are in all packages, not just those using debhelper, some additional files can be used to configure the behavior of specific debhelper commands. These files are typically named debian/package.foo (where "package" of course, is replaced with the package that is being acted on).
es: Muchas de las órdenes de debhelper hacen uso de los ficheros en F<debian/> para controlar lo que hacen. Además de los ficheros comunes F<debian/changelog> y F<debian/control>, que están en todos los paquetes, no sólo aquellos que usan debhelper, se pueden usar ficheros adicionales para configurar el comportamiento de una orden específica de debhelper. Estos ficheros se suelen llamar debian/paquete.tal (donde «paquete» es reemplazado por el paquete sobre el que se está actuando).

source: For example, dh_installdocs uses files named debian/package.docs to list the documentation files it will install. See the man pages of individual commands for details about the names and formats of the files they use. Generally, these files will list files to act on, one file per line. Some programs in debhelper use pairs of files and destinations or slightly more complicated formats.
es: Por ejemplo, «dh_installdocs» usa el fichero llamado «debian/paquete.docs» para listar los ficheros de documentación que instalará. Consulte las páginas del manual de cada orden para conocer más detalles acerca de los nombres y formatos de los ficheros que usan. Habitualmente, estos ficheros listan los ficheros sobre los que se actúa, uno por línea. Algunos programas de debhelper usan parejas de ficheros y destinos o algún formato un poco más complicado.

source: Note that if a package is the first (or only) binary package listed in debian/control, debhelper will use debian/foo if no debian/package.foo file can be found.
es: Tenga en cuenta que si un paquete es el primero (o el único) paquete binario listado en «debian/control», debhelper usará «debian/tal» si no existe «debian/paquete.tal».

source: In some rare cases, you may want to have different versions of these files for different architectures or OSes. If files named debian/package.foo.ARCH or debian/package.foo.OS exist, where "ARCH" and "OS" are the same as the output of "dpkg-architecture -qDEB_HOST_ARCH" / "dpkg-architecture -qDEB_HOST_ARCH_OS", then they will be used in preference to other, more general files.
es: En algunos casos raros, puede querer tener diferentes versiones de estos ficheros para diferentes arquitecturas o sistemas operativos. Si los ficheros «debian/paquete.tal.ARCH» y «debian/paquete.tal.OS» existen, donde «ARCH» y «OS» son igual a las salidas de «dpkg-architecture -qDEB_HOST_ARCH» / «dpkg-architecture -qDEB_HOST_ARCH_OS», se usarán preferentemente a otros ficheros generales.

source: In many cases, these config files are used to specify various types of files. Documentation or example files to install, files to move, and so on. When appropriate, in cases like these, you can use standard shell wildcard characters ('?' and '*' and '[..]' character classes) in the files.
es: En muchos casos, estos ficheros de configuración se usan para especificar varios tipos de ficheros. Documentación o ficheros de ejemplo a instalar, ficheros a mover, y demás. Cuando sea apropiado, en casos como estos, puedes usar comodines del intérprete de órdenes como («?», «*» y clases de carácter «[...]») en estos ficheros.

source: You can also put comments in these files; lines beginning with "#" are ignored.
es: También puede insertar comentarios en estos ficheros; simplemente comience las líneas con el símbolo «#».

source: SHARED DEBHELPER OPTIONS
es: OPCIONES COMPARTIDAS DE DEBHELPER

source: The following command line options are supported by all debhelper programs.
es: Las siguientes opciones de línea de órdenes son aceptados por todos los programas de debhelper.

source: Verbose mode: show all commands that modify the package build directory.
es: Modo explicativo: muestra todas las órdenes que modifican el directorio de construcción del paquete.

source: Do not really do anything. If used with -v, the result is that the command will output what it would have done.
es: No hace nada realmente. Si se usa con «-v», mostrará todo lo que hubiera hecho.

source: Act on architecture dependent packages that should be built for the build architecture.
es: Actua en todos los paquetes dependientes de la arquitectura que se deberían construir para la arquitectura de construcción.

source: Act on all architecture independent packages.
es: Actua en todos los paquetes independientes de la arquitectura.

source: B<->I<ppackage>, B<--package=>I<package>
es: B<->I<ppaquete>, B<--package=>I<paquete>

source: Act on the package named "package". This option may be specified multiple times to make debhelper operate on a given set of packages.
es: Actúa sobre el paquete nombrado «paquete». Esta opción puede ser especificada varias veces para hacer que debhelper opere sobre una serie de paquetes.

source: This used to be a smarter version of the -a flag, but the -a flag is now equally smart.
es: Solía ser una versión más inteligente de la opción «-a», pero actualmente la opción «-a» es igual de inteligente.

source: B<-N>I<package>, B<--no-package=>I<package>
es: B<-N>I<paquete>, B<--no-package=>I<paquete>

source: Do not act on the specified package even if an -a, -i, or -p option lists the package as one that should be acted on.
es: No actúa sobre un paquete especificado incluso si las opciones «-a», «-i», o «-p» listan este paquete como uno sobre los que se debería actuar.

source: Do not act on the packages which have already been acted on by this debhelper command earlier (i.e. if the command is present in the package debhelper log). For example, if you need to call the command with special options only for a couple of binary packages, pass this option to the last call of the command to process the rest of packages with default settings.
es: No actúa sobre los paquetes sobre los que ya se actuó anteriormente con esta orden de debhelper (esto es, si la orden está presente en el registro de debhelper). Por ejemplo, si necesita invocar la orden con opciones particulares para una pareja de paquetes binarios, introduzca esta opción a la última invocación de la orden para procesar el resto de paquetes con la configuración predeterminada.

source: B<--ignore=>I<file>
es: B<--ignore=>I<fichero>

source: Ignore the specified file. This can be used if debian/ contains a debhelper config file that a debhelper command should not act on. Note that debian/compat, debian/control, and debian/changelog can't be ignored, but then, there should never be a reason to ignore those files.
es: Ignora el fichero dado. Se puede usar si «debian/» contiene un fichero de configuración de debhelper sobre el que una orden de debhelper no debería actuar. Tenga en cuenta que no puede ignorar «debian/compat», «debian/control» y «debian/changelog», aunque nunca debería existir una razón para ignorar esos ficheros.

source: For example, if upstream ships a debian/init that you don't want dh_installinit to install, use --ignore=debian/init
es: Por ejemplo, si la fuente original distribuye un fichero «debian/init» que no desea que «dh_installinit» instale, use «--ignore=debian/init».

source: Use "tmpdir" for package build directory. The default is debian/<package>
es: Usa «tmpdir» como el directorio de construcción del paquete. Por omisión es «debian/<paquete>».

source: B<--mainpackage=>I<package>
es: B<--mainpackage=>I<paquete>

source: This little-used option changes the package which debhelper considers the "main package", that is, the first one listed in debian/control, and the one for which debian/foo files can be used instead of the usual debian/package.foo files.
es: Esta opción poco usada cambia el paquete que debhelper considera el «paquete principal», esto es, el primero listado en «debian/control», y sobre el cual se pueden usar los ficheros «debian/tal» en vez de los usuales «debian/package.tal».

source: This is used by L<dh(1)> when passing user-specified options to all the commands it runs. If the command supports the specified option or option bundle, it will take effect. If the command does not support the option (or any part of an option bundle), it will be ignored.
es: L<dh(1)> usa está orden al orden al introducir opciones definidas por el usuario a todas las órdenes que ejecuta. Si la orden acepta la opción definida o conjunto de opciones, tendrá efecto. Si la orden no acepta la opción (o alguna sección del conjunto de opciones), se ignorará.

source: COMMON DEBHELPER OPTIONS
es: OPCIONES COMUNES DE DEBHELPER

source: The following command line options are supported by some debhelper programs. See the man page of each program for a complete explanation of what each option does.
es: Las siguientes opciones son válidas para algunos programas de debhelper. Consulte la página del manual de cada programa para una explicación detallada de lo que hace cada una.

source: Do not modify postinst/postrm/etc scripts.
es: No modifica los scripts postinst/postrm/etc.

source: B<-X>I<item>, B<--exclude=>I<item>
es: B<-X>I<elemento>, B<--exclude=>I<elemento>

source: Exclude an item from processing. This option may be used multiple times, to exclude more than one thing.
es: No procesa un elemento. Esta opción se puede usar varias veces para excluir distintos elementos.

source: Makes files or other items that are specified on the command line take effect in ALL packages acted on, not just the first.
es: Hace que los ficheros o elementos especificados en la línea de órdenes tengan efecto en TODOS los paquetes sobre los que actúa, no sólo el primero.

source: BUILD SYSTEM OPTIONS
es: OPCIONES DEL SISTEMA DE CONSTRUCCIÓN

source: The following command line options are supported by all of the dh_auto_* debhelper programs. These programs support a variety of build systems, and normally heuristically determine which to use, and how to use them. You can use these command line options to override the default behavior.
es: Las siguientes opciones de línea de órdenes son compatibles con todos los programas «dh_auto_*» de debhelper. Estos programas permiten una variedad de sistemas de construcción, y habitualmente realizan una estimación de cuál usar, y cómo. Puede usar estas opciones de línea de órdenes para anular el comportamiento predeterminado.

source: B<-S>I<buildsystem>, B<--buildsystem=>I<buildsystem>
es: B<-S>I<sistema-de-construcción>, B<--buildsystem=>I<sistema-de-construcción>

source: Force use of the specified I<buildsystem>, instead of trying to auto-select one which might be applicable for the package.
es: Fuerza el uso del I<sistema-de-construcción> definido, en lugar de intentar seleccionar uno de forma automática que podría adecuado para el paquete.

source: B<-D>I<directory>, B<--sourcedirectory=>I<directory>
es: B<-D>I<directorio>, B<--sourcedirectory=>I<directorio>

source: Assume that the original package source tree is at the specified I<directory> rather than the top level directory of the Debian source package tree.
es: Supone que el árbol de código fuente original del paquete está en el I<directorio> definido, en lugar del directorio de nivel superior del árbol del paquete fuente de Debian.

source: B<-B>[I<directory>], B<--builddirectory>=[I<directory>]
es: B<-B>[I<directorio>], B<--builddirectory>=[I<directorio>]

source: Enable out of source building and use the specified I<directory> as the build directory. If I<directory> parameter is omitted, a default build directory will chosen.
es: Activa la construcción fuera de las fuentes y usa el I<directorio> especificado como directorio de construcción. Se seleccionará un directorio de construcción predeterminado si se omite el parámetro I<directorio>.

source: If this option is not specified, building will be done in source by default unless the build system requires or prefers out of source tree building. In such a case, the default build directory will be used even if L<--builddirectory> is not specified.
es: Si no se define esta opción, la construcción tendrá lugar en las fuentes de forma predeterminada a menos que el sistema de construcción requiera o prefiera la construcción fuera del árbol de fuentes. En ese caso, se usará el directorio de construcción predeterminado incluso si no se define I<--builddirectory>.

source: If the build system prefers out of source tree building but still allows in source building, the latter can be re-enabled by passing a build directory path that is the same as the source directory path.
es: Si el sistema de construcción prefiere realizar la construcción fuera del árbol de fuentes, pero permite la construcción en las fuentes, puede reactivar lo último introduciendo una ruta al directorio de construcción igual a la ruta del directorio de fuentes.

source: Enable parallel builds if underlying build system supports them. The number of parallel jobs is controlled by the DEB_BUILD_OPTIONS environment variable (L<Debian Policy, section 4.9.1>) at build time. It might also be subject to a build system specific limit.
es: Activa construcciones paralelas si el sistema de construcción subyacente lo permite. El número de tareas en paralelo se controla mediante la variable de entorno «DEB_BUILD_OPTIONS» (L<Normas de Debian, sección 4.9.1>) en tiempo de construcción. También puede estar sujeto a un límite específico del sistema de construcción.

source: If this option is not specified, debhelper currently defaults to not allowing parallel package builds.
es: Si no se define esta opción, debhelper no permitirá la construcción en paralelo de paquetes de forma predeterminada.

source: B<--max-parallel>I<=maximum>
es: B<--max-parallel>I<=máximo>

source: This option implies L<--parallel> and allows further limiting the number of jobs that can be used in a parallel build. If the package build is known to only work with certain levels of concurrency, you can set this to the maximum level that is known to work, or that you wish to support.
es: Esta opción implica L<--parallel>, y permite limitar el número de tareas que se pueden usar en una construcción en paralelo. Si se sabe que la construcción del paquete sólo funciona con ciertos niveles de concurrencia, puede definir esto con el nivel máximo conocido con el que funciona, o que desea permitir.

source: List all build systems supported by debhelper on this system. The list includes both default and third party build systems (marked as such). Also shows which build system would be automatically selected, or which one is manually specified with the I<--buildsystem> option.
es: Lista todos los sistemas construcción en el sistema que debhelper acepta. La lista incluye sistemas de construcción de terceras fuentes (marcada como tal) y la predeterminada. También muestra el sistema de construcción que se seleccionará automáticamente, o cuál está definido mediante la opción I<--buildsystem>.

source: NOTES
es: NOTAS

source: Multiple binary package support
es: Compatibilidad con varios paquetes binarios

source: If your source package generates more than one binary package, debhelper programs will default to acting on all binary packages when run. If your source package happens to generate one architecture dependent package, and another architecture independent package, this is not the correct behavior, because you need to generate the architecture dependent packages in the binary-arch debian/rules target, and the architecture independent packages in the binary-indep debian/rules target.
es: Si su paquete fuente genera más de un paquete binario, los programas de debhelper actuarán sobre todos los paquetes binarios de forma predeterminada. Si se diera el caso de que su paquete fuente genera un paquete dependiente de la arquitectura, y otro independiente, éste no sería un comportamiento correcto porque necesitará generar los paquetes dependientes de la arquitectura en el objetivo binary-arch de «debian/rules», y los paquetes independientes de la arquitectura en el objetivo binary-indep de «debian/rules».

source: To facilitate this, as well as give you more control over which packages are acted on by debhelper programs, all debhelper programs accept the B<-a>, B<-i>, B<-p>, and B<-s> parameters. These parameters are cumulative. If none are given, debhelper programs default to acting on all packages listed in the control file.
es: Para facilitar esto, así como para dar mayor control sobre qué paquetes actúan los programas de debhelper, todos estos aceptan los parámetros B<-a>, B<-i>, B<-p>, y B<-s>. Estos parámetros son acumulativos. Si no se especifica ninguno, los programas de debhelper actúan por omisión en todos los paquetes listados en el fichero de control.

source: Automatic generation of debian install scripts
es: Generación automática de los scripts de instalación de Debian

source: Some debhelper commands will automatically generate parts of debian maintainer scripts. If you want these automatically generated things included in your existing debian maintainer scripts, then you need to add "#DEBHELPER#" to your scripts, in the place the code should be added. "#DEBHELPER#" will be replaced by any auto-generated code when you run dh_installdeb.
es: Algunas órdenes de debhelper generarán automáticamente parte de los scripts de instalación de Debian. Si quiere que estas órdenes generen automáticamente lo que esté incluido en sus scripts de instalación de Debian, necesitará añadir «#DEBHELPER#» a sus scripts, en el lugar donde el código se deba añadir. «#DEBHELPER#» será remplazado por cualquier código auto-generado cuando ejecute «dh_installdeb».

source: If a script does not exist at all and debhelper needs to add something to it, then debhelper will create the complete script.
es: Si el script no existe y debhelper necesita añadirle algo en particular, creará el script por completo.

source: All debhelper commands that automatically generate code in this way let it be disabled by the -n parameter (see above).
es: Todas las órdenes de debhelper que generan código automáticamente de esta manera se pueden deshabilitar con el parámetro «-n» (ver arriba).

source: Note that the inserted code will be shell code, so you cannot directly use it in a perl script. If you would like to embed it into a perl script, here is one way to do that (note that I made sure that $1, $2, etc are set with the set command):
es: Observe que el código insertado sera código de consola, y por ello no puede usarlo directamente es un script de Perl. Si desea introducirlo en un script de Perl, hágalo de la siguiente forma (tenga en cuenta que en este caso comprobé que $1, $2, etc se definen con la orden «set»).

source: my $temp="set -e\nset -- @ARGV\n" . << 'EOF'; #DEBHELPER# EOF system ($temp) / 256 == 0 or die "Problem with debhelper scripts: $!";
es: my $temp="set -e\nset -- @ARGV\n" . << 'EOF'; #DEBHELPER# EOF system ($temp) / 256 == 0 or die "Problema con los scripts de debhelper: $!";

source: Automatic generation of miscellaneous dependencies.
es: Generación automática de diversas dependencias.
