Repository: elric/deb-l10n
Catalog: debhelper.po
Languages: es

source: In the above options, I<cmd> can be a full name of a debhelper command, or a substring. It'll first search for a command in the sequence exactly matching the name, to avoid any ambiguity. If there are multiple substring matches, the last one in the sequence will be used.
es: En las opciones anteriores, I<orden> puede ser el nombre completo de una orden de debhelper, o una subcadena. Buscará en primer lugar una orden en la secuencia que coincide totalmente con el nombre, para evitar cualqueir ambigüedad. Si hay muchas coincidencias con la subcadena se usará la última en la secuencia.

source: EXAMPLES
es: EJEMPLOS

source: To see what commands are included in a sequence, without actually doing anything:
es: Para ver qué órdenes se incluyen en una secuencia, sin hacer nada en realidad:

source: This is a very simple rules file, for packages where the default sequences of commands work with no additional options.
es: Este es un fichero «rules» muy sencillo, para paquetes donde las secuencias predeterminadas de órdenes funcionan sin opciones adicionales.

source: Often you'll want to pass an option to a specific debhelper command. The easy way to do with is by adding an override target for that command.
es: A menudo, querrá introducir una opción a una orden de debhelper en particular. La forma sencilla de hacerlo es añadir un objetivo «overrride» para esa orden.

source: Sometimes the automated L<dh_auto_configure(1)> and L<dh_auto_build(1)> can't guess what to do for a strange package. Here's how to avoid running either and instead run your own commands.
es: En ocasiones, las órdenes automatizadas L<dh_auto_configure(1)> y L<dh_auto_build(1)> no pueden averiguar qué hacer con un paquete extraño. A continuación puede ver cómo evitar que se ejecuten para que así pueda ejecutar sus propias órdenes.

source: Another common case is wanting to do something manually before or after a particular debhelper command is run.
es: Otra caso común es que desee hacer algo manualmente antes o después de que se ejecute una orden en particular de debhelper.

source: If your package is a python package, dh will use dh_pysupport by default. This is how to use dh_pycentral instead.
es: Si su paquete es un paquete de Python, dh usará dh_pysupport de forma predeterminada. A continuación puede ver como usar dh_pycentral en su lugar.

source: If your package uses autotools and you want to freshen config.sub and config.guess with newer versions from the autotools-dev package at build time, you can use some commands provided in autotools-dev that automate it, like this.
es: Si su paquete usa Autotools y desea refrescar «config.sub» y «config.guess» con nuevas versiones del paquete autotools-dev en tiempo de ejecución, puede usar algunas órdenes proporcionadas por autotools-dev que automatizan esto, como puede ver a continuación.

source: Here is how to force use of perl's Module::Build build system, which can be necessary if debhelper wrongly detects that the package uses MakeMaker.
es: A continuación puede ver como forzar el uso del sistema de construcción del módulo Perl Module::Build, lo cual puede ser necesario si debhelper detecta erróneamente que el paquete usa MakeMaker.

source: To patch your package using quilt, you can tell dh to use quilt's dh sequence addons like this:
es: Para parchear su paquete mediante quilt, puede indicar a dh que use las extensiones de secuencia de dh de quilt, como puede ver:

source: Here is an example of overriding where the dh_auto_* commands find the package's source, for a package where the source is located in a subdirectory.
es: Aquí tiene un ejemplo de cómo sobreescribir la ubicación dónde las órdenes «dh_auto_*» encuentran el código fuente de un paquete, para un paquete en el que las fuentes se ubican en un subdirectorio.

source: And here is an example of how to tell the dh_auto_* commands to build in a subdirectory, which will be removed on clean.
es: Y aquí tiene un ejemplo de cómo indicar a las órdenes «dh_auto_*» que realicen la construcción en un subdirectorio, que se eliminará mediante «clean».

source: If your package can be built in parallel, you can support parallel building as follows. Then I<dpkg-buildpackage -j> will work.
es: Si su paquete se puede construir en paralelo, puede permitir la construcción en paralelo de la siguiente manera. Después, funcionará la orden I<dpkg-buildpackage -j>.

source: Here is a way to prevent dh from running several commands that you don't want it to run, by defining empty override targets for each command.
es: A continuación puede ver cómo evitar que dh ejecute varias órdenes que no desea que se ejecuten. Para ello, defina objetivos «override» vacíos para cada orden.

source: # Commands not to run: override_dh_auto_test override_dh_compress override_dh_fixperms:
es: # Órdenes que no se ejecutan: override_dh_auto_test override_dh_compress override_dh_fixperms:

source: Sometimes, you may need to make an override target only run commands when a particular package is being built. This can be accomplished using L<dh_listpackages(1)> to test what is being built. For example:
es: A veces, puede que desee hacer que un objetivo «override» ejecute la órdenes sólo cuando se construya un paquete en particular. Para ello, use L<dh_listpackages(1)> para comprobar qué paquete se está construyendo. Por ejemplo:

source: Finally, remember that you are not limited to using override targets in the rules file when using dh. You can also explicitly define any of the regular rules file targets when it makes sense to do so. A common reason to do this is if your package needs different build-arch and build-indep targets. For example, a package with a long document build process can put it in build-indep to avoid build daemons redundantly building the documentation.
es: Por último, recuerde que no está limitado al uso de objetivos «override» en el fichero «rules» cuando use dh. También puede definir de forma explícita cualquiera de los objetivos normales del fichero «rules» cuando sea oportuno. Una razón común es si su paquete necesita distintos objetivos «build-arch» y «build-indep». Por ejemplo, puede insertar un paquete bajo «build-indep» si tiene una extensa documentación para evitar que los demonios de construcción generen la documentación de forma redundante.

source: INTERNALS
es: FUNCIONAMIENTO INTERNO

source: If you're curious about dh's internals, here's how it works under the hood.
es: Si siente curiosidad por el funcionamiento interno de dh, a continuación puede ver como funciona por dentro.

source: Each debhelper command will record when it's successfully run in debian/package.debhelper.log. (Which dh_clean deletes.) So dh can tell which commands have already been run, for which packages, and skip running those commands again.
es: Cada orden de debhelper registra una ejecución exitosa en «debian/package.debhelper.log.» (que dh_clean elimina). Gracias a ello dh puede conocer qué órdenes se han ejecutado, para qué paquetes, y omitir ejecutar esas órdenes otra vez.

source: Each time dh is run, it examines the log, and finds the last logged command that is in the specified sequence. It then continues with the next command in the sequence. The B<--until>, B<--before>, B<--after>, and B<--remaining> options can override this behavior.
es: Cada vez que se ejecuta dh, comprueba el registro y encuentra la última orden registrada contenida en la secuencia especificada. Después, continua con la siguiente orden en la secuencia. Las opciones B<--until>, B<--before>, B<--after> y B<--remaining> pueden anular este comportamiento.

source: dh uses the DH_INTERNAL_OPTIONS environment variable to pass information through to debhelper commands that are run inside override targets. The contents (and indeed, existence) of this environment variable, as the name might suggest, is subject to change at any time.
es: dh usa la variable de entorno «DH_INTERNAL_OPTIONS» para introducir información a las órdenes de debhelper que se estén ejecutando dentro de objetivos «override». El contenido (e incluso, la existencia) de esta variable de entorno, como el nombre sugiere, está sujeto a cambios en cualquier momento.

source: This program is a part of debhelper.
es: Este programa es parte de debhelper.

source: dh_auto_build - automatically builds a package
es: dh_auto_build - Construye paquetes de forma automática

source: B<dh_auto_build> [S<I<build system options>>] [S<I<debhelper options>>] [S<B<--> I<params>>]
es: B<dh_auto_build> [S<I<opciones-sistema-de-construcción>>] [S<I<opciones-de-debhelper>>] [S<B<--> I<parámetros>>]

source: dh_auto_build is a debhelper program that tries to automatically build a package. It does so by running the appropriate command for the build system it detects the package uses. For example, if a Makefile is found, this is done by running make (or MAKE, if the environment variable is set). If there's a setup.py, or Build.PL, it is run to build the package.
es: dh_auto_build es un programa de debhelper que intenta generar un paquete automáticamente. Realiza esto ejecutando la orden adecuada para el sistema de construcción que detecta que usa el paquete. Por ejemplo, si encuentra un fichero «Makefile», ejecuta «make» (o MAKE, si se define la variable de entorno). Si existe un fichero «setup.py» o «Build.PL», se usará para construir el paquete.

source: This is intended to work for about 90% of packages. If it doesn't work, you're encouraged to skip using dh_auto_build at all, and just run the build process manually.
es: La meta es que funcione para el 90% de los paquetes. Si no funciona, le animamos a que no use dh_auto_build, y simplemente ejecute el proceso de construcción manualmente.

source: See L<debhelper(7)/BUILD SYSTEM OPTIONS> for a list of common build system selection and control options.
es: Para una lista de selección de sistemas de construcción comunes y opciones de control consulte L<debhelper(7)/BUILD SYSTEM OPTIONS>.

source: B<--> I<params>
es: B<--> I<parámetros>

source: Pass "params" to the program that is run. These can be used to supplement or override any standard parameters that dh_auto_build passes.
es: Introduce los «parámetros» al programa que ejecuta. Se puede usar para añadir o anular cualquier parámetro estandar que dh_auto_build introduce.

source: dh_auto_clean - automatically cleans up after a build
es: dh_auto_clean - Limpia automáticamente después de una construcción

source: B<dh_auto_clean> [S<I<build system options>>] [S<I<debhelper options>>] [S<B<--> I<params>>]
es: B<dh_auto_clean> [S<I<opciones-sistema-de-construcción>>] [S<I<opciones-de-debhelper>>] [S<B<--> I<parámetros>>]

source: dh_auto_clean is a debhelper program that tries to automatically clean up after a package build. It does so by running the appropriate command for the build system it detects the package uses. For example, if there's a Makefile and it contains a "distclean", "realclean", or "clean" target, then this is done by running make (or MAKE, if the environment variable is set). If there is a setup.py or Build.PL, it is run to clean the package.
es: dh_auto_clean es un programa de debhelper que intenta limpiar automáticamente después de la construcción de un paquete. Para ello, ejecuta la orden adecuada para el sistema de construcción que detecta que usa el paquete. Por ejemplo, si hay un fichero «Makefile» que contiene un objetivo «distclean», «realclean» o «clean», ejecutará «make» (o MAKE, si se define la variable de entorno). Si existe un fichero «setup.py» o «Build.PL», se ejecuta para limpiar el paquete.

source: This is intended to work for about 90% of packages. If it doesn't work, or tries to use the wrong clean target, you're encouraged to skip using dh_auto_clean at all, and just run make clean manually.
es: El objetivo es que funcione con el 90% de los paquetes. Si no funciona, o lo intenta usando el objetivo «clean» equivocado, le animamos a que no use dh_auto_clean, y que simplemente ejecute «make clean» manualmente.

source: Pass "params" to the program that is run. These can be used to supplement or override the any standard parameters that dh_auto_clean passes.
es: Introduce los «parámetros» al programa que ejecuta. Se puede usar para añadir o anular cualquier parámetro estandar que dh_auto_clean introduce.

source: dh_auto_configure - automatically configure a package prior to building
es: dh_auto_configure - Configura un paquete automáticamente antes de la construcción

source: B<dh_auto_configure> [S<I<build system options>>] [S<I<debhelper options>>] [S<B<--> I<params>>]
es: B<dh_auto_configure> [S<I<opciones-sistema-de-construcción>>] [S<I<opciones-de-debhelper>>] [S<B<--> I<parámetros>>]

source: dh_auto_configure is a debhelper program that tries to automatically configure a package prior to building. It does so by running the appropriate command for the build system it detects the package uses. For example, it looks for and runs a ./configure script, Makefile.PL, Build.PL, or cmake. A standard set of parameters is determined and passed to the program that is run. Some build systems, such as make, do not need a configure step; for these dh_auto_configure will exit without doing anything.
es: dh_auto_configure es un programa de debhelper que intenta configurar automáticamente un paquete antes de su construcción. Para ello, ejecuta la orden adecuada para el sistema de construcción que detecta que usa el paquete. Por ejemplo, busca y ejecuta un script «./configure», «Makefile.PL», «Build.PL» o cmake. Determina un conjunto estándar de parámetros y los introduce al programa a ejecutar. Algunos sistemas de construcción, como make, no necesitan un paso «configure»; para ellos, dh_auto_configure cerrará sin hacer nada.

source: This is intended to work for about 90% of packages. If it doesn't work, you're encouraged to skip using dh_auto_configure at all, and just run ./configure or its equivalent manually.
es: La meta es que funcione con el 90% de los paquetes. Si no funciona, le animamos a no usar dh_auto_configure, y que simplemente ejecute «./configure», o su equivalente, manualmente.

source: Pass "params" to the program that is run, after the standard parameters that dh_auto_configure passes. This can be used to supplement or override those parameters. For example:
es: Introduce los «parámetros» al programa a ejecutar, después de que dh_auto_configure introduzca los parámetros estándar. Se puede usar para añadir o anular esos parámetros. Por ejemplo:

source: dh_auto_install - automatically runs make install or similar
es: dh_auto_install - Ejecuta automáticamente «make install» o similar

source: B<dh_auto_install> [S<I<build system options>>] [S<I<debhelper options>>] [S<B<--> I<params>>]
es: B<dh_auto_install> [S<I<opciones-sistema-de-construcción>>] [S<I<opciones-de-debhelper>>] [S<B<--> I<parámetros>>]

source: dh_auto_install is a debhelper program that tries to automatically install built files. It does so by running the appropriate command for the build system it detects the package uses. For example, if there's a Makefile and it contains a "install" target, then this is done by running make (or MAKE, if the environment variable is set). If there is a setup.py or Build.PL, it is used. Note that the Ant build system does not support installation, so dh_auto_install will not install files built using Ant.
es: dh_auto_install es un programa de debhelper que intenta instalar automáticamente ficheros construidos. Para ello, ejecuta la orden adecuada para el sistema de construcción que detecta que usa su paquete. Por ejemplo, si hay un fichero «Makefile» y contiene un objetivo «install», ejecutará «make» (o MAKE, si se define la variable de entorno). Si existe un fichero «setup.py» o «Build.PL», se usará. Tenga en cuenta que el sistema de construcción Ant no permite la instalación, y por ello dh_auto_install no instalará ficheros construidos mediante Ant.

source: Unless --destdir option is specified, the files are installed into debian/<package>/ if there is only one binary package. In the multiple binary package case, the files are instead installed into debian/tmp/, and should be moved from there to the appropriate package build directory using L<dh_install(1)>.
es: A menos que se defina la opción «--destdir», los ficheros se instalan en «debian/<paquete>/» si sólo hay un paquete binario. En el caso de varios paquetes binarios, los ficheros se instalan en «debian/tmp/», y se deberían mover desde ahí al directorio de construcción del paquete usando L<dh_install(1)>.

source: DESTDIR is used to tell make where to install the files. If the Makefile was generated by MakeMaker from a Makefile.PL, it will automatically set PREFIX=/usr too, since such Makefiles need that.
es: «DESTDIR» se usa para indicar a make dónde instalar los ficheros. Si el fichero «Makefile» se generó mediante MakeMaker a partir de un fichero «Makefile.PL», definirá también «PREFIX=/usr», ya que lso ficheros «Makefile» lo requieren.

source: This is intended to work for about 90% of packages. If it doesn't work, or tries to use the wrong install target, you're encouraged to skip using dh_auto_install at all, and just run make install manually.
es: El objetivo es que funcione con el 90% de los paquetes. Si no funciona, o lo intenta usando el objetivo «install» equivocado, le animamos a que no use dh_auto_install, y que simplemente ejecute «make install» manualmente.

source: B<--destdir=>I<directory>
es: B<--destdir=>I<directorio>

source: Pass "params" to the program that is run. These can be used to supplement or override the any standard parameters that dh_auto_install passes.
es: Introduce los «parámetros» al programa a ejecutar. Se puede usar para añadir o anular cualquiera de los parámetros estándar que dh_auto_install introduce.

source: dh_auto_test - automatically runs a package's test suites
es: dh_auto_test - Ejecuta automáticamente un conjunto de pruebas de un paquete

source: B<dh_auto_test> [S<I<build system options>>] [S<I<debhelper options>>] [S<B<--> I<params>>]
es: B<dh_auto_test> [S<I<opciones-sistema-de-construcción>>] [S<I<opciones-de-debhelper>>] [S<B<--> I<parámetros>>]

source: dh_auto_test is a debhelper program that tries to automatically run a package's test suite. It does so by running the appropriate command for the build system it detects the package uses. For example, if there's a Makefile and it contains a "test" or "check" target, then this is done by running make (or MAKE, if the environment variable is set). If the test suite fails, the command will exit nonzero. If there's no test suite, it will exit zero without doing anything.
es: dh_auto_test es un programa de debhelper que intenta ejecutar automáticamente el conjunto de pruebas de un paquete. Para ello, ejecuta la orden adecuada para el sistema de construcción que detecta que usa el paquete. Por ejemplo, si hay un fichero «Makefile» y contiene un objetivo «test» o «check», ejecutará «make» (o MAKE, si se define la variable de entorno). Si el conjunto de pruebas falla, la orden cerrará con un valor distinto de cero. Si no hay un conjunto de pruebas, cerrará con un valor de cero sin hacer nada.

source: This is intended to work for about 90% of packages with a test suite. If it doesn't work, you're encouraged to skip using dh_auto_test at all, and just run the test suite manually.
es: La meta es que funcione para el 90% de los paquetes con un conjunto de pruebas. Si no funciona, le animamos a que no use dh_auto_test, y que simplemente ejecute el conjunto de pruebas manualmente.

source: Pass "params" to the program that is run. These can be used to supplement or override the any standard parameters that dh_auto_test passes.
es: Introduce los «parámetros» al programa que ejecuta. Se puede usar para añadir o anular cualquier parámetro estandar que dh_auto_test introduce.

source: If the DEB_BUILD_OPTIONS environment variable contains "nocheck", no tests will be performed.
es: No se realizará ninguna prueba si la variable de entorno DEB_BUILD_OPTIONS contiene «nocheck».

source: dh_bugfiles - install bug reporting customization files into package build directories
es: dh_bugfiles - Instala ficheros personalizados para el informe de fallos en los directorios de construcción del paquete

source: B<dh_bugfiles> [B<-A>] [S<I<debhelper options>>]
es: B<dh_bugfiles> [B<-A>] [S<I<opciones-de-debhelper>>]

source: dh_bugfiles is a debhelper program that is responsible for installing bug reporting customization files (bug scripts and/or bug control files and/or presubj files) into package build directories.
es: dh_bugfiles es un programa de debhelper responsable de la instalación de ficheros personalizados para el informe de fallos (scripts de fallos y/o ficheros de control de fallos y/o ficheros «presubj») en los directorios de construcción del paquete.

source: FILES
es: FICHEROS

source: debian/I<package>.bug-script
es: debian/I<paquete>.bug-script

source: This is the script to be run by the bug reporting program for generating a bug report template. This file is installed as F<usr/share/bug/package> in the package build directory if no other types of bug reporting customization files are going to be installed for the package in question. Otherwise, this file is installed as F<usr/share/bug/package/script>. Finally, the installed script is given execute permissions.
es: Este el script a ejecutar por el programa de informe de fallos para generar una plantilla de informe de fallo. El fichero se instala como F<usr/share/bug/package> en el directorio de construcción del paquete, si no se van a instalar en tal paquete otros ficheros personalizados de informe de fallos. En caso contrario, el fichero se instala como F<usr/share/bug/package/script>. Por último, se dan permisos de ejecución al script instalado.

source: debian/I<package>.bug-control
es: debian/I<paquete>.bug-control

source: It is the bug control file containing some directions for the bug reporting tool. This file is installed as F<usr/share/bug/package/control> in the package build directory.
es: El fichero de control de fallos, que contiene algunas indicaciones para la herramienta de informe de fallos. Este fichero se instala como F<usr/share/bug/package/control> en el directorio de construcción del paquete.

source: debian/I<package>.bug-presubj
es: debian/I<paquete>.bug-presubj

source: The contents of this file are displayed to the user by the bug reporting tool before allowing the user to write a bug report on the package to the Debian Bug Tracking System. This file is installed as F<usr/share/bug/package/presubj> in the package build directory.
es: La herramienta de informe de fallos muestra el contenido de este fichero al usuario antes de permitir a este escribir informe de fallo del paquete en el sistema de seguimiento de fallos de Debian. El fichero se instala como F<usr/share/bug/package/presubj> en el directorio de construcción del paquete.

source: Install debian/bug-* files to ALL packages acted on when respective debian/package.bug-* files do not exist. Normally, debian/bug-* will be installed to the first package only.
es: Instala ficheros «debian/bug-*» en todos los paquetes afectados cuando los ficheros «debian/package.bug-*» no existen. Habitualmente, «debian/bug-*» sólo se instala en el primer paquete.

source: dh_builddeb - build debian binary packages
es: dh_builddeb - Construye paquetes binarios de Debian

source: B<dh_builddeb> [S<I<debhelper options>>] [B<--destdir=>I<directory>] [B<--filename=>I<name>] [S<B<--> I<params>>]
es: B<dh_builddeb> [S<I<debhelper opciones>>] [B<--destdir=>I<directorio>] [B<--filename=>I<nombre>] [S<B<--> I<parámetros>>]

source: dh_builddeb simply calls L<dpkg-deb(1)> to build a debian package or packages.
es: dh_builddeb simplemente invoca L<dpkg-deb(1)> para construir uno o varios paquetes de Debian.
