Repository: elric/deb-l10n
Catalog: debhelper.po
Languages: es

source: Some debhelper commands may make the generated package need to depend on some other packages. For example, if you use L<dh_installdebconf(1)>, your package will generally need to depend on debconf. Or if you use L<dh_installxfonts(1)>, your package will generally need to depend on a particular version of xutils. Keeping track of these miscellaneous dependencies can be annoying since they are dependant on how debhelper does things, so debhelper offers a way to automate it.
es: Es posible que algunas órdenes de debhelper hagan que los paquetes generados dependan de otros paquetes. Por ejemplo, si usa L<dh_installdebconf(1)>, el paquete que genera dependerá de debconf. Si usa L<dh_installxfonts(1)>, el paquete dependerá de una determinada versión de xutils. Llevar la cuenta de todas estas dependencias puede ser tedioso porque dependen de como debhelper haga las cosas, y por ello debhelper ofrece una manera de automatizarlo.

source: All commands of this type, besides documenting what dependencies may be needed on their man pages, will automatically generate a substvar called ${misc:Depends}. If you put that token into your debian/control file, it will be expanded to the dependencies debhelper figures you need.
es: Todas las órdenes de este tipo, además de documentar qué dependencias pueden ser necesarias en las páginas del manual, generarán automáticamente una variable de substitución llamada ${misc:Depends}. Si introduce esta variable en el archivo debian/control, será expandida a las dependencias que debhelper crea oportunas.

source: This is entirely independent of the standard ${shlibs:Depends} generated by L<dh_makeshlibs(1)>, and the ${perl:Depends} generated by L<dh_perl(1)>. You can choose not to use any of these, if debhelper's guesses don't match reality.
es: Esto es totalmente independiente de la estándar ${shlibs:Depends} generada por L<dh_makeshlibs(1)>, y de la ${perl:Depends} generada por L<dh_perl(1)>. Puedes elegir no elegir ninguna de estas si la expansión de debhelper de estas variables no son correctas.

source: Package build directories
es: Directorios de construcción del paquete

source: By default, all debhelper programs assume that the temporary directory used for assembling the tree of files in a package is debian/<package>.
es: Por defecto, todos los programas de debhelper asumen que el directorio temporal usado para ensamblar el árbol de ficheros en un paquete es debian/<paquete>.

source: Sometimes, you might want to use some other temporary directory. This is supported by the -P flag. For example, "dh_installdocs -Pdebian/tmp", will use debian/tmp as the temporary directory. Note that if you use -P, the debhelper programs can only be acting on a single package at a time. So if you have a package that builds many binary packages, you will need to also use the -p flag to specify which binary package the debhelper program will act on.
es: Algunas veces, puede que desee usar otro directorio temporal. Esto se puede conseguir con la opción -P. Por ejemplo, "dh_installdocs -Pdebian/tmp", usará el directorio debian/tmp como directorio temporal. Dese cuenta que si usas la opción -P, los programas de debhelper sólo pueden actuar sobre un paquete a la vez. Por eso, si tiene un paquete que construye muchos paquetes binarios, tendrá que hacer uso de la opción -p para especificar el paquete binario sobre el que debhelper actuará.

source: Debhelper compatibility levels
es: Niveles de compatibilidad de debhelper

source: From time to time, major non-backwards-compatible changes need to be made to debhelper, to keep it clean and well-designed as needs change and its author gains more experience. To prevent such major changes from breaking existing packages, the concept of debhelper compatibility levels was introduced. You tell debhelper which compatibility level it should use, and it modifies its behavior in various ways.
es: Cada cierto tiempo, debhelper necesita cambios que lo pueden hacer incompatible con versiones anteriores, para de este modo continuar con un buen y limpio diseño a medida que las necesidades cambian y que su autor gana más experiencia. Los niveles de compatibilidad de debhelper se crearon para impedir que estos cambios estropeen algún paquete. Según el nivel de compatibilidad que se especifique debhelper se comporta de diferentes maneras.

source: Tell debhelper what compatibility level to use by writing a number to debian/compat. For example, to turn on v8 mode:
es: Para especificar a debhelper qué nivel de compatibilidad usar, debe escribir un número en «debian/compat». Por ejemplo, para activar el modo V8:

source: Unless otherwise indicated, all debhelper documentation assumes that you are using the most recent compatibility level, and in most cases does not indicate if the behavior is different in an earlier compatibility level, so if you are not using the most recent compatibility level, you're advised to read below for notes about what is different in earlier compatibility levels.
es: A menos que se indique lo contrario, toda la documentación de debhelper supone que usa el nivel de compatibilidad más reciente, y en la mayoría de los casos no indica si el comportamiento de debhelper es distinto bajo otro nivel de compatibilidad. Por ello, si no está usando el nivel de compatibilidad más reciente, recomendamos que lea a continuación las notas acerca de qué es distinto bajo anteriores niveles de compatibilidad.

source: These are the available compatibility levels:
es: Los niveles de compatibilidad disponibles son:

source: This is the original debhelper compatibility level, and so it is the default one. In this mode, debhelper will use debian/tmp as the package tree directory for the first binary package listed in the control file, while using debian/<package> for all other packages listed in the control file.
es: Este es el nivel de compatibilidad original de debhelper, y por tanto es el nivel predeterminado. En este modo, debhelper usa «debian/tmp» como el árbol de directorios del paquete, y «debian/paquete» para el resto de paquetes listados en el fichero de control.

source: This mode is deprecated.
es: Este modo está obsoleto.

source: In this mode, debhelper will consistently use debian/<package> as the package tree directory for every package that is built.
es: En este modo, debhelper usará «debian/<paquete> como» de forma consistente como el árbol de directorios para cada paquete que se construya.

source: This mode works like v2, with the following additions:
es: Este modo funciona como v2, con los siguientes añadidos:

source: Debhelper config files support globbing via * and ?, when appropriate. To turn this off and use those characters raw, just prefix with a backslash.
es: Los ficheros de configuración de Debhelper aceptan comodines globales mediante «*» y «?» cuando sea apropiado. Para usar «*» y «?» simplemente como caracteres debe insertar como prefijo una barra invertida.

source: dh_makeshlibs makes the postinst and postrm scripts call ldconfig.
es: dh_makeshlibs hace que los scripts postinst y postrm ejecuten ldconfig.

source: Every file in etc/ is automatically flagged as a conffile by dh_installdeb.
es: dh_installdeb marca automáticamente todos los ficheros en «etc/» como conffiles.

source: Changes from v3 are:
es: Los cambios desde el nivel v3 son:

source: dh_makeshlibs -V will not include the debian part of the version number in the generated dependency line in the shlibs file.
es: dh_makeshlibs -V no incluirá la parte de Debian en el numero de versión generado en la línea de dependencias del fichero «shlibs».

source: You are encouraged to put the new ${misc:Depends} into debian/control to supplement the ${shlibs:Depends} field.
es: Se aconseja que use el nuevo ${misc:Depends} en «debian/control» para reemplazar el campo ${shlibs:Depends}.

source: dh_fixperms will make all files in bin/ directories and in etc/init.d executable.
es: dh_fixperms hará ejecutables todos los ficheros en los directorios «bin/» y «etc/init.d».

source: dh_link will correct existing links to conform with policy.
es: dh_link corregirá los enlaces existentes para ajustarse a las normas de Debian.

source: Changes from v4 are:
es: Los cambios desde el nivel v4 son:

source: Comments are ignored in debhelper config files.
es: Se ignoran los comentarios en los ficheros de configuración de debhelper.

source: dh_strip --dbg-package now specifies the name of a package to put debugging symbols in, not the packages to take the symbols from.
es: «dh_strip --dbg-paquete» ahora especifica el nombre del paquete en el que se colocan los símbolos de depuración, no los paquetes desde los que obtener los símbolos.

source: dh_installdocs skips installing empty files.
es: dh_installdocs omite la instalación de ficheros vacíos.

source: dh_install errors out if wildcards expand to nothing.
es: dh_install devuelve un error si los comodines se expanden a un valor vacío.

source: Changes from v5 are:
es: Los cambios desde el nivel v5 son:

source: Commands that generate maintainer script fragments will order the fragments in reverse order for the prerm and postrm scripts.
es: Las órdenes que generan segmentos de scripts del encargado de paquetes ordenarán estos segmentos en orden inverso para los scripts «prerm» y «postrm».

source: dh_installwm will install a slave manpage link for x-window-manager.1.gz, if it sees the man page in usr/share/man/man1 in the package build directory.
es: dh_installwm instalará un enlace esclavo a la página de manual x-window-manager.1.gz en caso de encontrar la página de manual en «usr/share/man/man1» dentro del directorio de construcción del paquete.

source: dh_builddeb did not previously delete everything matching DH_ALWAYS_EXCLUDE, if it was set to a list of things to exclude, such as "CVS:.svn:.git". Now it does.
es: Anteriormente, dh_builddeb no eliminaba todo aquello que coincidiese con «DH_ALWAYS_EXCLUDE», si es que se definía con una lista de elementos a excluir, como por ejemplo «CVS:.svn:.git». Ahora sí lo hace.

source: dh_installman allows overwriting existing man pages in the package build directory. In previous compatibility levels it silently refuses to do this.
es: dh_installman permite sobreescribir páginas de manual existentes en el directorio de construcción del paquete. Bajo los niveles de compatibilidad anteriores simplemente rechazaba hacerlo, de forma silenciosa.

source: Changes from v6 are:
es: Los cambios desde el nivel v6 son:

source: dh_install, will fall back to looking for files in debian/tmp if it doesn't find them in the current directory (or wherever you tell it look using --sourcedir). This allows dh_install to interoperate with dh_auto_install, which installs to debian/tmp, without needing any special parameters.
es: dh_install buscará ficheros en «debian/tmp» de forma predeterminada si no los encuentra en el directorio actual (o donde indicó hacerlo mediante «--sourcedir»). Esto permite la interoperabilidad entre dh_install y dh_auto_install, que instala en «debian/tmp», sin necesidad de parámetros especiales.

source: dh_clean will read debian/clean and delete files listed there.
es: dh_clean leerá «debian/clean» y eliminará los ficheros ahí listados.

source: dh_clean will delete toplevel *-stamp files.
es: dh_clean eliminará ficheros «*-stamp» del nivel superior.

source: dh_installchangelogs will guess at what file is the upstream changelog if none is specified.
es: dh_installchangelogs intentará averiguar el fichero de registro de cambios de la fuente original si no se especifica ninguno.

source: This is the recommended mode of operation.
es: Este es el modo de operación aconsejado.

source: Changes from v7 are:
es: Los cambios desde el nivel v7 son:

source: Commands will fail rather than warning when they are passed unknown options.
es: Las órdenes fallarán, en lugar de emitir un aviso, cuando se les introduzcan opciones desconocidas.

source: dh_makeshlibs will run dpkg-gensymbols on all shared libraries that it generates shlibs files for. So -X can be used to exclude libraries. Also, libraries in unusual locations that dpkg-gensymbols would not have processed before will be passed to it, a behavior change that can cause some packages to fail to build.
es: dh_makeshlibs ejecutará dpkg-gensymbols sobre todas las bibliotecas compartidas para las que genera ficheros «shlibs». Por ello, puede usar «-X» para excluir bibliotecas. Así mismo, se introducirán a dpkg-gensymbols bibliotecas en ubicaciones inusuales que antes no procesaba, un cambio de comportamiento que puede impedir la construcción de algunos paquetes.

source: dh requires the sequence to run be specified as the first parameter, and any switches come after it. Ie, use "dh $@ --foo", not "dh --foo $@"
es: dh requiere que la secuencia a ejecutar se defina como el primer parámetro, y que las opciones aparezcan a continuación. Por ejemplo, use «dh $@ --foo», no «dh --foo $@».

source: dh_auto_* prefer to use perl's Module::Build in preference to Makefile.PL.
es: dh_auto_* prefiere usar el módulo de Perl Module::Build con preferencia a «Makefile.PL».

source: Debhelper includes support for udebs. To create a udeb with debhelper, add "Package-Type: udeb" to the package's stanza in debian/control, and build-depend on debhelper (>= 4.2). Debhelper will try to create udebs that comply with debian-installer policy, by making the generated package files end in ".udeb", not installing any documentation into a udeb, skipping over preinst, postrm, prerm, and config scripts, etc.
es: Debhelper incluye compatibilidad con udebs. Para crear un udeb con debhelper, añada «Package-Type: udeb» al párrafo del paquete binario en «debian/control», y una dependencia de construcción sobre debhelper (>= 4.2). Debhelper tratará de crear udebs que cumplan con las normas de debian-installer, haciendo que los ficheros de los paquetes terminen en «.udeb», no instalando ninguna documentación en un udeb, y omitiendo los scripts «preinst», «postrm», «prerm», «config», etc.

source: Other notes
es: Otras notas

source: In general, if any debhelper program needs a directory to exist under debian/, it will create it. I haven't bothered to document this in all the man pages, but for example, dh_installdeb knows to make debian/<package>/DEBIAN/ before trying to put files there, dh_installmenu knows you need a debian/<package>/usr/share/menu/ before installing the menu files, etc.
es: En general, si algún programa de debhelper necesita que exista un directorio bajo «debian/», lo creará. No me he preocupado por documentarlo en todas las páginas del manual, pero por ejemplo, dh_installdeb sabe crear «debian/<paquete>/DEBIAN/» antes de tratar de poner ahí los ficheros, dh_installmenu sabe que necesita «debian/<paquete>/usr/share/menu/» antes de instalar los ficheros del menú, etc.

source: Once your package uses debhelper to build, be sure to add debhelper to your Build-Depends line in debian/control. You should build-depend on a version of debhelper equal to (or greater than) the debhelper compatibility level your package uses. So if your package used compatibility level 7:
es: Una vez que su paquete usa debhelper para construirse, asegúrese de añadir debhelper a sus dependencias de construcción en «debian/control». Debería usar como dependencia de construcción («build-depend») una versión de debhelper igual (o mayor) que el nivel de compatibilidad de debhelper que use su paquete. Por ejemplo, si su paquete usa el nivel de compatibilidad 7:

source: ENVIRONMENT
es: ENTORNO

source: Set to 1 to enable verbose mode. Debhelper will output every command it runs that modifies files on the build system.
es: Defina como 1 para activar el modo explicativo. Debhelper mostrará todas las órdenes usadas que modifiquen ficheros en el sistema en el que se hace la construcción.

source: Temporarily specifies what compatibility level debhelper should run at, overriding any value in debian/compat.
es: Especifica temporalmente bajo qué nivel de compatibilidad debe actuar debhelper, ignorando cualquier valor en «debian/compat».

source: Set to 1 to enable no-act mode.
es: Defina como 1 para habilitar el modo no-act.

source: Anything in this variable will be prepended to the command line arguments of all debhelper commands. Command-specific options will be ignored by commands that do not support them.
es: Se añadirá a los argumentos de línea de órdenes de todas las órdenes de debhelper cualquier dato contenido en esta variable. Las opciones específicas a ciertas ordenes se ignorarán por las órdenes que no las acepten.

source: This is useful in some situations, for example, if you need to pass -p to all debhelper commands that will be run. One good way to set DH_OPTIONS is by using "Target-specific Variable Values" in your debian/rules file. See the make documentation for details on doing this.
es: Esto es útil en algunas situaciones, por ejemplo, si necesita introducir la opción «-p» a todas las órdenes de debhelper que va a utilizar. Una buena manera de dar un valor a «DH_OPTIONS» es usando «Target-specific Variable Values» en su fichero «debian/rules». Consulte la documentación de make para los detalles sobre como hacer esto.

source: If set, this adds the value the variable is set to to the -X options of all commands that support the -X option. Moreover, dh_builddeb will rm -rf anything that matches the value in your package build tree.
es: Si se define, añade su valor a la opción «-X» de todas las órdenes que permiten dicha opción. Es más, dh_builddeb ejecutará «rm -rf» con todo lo que coincida con el valor dentro del árbol de construcción del paquete.

source: This can be useful if you are doing a build from a CVS source tree, in which case setting DH_ALWAYS_EXCLUDE=CVS will prevent any CVS directories from sneaking into the package you build. Or, if a package has a source tarball that (unwisely) includes CVS directories, you might want to export DH_ALWAYS_EXCLUDE=CVS in debian/rules, to make it take effect wherever your package is built.
es: Puede ser útil si está compilando desde un árbol de CVS, en cuyo caso estableciendo «DH_ALWAYS_EXCLUDE=CVS» evitará que los directorios CVS se introduzcan en el paquete construido. O, si su paquete original (imprudentemente) incluye directorios CVS, puede ser útil exportar «ALWAYS_EXCLUDE=CVS» en «debian/rules», para que esto tenga efecto en cualquier sitio donde se construya el paquete.

source: Multiple things to exclude can be separated with colons, as in DH_ALWAYS_EXCLUDE=CVS:.svn
es: Puede separa varias cosas a excluir mediante dos puntos, por ejemplo: DH_ALWAYS_EXCLUDE=CVS:.svn

source: SEE ALSO
es: VÉASE TAMBIÉN

source: A set of example debian/rules files that use debhelper.
es: Varios ficheros de ejemplo debian/rules que usan debhelper.

source: Debhelper web site.
es: Sitio web de Debhelper.

source: AUTHOR
es: AUTOR

source: dh - debhelper command sequencer
es: dh - Secuenciador de órdenes de debhelper

source: B<dh> sequence [B<--with> I<addon>[,I<addon>,...]] [B<--list>] [B<--until> I<cmd>] [B<--before> I<cmd>] [B<--after> I<cmd>] [B<--remaining>] [S<I<debhelper options>>]
es: B<dh> secuencia [B<--with> I<extensión>[,I<extensión>,...]] [B<--list>] [B<--until> I<orden>] [B<--before> I<orden>] [B<--after> I<orden>] [B<--remaining>] [S<I<opciones-de-debhelper>>]

source: dh runs a sequence of debhelper commands. The supported sequences correspond to the targets of a debian/rules file: "build", "clean", "install", "binary-arch", "binary-indep", and "binary".
es: dh ejecuta una secuencia de órdenes de debhelper. Las secuencias aceptadas se corresponden con los objetivos de un fichero «debian/rules»: build, clean, install, binary-arch, binary-indep y binary.

source: Commands in the binary-indep sequence are passed the "-i" option to ensure they only work on binary independent packages, and commands in the binary-arch sequences are passed the "-a" option to ensure they only work on architecture dependent packages.
es: La opción «-i» se introduce a las órdenes en la secuencia binary-indep para asegurar que sólo actúan sobre paquetes binarios independientes, y la opción «-a» se introduce a órdenes en la secuencia binary-arch para asegurar que sólo actúan sobre paquetes dependientes de la arquitectura.

source: If debian/rules contains a target with a name like "override_I<dh_command>", then when it would normally run I<dh_command>, dh will instead call that target. The override target can then run the command with additional options, or run entirely different commands instead. See examples below. (Note that to use this feature, you should Build-Depend on debhelper 7.0.50 or above.)
es: Si «debian/rules» contiene un objetivo con un nombre del tipo «override_I<dh_command>», dh invocará este objetivo en lugar de ejecutar I<dh_command>. El objetivo «override» puede después ejecutar la orden con opciones adicionales, o ejecutar otras órdenes totalmente diferentes. Consulte los ejemplos más abajo. Tenga en cuenta que para usar esta funcionalidad, el paquete debe tener una dependencia de construcción sobre la versión 7.0.50 de debhelper, o superior.

source: OPTIONS
es: OPCIONES

source: B<--with> I<addon>[,I<addon>,...]
es: B<--with> I<extensión>[,I<extensión>,...]

source: Add the debhelper commands specified by the given addon to appropriate places in the sequence of commands that is run. This option can be repeated more than once, or multiple addons can be listed, separated by commas. This is used when there is a third-party package that provides debhelper commands. See the PROGRAMMING file for documentation about the sequence addon interface.
es: Añade las órdenes de debhelper definidas con la extensión dada a los lugares apropiados de la secuencia de órdenes que se va a ejecutar. Esta opción se puede repetir varias veces, o puede listar varias extensiones, separadas por comas. Se usa cuando hay un paquete de terceras fuentes que proporciona órdenes de debhelper. Para más documentación sobre la interfaz de extensión de secuencia consulte el fichero «PROGRAMMING».

source: The inverse of --with, disables using the given addon.
es: El reverso de «--with», desactiva la extensión dada.

source: List all available addons.
es: Lista todas las extensiones disponibles.

source: B<--until> I<cmd>
es: B<--until> I<orden>

source: Run commands in the sequence until and including I<cmd>, then stop.
es: Ejecuta las órdenes en la secuencia hasta la I<orden>, inclusive, y cierra.

source: B<--before> I<cmd>
es: B<--before> I<orden>

source: Run commands in the sequence before I<cmd>, then stop.
es: Ejecuta las órdenes en la secuencia anteriores a I<orden>, y cierra.

source: B<--after> I<cmd>
es: B<--after> I<orden>

source: Run commands in the sequence that come after I<cmd>.
es: Ejecuta las órdenes en la secuencia posteriores a I<orden>.

source: Run all commands in the sequence that have yet to be run.
es: Ejecuta todas las órdenes en la secuencia que aún no se han ejecutado.

source: Prints commands that would run for a given sequence, but does not run them.
es: Muestra las órdenes que se ejecutarían para una secuencia dada, pero no las ejecuta.

source: All other options passed to dh are passed on to each command it runs. This can be used to set an option like "-v" or "-X" or "-N", as well as for more specialised options.
es: Todas las demás opciones introducidas a dh se introducen a cada orden que ejecuta. Puede usar esto para definir una opción como «-v», «-X» o «-N», así como opciones más especializadas.
