Repository: elric/deb-l10n
Catalog: debhelper.po
Languages: es

source: B<dh_md5sums> [S<I<debhelper options>>] [B<-x>] [B<-X>I<item>] [B<--include-conffiles>]
es: B<dh_md5sums> [S<I<debhelper opciones>>] [B<-x>] [B<-X>I<elemento>] [B<--include-conffiles>]

source: dh_md5sums is a debhelper program that is responsible for generating a DEBIAN/md5sums file, which lists the md5sums of each file in the package. These files are used by the debsums package.
es: dh_md5sums es un programa de debhelper que es responsable de generar un fichero DEBIAN/md5sums, el cual lista las sumas md5 de cada fichero en el paquete. Estos ficheros son usados por el paquete debsums.

source: All files in DEBIAN/ are omitted from the md5sums file, as are all conffiles (unless you use the --include-conffiles switch).
es: Todos los ficheros en DEBIAN/ son omitidos del fichero md5sums, puesto que todos son conffiles (al menos que usted use el modificador --include-conffiles).

source: The md5sums file is installed with proper permissions and ownerships.
es: El fichero md5sums es instalado con los permisos y propietarios adecuados.

source: Include conffiles in the md5sums list. Note that this information is redundant since it is included elsewhere in debian packages.
es: Incluye los conffiles en la lista de sumas md5. Note que esta información es redundante puesto que esta incluida en otro lugar de los paquetes debian.

source: Exclude files that contain "item" anywhere in their filename from being listed in the md5sums file.
es: Excluye ficheros que contienen "elemento" en cualquier lugar de su nombre, de ser listados en el fichero md5sums.

source: dh_movefiles - move files out of debian/tmp into subpackages
es: dh_movefiles - mueve ficheros de debian/tmp en subpaquetes

source: B<dh_movefiles> [S<I<debhelper options>>] [B<--sourcedir=>I<dir>] [B<-X>I<item>] S<I<file ...>>]
es: B<dh_movefiles> [S<I<debhelper opciones>>] [B<--sourcedir=>I<dir>] [B<-X>I<elemento>] S<I<fichero ...>>]

source: dh_movefiles is a debhelper program that is responsible for moving files out of debian/tmp or some other directory and into other package build directories. This may be useful if your package has a Makefile that installs everything into debian/tmp, and you need to break that up into subpackages.
es: dh_movefiles es un programa de debhelper que es responsable de mover ficheros de debian/tmp o algún otro directorio y ubicarlos dentro de otros directorios de construcción de paquetes. Esto podría ser útil si su paquete tiene un Makefile que instala todo en debian/tmp, y usted necesita dividirlos en subpaquetes.

source: Note: dh_install is a much better program, and you are recommended to use it instead of dh_movefiles.
es: Nota: dh_install es un programa mejor, y recomendamos su uso en lugar de dh_movefiles.

source: debian/I<package>.files
es: debian/I<paquete>.files

source: Lists the files to be moved into a package, separated by whitespace. The filenames listed should be relative to debian/tmp/. You can also list directory names, and the whole directory will be moved.
es: Lista los ficheros a ser movidos a un paquete, separados por espacios en blanco. Los nombres de los ficheros listados deben ser relativos a «debian/tmp/». Tambíén puede listar nombres de directorios, y así todo el directorio se moverá.

source: B<--sourcedir=>I<dir>
es: B<--sourcedir=>I<directorio>

source: Lists files to move. The filenames listed should be relative to debian/tmp/. You can also list directory names, and the whole directory will be moved. It is an error to list files here unless you use -p, -i, or -a to tell dh_movefiles which subpackage to put them in.
es: Lista ficheros a mover. Los nombres de fichero listados deben ser relativos a debian/tmp/. Usted también puede listar nombres de directorio, y el directorio completo será movido. Es un error listar ficheros aquí al menos que usted use -p, -i, o -a para indicar a dh_movefiles en que subpaquete colocarlos.

source: Note that files are always moved out of debian/tmp by default (even if you have instructed debhelper to use a compatibility level higher than one, which does not otherwise use debian/tmp for anything at all). The idea behind this is that the package that is being built can be told to install into debian/tmp, and then files can be moved by dh_movefiles from that directory. Any files or directories that remain are ignored, and get deleted by dh_clean later.
es: Note que los ficheros son siempre movidos de debian/tmp por omisión (aún si usted indicó a debhelper usar nivel de compatibilidad superior a uno, con lo cual no usa debian/tmp para nada). La idea detrás de esto es que el paquete que esta siendo construido pueda ser instalado en debian/tmp, y entonces los ficheros pueden ser movidos por dh_movefiles desde ese directorio. Los ficheros o directorios que permanezcan son ignorados, y luego son eliminados por dh_clean.

source: dh_perl - calculates perl dependencies and cleans up after MakeMaker
es: dh_perl - Calcula dependencias de Perl y limpia después de MakeMaker

source: B<dh_perl> [S<I<debhelper options>>] [B<-d>] [S<I<library dirs ...>>]
es: B<dh_perl> [S<I<opciones-de-debhelper>>] [B<-d>] [S<I<directorios-biblioteca ...>>]

source: dh_perl is a debhelper program that is responsible for generating the ${perl:Depends} substitutions and adding them to substvars files.
es: dh_perl es un programa de debhelper que se encarga de generar las substituciones ${perl:Depends} y añadirlas a los ficheros substvars.

source: The program will look at perl scripts and modules in your package, and will use this information to generate a dependency on perl or perlapi. The dependency will be substituted into your package's control file wherever you place the token "${perl:Depends}".
es: El programa buscará scripts y módulos perl en su paquete, y usará esta información para generar una dependencia en perl o perlapi. La dependencia será substituida en el fichero de control de su paquete dondequiera que usted ubique la señal "${perl:Depends}".

source: dh_perl also cleans up empty directories that MakeMaker can generate when installing perl modules.
es: dh_perl también limpia los directorios vacíos que MakeMaker puede generar al instalar módulos de Perl.

source: In some specific cases you may want to depend on perl-base rather than the full perl package. If so, you can pass the -d option to make dh_perl generate a dependency on the correct base package. This is only necessary for some packages that are included in the base system.
es: En algunos casos específicos usted podría querer depender de perl-base en lugar de todo el paquete de perl. De ser así, usted puede especificar la opción -d para que dh_perl genere una dependencia en el paquete base correcto. Esto es solamente necesario para algunos paquete que están incluidos en el sistema base.

source: Note that this flag may cause no dependency on perl-base to be generated at all. perl-base is Essential, so its dependency can be left out, unless a versioned dependency is needed.
es: Note que este parámetro podría causar que no se genere ninguna dependencia en perl-base. perl-base es Essential, de modo que su dependencia en él se puede obviar, a menos que se requiera una dependencia de versiones.

source: By default, scripts and architecture independent modules don't depend on any specific version of perl. The -V option causes the current version of the perl (or perl-base with -d) package to be specified.
es: Por omisión, los scripts y módulos independientes de la arquitectura dependen de cualquier versión de perl. La opción -V hace que la versión actual del paquete perl (o perl-base con -d) sea especificada.

source: I<library dirs>
es: I<dirs biblioteca>

source: If your package installs perl modules in non-standard directories, you can make dh_perl check those directories by passing their names on the command line. It will only check the vendorlib and vendorarch directories by default.
es: Si su paquete instala módulos perl en directorios que no sean estándares, usted puede hacer que dh_perl verifique estos directorios especificando sus nombres en la línea de órdenes. Éste solamente verificará el directorio vendorlib y vendorarch por omisión.

source: Debian policy, version 3.8.3
es: Normas de Debian, versión 3.8.3

source: Perl policy, version 1.20
es: Normas de Perl, versión 1.20

source: dh_prep - perform cleanups in preparation for building a binary package
es: dh_prep - Realiza una limpieza para preparar la construcción de un paquete binario

source: B<dh_prep> [S<I<debhelper options>>] [B<-X>I<item>]
es: B<dh_prep> [S<I<opciones-de-debhelper>>] [B<-X>I<elemento>]

source: dh_prep is a debhelper program that performs some file cleanups in preparation for building a binary package. (This is what dh_clean -k used to do.) It removes the package build directories, debian/tmp, and some temp files that are generated when building a binary package.
es: dh_prep es un programa de debhelper que realiza algunas limpiezas de ficheros para preparar la construcción de un paquete binario. (Eso lo solía hacer «dh_clean -k».) Elimina los directorios de construcción del paquete, «debian/tmp» y algunos ficheros temporales generados al construir un paquete binario.

source: It is typically run at the top of the binary-arch and binary-indep targets, or at the top of a target such as install that they depend on.
es: Habitualmente, se ejecuta al principio de los objetivos binary-arch y binary-indep, o al principio de un objetivo sobre el que dependan, como install.

source: dh_python - calculates python dependencies and adds postinst and prerm python scripts (deprecated)
es: dh_python - Calcula dependencias de Python y añade scripts de Python postinst y prerm

source: B<dh_python> [S<I<debhelper options>>] [B<-n>] [B<-V> I<version>] [S<I<module dirs ...>>]
es: B<dh_python> [S<I<opciones-de-debhelper>>] [B<-n>] [B<-V> I<versión>] [S<I<dirs módulos...>>]

source: Note: This program is deprecated. You should use dh_pysupport or dh_pycentral instead. This program will do nothing if debian/pycompat or a Python-Version control file field exists.
es: Nota: Este programa está obsoleto. Debería usar dh_pysupport o dh_pycentral en su lugar. Este programa no hará nada si «debian/pycompat» existe, o si hay un campo Python-Version en el fichero de control.

source: dh_python is a debhelper program that is responsible for generating the ${python:Depends} substitutions and adding them to substvars files. It will also add a postinst and a prerm script if required.
es: dh_python es un programa de debhelper que se encarga de generar las substituciones ${python:Depends} y añadirlas a los ficheros substvars. También añadirá un script postinst y un prerm de ser necesario.

source: The program will look at python scripts and modules in your package, and will use this information to generate a dependency on python, with the current major version, or on pythonX.Y if your scripts or modules need a specific python version. The dependency will be substituted into your package's control file wherever you place the token "${python:Depends}".
es: El programa buscará scripts y módulos python en su paquete, y usará esta información para generar una dependencia en python, con la versión mayor actual, o en pythonX.Y si sus scripts o módulos necesitan una versión específica de python. La dependencia será sustituida en el fichero de control de su paquete, dondequiera que haya puesto la señal "${python:Depends}".

source: If some modules need to be byte-compiled at install time, appropriate postinst and prerm scripts will be generated. If already byte-compiled modules are found, they are removed.
es: Si algunos módulos necesitan ser compilados al momento de instalación, se generarán los scripts apropiados postinst y prerm. Si se encuentran módulos ya compilados, se eliminarán.

source: If you use this program, your package should build-depend on python.
es: Si usted usa este programa, su paquete debería incluir python en las dependencias de construcción.

source: I<module dirs>
es: I<dirs módulos>

source: If your package installs python modules in non-standard directories, you can make dh_python check those directories by passing their names on the command line. By default, it will check /usr/lib/site-python, /usr/lib/$PACKAGE, /usr/share/$PACKAGE, /usr/lib/games/$PACKAGE, /usr/share/games/$PACKAGE and /usr/lib/python?.?/site-packages.
es: Si su paquete instala módulos python en directorios que no sean estándares, usted puede hacer que dh_python verifique estos directorios especificando sus nombres en la línea de órdenes. Por omisión, verificará /usr/lib/site-python, /usr/lib/$PACKAGE, /usr/share/$PACKAGE, /usr/lib/games/$PACKAGE, /usr/share/games/$PACKAGE y /usr/lib/python?.?/site-packages.

source: Note: only /usr/lib/site-python, /usr/lib/python?.?/site-packages and the extra names on the command line are searched for binary (.so) modules.
es: Nota: sólo se buscan módulos binarios (.so) en /usr/lib/site-python, /usr/lib/python?.?/site-packages y en los directorios extra proporcionados mediante la línea de órdenes.

source: B<-V> I<version>
es: B<-V> I<versión>

source: If the .py files your package ships are meant to be used by a specific pythonX.Y version, you can use this option to specify the desired version, such as 2.3. Do not use if you ship modules in /usr/lib/site-python.
es: Si los ficheros .py que instala su paquete deben usarse con una versión determinada pythonX.Y, puede usar esta opción con la versión X.Y de python deseada. No lo use si instala módulos en /usr/lib/site-python.

source: Debian policy, version 3.5.7
es: Normas de Debian, versión 3.5.7

source: Python policy, version 0.3.7
es: Normas de Python, versión 0.3.7

source: most ideas stolen from Brendan O'Dea <bod@debian.org>
es: muchas de las ideas tomadas de Brendan O'Dea <bod@debian.org>

source: B<dh_scrollkeeper> [S<I<debhelper options>>] [B<-n>] [S<I<directory>>]
es: B<dh_scrollkeeper> [S<I<opciones-de-debhelper>>] [B<-n>] [S<I<directorio>>]

source: dh_shlibdeps - calculate shared library dependencies
es: dh_shlibdeps - Calcula dependencias de bibliotecas compartidas

source: B<dh_shlibdeps> [S<I<debhelper options>>] [B<-L>I<package>] [B<-l>I<directory>] [B<-X>I<item>] [S<B<--> I<params>>]
es: B<dh_shlibdeps> [S<I<opciones-de-debhelper>>] [B<-L>I<paquete>] [B<-l>I<directorio>] [B<-X>I<elemento>] [S<B<--> I<parámetros>>]

source: dh_shlibdeps is a debhelper program that is responsible for calculating shared library dependencies for packages.
es: dh_shlibdeps es un programa de debhelper responsable de calcular las dependencias en bibliotecas compartidas de los paquetes.

source: This program is merely a wrapper around L<dpkg-shlibdeps(1)> that calls it once for each package listed in the control file, passing it a list of ELF executables and shared libraries it has found.
es: Este programa es encapsulado dentro de L<dpkg-shlibdeps(1)> el cual lo llama una vez por cada paquete listado en el fichero de control, pasándole una lista de ejecutables ELF y bibliotecas compartidas que ha encontrado.

source: Exclude files that contain "item" anywhere in their filename from being passed to dpkg-shlibdeps. This will make their dependencies be ignored. This may be useful in some situations, but use it with caution. This option may be used more than once to exclude more than one thing.
es: Excluye ficheros que contienen "elemento" en cualquier lugar de su nombre de ser pasados a dpkg-shlibdeps. Esto hará que sus dependencias sean ignoradas. Esto puede ser útil en algunas situaciones, pero úselo con cuidado. Esta opción puede ser usada más de una vez para excluir más de una cosa.

source: Pass "params" to L<dpkg-shlibdeps(1)>.
es: Introduce los «parámetros» a L<dpkg-shlibdeps(1)>.

source: B<-u>I<params>, B<--dpkg-shlibdeps-params=>I<params>
es: B<-u>I<parámetros>, B<--dpkg-shlibdeps-params=>I<parámetros>

source: B<-l>I<directory>[:directory:directory:..]
es: B<-l>I<directorio>[:directorio:directorio:..]

source: With recent versions of dpkg-shlibdeps, this option is generally not needed.
es: Esta opción no es necesaria habitualmente con las últimas versiones de dpkg-shlibdeps.

source: B<-L>I<package>, B<--libpackage=>I<package>
es: B<-L>I<paquete>, B<--libpackage=>I<paquete>

source: Suppose that your source package produces libfoo1, libfoo-dev, and libfoo-bin binary packages. libfoo-bin links against libfoo1, and should depend on it. In your rules file, first run dh_makeshlibs, then dh_shlibdeps:
es: Suponga que su paquete fuente crea los paquetes binarios libfoo1, libfoo-dev y libfoo-bin. libfoo-bin se enlaza contra libfoo1 y debería depender de éste. En su fichero rules, primero debe ejecutar dh_makeshlibs, luego dh_shlibdeps:

source: This will have the effect of generating automatically a shlibs file for libfoo1, and using that file and the libfoo1 library in the debian/libfoo1/usr/lib directory to calculate shared library dependency information.
es: Esto generará automáticamente un fichero shlibs para libfoo1, y usará este fichero y la biblioteca libfoo1 en el directorio debian/libfoo1/usr/lib para calcular la información de dependencias en bibliotecas compartidas.

source: dh_strip - strip executables, shared libraries, and some static libraries
es: dh_strip - Ejecuta strip sobre ejecutables, bibliotecas compartidas y algunas bibliotecas estáticas

source: B<dh_strip> [S<I<debhelper options>>] [B<-X>I<item>] [--dbg-package=package] [--keep-debug]
es: B<dh_strip> [S<I<opciones debhelper>>] [B<-X>I<elemento>] [--dbg-package=paquete] [--keep-debug]

source: dh_strip is a debhelper program that is responsible for stripping executables, shared libraries, and static libraries that are not used for debugging.
es: dh_strip es un programa de debhelper que es responsable de eliminar los símbolos de los ejecutables, bibliotecas compartidas y estáticas que no son usadas para depuración.

source: This program examines your package build directories and works out what to strip on its own. It uses L<file(1)> and file permissions and filenames to figure out what files are shared libraries (*.so), executable binaries, and static (lib*.a) and debugging libraries (lib*_g.a, debug/*.so), and strips each as much as is possible. (Which is not at all for debugging libraries.) In general it seems to make very good guesses, and will do the right thing in almost all cases.
es: Este programa examina sus directorios de construcción de paquetes y trabaja en lo que debe eliminar. Usa L<file(1)> y permisos y nombres de ficheros para detectar que ficheros son bibliotecas compartidas (*.so), binarios ejecutables, bibliotecas estáticas (lib*.a) y ficheros de depuración (lib*_g.a, debug/*.so), y elimina cuanto más sea posible. (Que no es del todo para depuración de bibliotecas). En general parece hacer muy buenas suposiciones, y hará lo correcto en la mayoría de casos.

source: Since it is very hard to automatically guess if a file is a module, and hard to determine how to strip a module, dh_strip does not currently deal with stripping binary modules such as .o files.
es: Puesto que es muy difícil adivinar automáticamente si un fichero es un módulo, y determinar como eliminar un módulo, dh_strip actualmente no trata de eliminar los símbolos de módulos binarios como los ficheros .o.

source: Exclude files that contain "item" anywhere in their filename from being stripped. You may use this option multiple times to build up a list of things to exclude.
es: Excluye ficheros que contienen "elemento" en cualquier lugar de su nombre de ser eliminados. Usted puede usar esta opción muchas veces para construir una lista de cosas a excluir.

source: B<--dbg-package=>I<package>
es: B<--dbg-package=>I<paquete>

source: Causes dh_strip to save debug symbols stripped from the packages it acts on as independent files in the package build directory of the specified debugging package.
es: Esta opción indica a dh_strip que el paquete dado tiene asociado un paquete "-dbg". Entonces, dh_strip, cuando ejecute strip para eliminar los símbolos de depuración de los ficheros del paquete, los guardará en ficheros independientes en el directorio de construcción para el paquete "-dbg".

source: Note that this option behaves significantly different in debhelper compatibility levels 4 and below. Instead of specifying the name of a debug package to put symbols in, it specifies a package (or packages) which should have separated debug symbols, and the separated symbols are placed in packages with "-dbg" added to their name.
es: Tenga en cuenta que esta opción se comporta de forma significativamentedistinta en los niveles de compatibilidad de debhelper 4 o inferiores. Enlugar de especificar el nombre de un paquete de depuración en el que ponerlos símbolos, especifica un paquete (o paquetes) que deben tener símbolosde depuración separados, y los símbolos separados son colocados en paquetescon "-dbg" al final de su nombre

source: Debug symbols will be retained, but split into an independent file in usr/lib/debug/ in the package build directory. --dbg-package is easier to use than this option, but this option is more flexible.
es: Se mantendrán los símbolos de depuración, pero separados en un fichero independiente en usr/lib/debug/ en el directorio de construcción del paquete. --dbg-package es más fácil de usar que esta opción, pero esta opción es más flexible.

source: Debian policy, version 3.0.1
es: Normas de Debian, versión 3.0.1

source: Do not run!
es: ¡No lo ejecute!

source: CONVERTING TO STATOVERRIDE
es: CONVERTIR A STATOVERRIDE

source: Converting a package that uses this program to use the new statoverride mechanism is easy. Just remove the call to dh_suidregister from debian/rules, and add a versioned conflicts into your control file, as follows:
es: El mecanismo para convertir un paquete que usa este programa para usar el nuevo statoverride es sencillo. Solamente elimine el llamado a dh_suidregister de debian/rules, y añada un conflicto de versión en su fichero control, como sigue:

source: The conflicts is only necessary if your package used to register things with suidmanager; if it did not, you can just remove the call to this program from your rules file.
es: El conflicto solamente es necesario si su paquete registraba cosas con suidmanager; en caso contrario, usted simplemente puede eliminar el llamado a este programa de su fichero rules.

source: dh_testdir - test directory before building debian package
es: dh_testdir - comprueba el directorio antes de construir el paquete debian

source: B<dh_testdir> [S<I<debhelper options>>] [S<I<file ...>>]
es: B<dh_testdir> [S<I<opciones debhelper>>] [S<I<fichero ...>>]

source: dh_testdir tries to make sure that you are in the correct directory when building a debian package. It makes sure that the file debian/control exists, as well as any other files you specify. If not, it exits with an error.
es: dh_testdir trata de asegurarse de que usted se encuentre en el directorio adecuando cuando construya un paquete debian. Éste se asegura de que el fichero debian/control exista, así como cualquier otro fichero que usted especifique. En caso contrario finaliza con un error.

source: Test for the existence of these files too.
es: Comprueba también la existencia de estos ficheros.

source: dh_testroot - ensure that a package is built as root
es: dh_testroot - asegura que el paquete sea construido como superusuario

source: B<dh_testroot> [S<I<debhelper options>>]
es: B<dh_testroot> [S<I<opciones debhelper>>]

source: dh_testroot simply checks to see if you are root. If not, it exits with an error. Debian packages must be built as root, though you can use L<fakeroot(1)>
es: dh_testroot simplemente verifica si usted es superusuario. Si no, finaliza con un error. Los paquetes Debian deben ser construidos como superusuario, aunque usted puede usar L<fakeroot(1)>
