Repository: elric/deb-l10n
Catalog: debhelper.po
Languages: es

source: It also automatically generates the postinst and postrm commands needed to interface with the debian menu package. These commands are inserted into the maintainer scripts by L<dh_installdeb(1)>.
es: Además, genera automáticamente las órdenes de «postinst» y «postrm» necesarias para interactuar con el paquete de menú de Debian. Estas órdenes se insertan en los scripts de desarrollador mediante L<dh_installdeb(1)>.

source: debian/I<package>.menu
es: debian/I<paquete>.menu

source: Debian menu files, installed into usr/share/menu/I<package> in the package build directory. See L<menufile(5)> for its format.
es: Los ficheros de menú de Debian se instalan en «usr/share/menu/I<paquete>» en el directorio de construcción del paquete. Consulte L<menufile(5)> para detalles acerca del formato.

source: debian/I<package>.menu-method
es: debian/I<paquete>.menu-method

source: Debian menu method files, installed into etc/menu-methods/I<package> in the package build directory.
es: Ficheros de método de menú de Debian, instalados en «etc/menu-methods/I<package>» en el directorio de construcción del paquete.

source: Do not modify postinst/postrm scripts.
es: No modifica los scripts postinst/postrm.

source: dh_installmime - install mime files into package build directories
es: dh_installmime - Instala ficheros mime en los directorios de construcción

source: B<dh_installmime> [S<I<debhelper options>>] [B<-n>]
es: B<dh_installmime> [S<I<opciones-de-debhelper>>] [B<-n>]

source: dh_installmime is a debhelper program that is responsible for installing mime files into package build directories.
es: dh_installmime es un programa de debhelper responsable de instalar ficheros mime en los directorios de construcción del paquete.

source: It also automatically generates the postinst and postrm commands needed to interface with the debian mime-support and shared-mime-info packages. These commands are inserted into the maintainer scripts by L<dh_installdeb(1)>.
es: Además, genera automáticamente las órdenes de «postinst» y «postrm» necesarias para interactuar con los paquetes de Debian mime-support y shared-mime-info. Estas órdenes se insertan en los scripts del desarrollador mediante L<dh_installdeb(1)>.

source: debian/I<package>.mime
es: debian/I<paquete>.mime

source: Installed into usr/lib/mime/packages/I<package> in the package build directory.
es: Instalado en «/lib/mime/packages/I<paquete>» en el directorio de construcción del paquete.

source: debian/I<package>.sharedmimeinfo
es: debian/I<paquete>.sharedmimeinfo

source: Installed into /usr/share/mime/packages/I<package>.xml in the package build directory.
es: Instalado en «/usr/share/mime/packages/I<package>.xml» en el directorio de construcción del paquete.

source: dh_installmodules - register modules with modutils
es: dh_installmodules - Registra módulos con modutils

source: B<dh_installmodules> [S<I<debhelper options>>] [B<-n>] [B<--name=>I<name>]
es: B<dh_installmodules> [S<I<opciones-de-debhelper>>] [B<-n>] [B<--name=>I<nombre>]

source: dh_installmodules is a debhelper program that is responsible for registering kernel modules.
es: dh_installmodules es un programa de debhelper responsable de registrar módulos del núcleo.

source: Kernel modules are searched for in the package build directory and if found, postinst and postrm commands are automatically generated to run depmod and register the modules when the package is installed. These commands are inserted into the maintainer scripts by L<dh_installdeb(1)>.
es: Los módulos del núcleo se buscan en el directorio de construcción del paquete, y si se encuentran, se generan órdenes «postinst» y «postrm» automáticamente para que ejecuten depmod, y registren los módulos al instalar el paquete. Estas órdenes se insertan en los scripts del desarrollador mediante L<dh_installdeb(1)>.

source: debian/I<package>.modprobe
es: debian/I<paquete>.modprobe

source: Installed to etc/modprobe.d/I<package>.conf in the package build directory.
es: Instalado en «etc/modprobe.d/I<paquete>.conf» en el directorio de construcción del paquete.

source: debian/I<package>.modules
es: debian/I<paquete>.modules

source: These files were installed for use by modutils, but are now not used and dh_installmodules will warn if these files are present.
es: Estos ficheros se instalaron para su uso mediante modutils, pero ya están en desuso, y dh_installmodules emitirá un aviso si estos ficheros están presentes.

source: When this parameter is used, dh_installmodules looks for and installs files named debian/I<package>.I<name>.modprobe instead of the usual debian/I<package>.modprobe
es: Cuando se usa este parámetro, dh_installmodules busca e instala ficheros llamados «debian/I<paquete>.I<nombre>.modprobe en vez del usual «debian/I<paquete>.modprobe».

source: dh_installpam - install pam support files
es: dh_installpam - instala ficheros de soporte para pam

source: B<dh_installpam> [S<I<debhelper options>>] [B<--name=>I<name>]
es: B<dh_installpam> [S<I<opciones debhelper>>] [B<-n>] [B<--name=>I<nombre>]

source: dh_installpam is a debhelper program that is responsible for installing files used by PAM into package build directories.
es: dh_installpam es un programa de debhelper responsable de instalar ficheros usados por PAM en los directorios de construcción del paquete.

source: debian/I<package>.pam
es: debian/I<paquete>.pam

source: Installed into etc/pam.d/I<package> in the package build directory.
es: Instalado en «etc/pam.d/I<paquete>» en el directorio de construcción del paquete.

source: Look for files named debian/I<package>.I<name>.pam and install them as etc/pam.d/I<name>, instead of using the usual files and installing them using the package name.
es: Busca ficheros con el nombre «debian/I<paquete>.I<nombre>.pam y los instala como «etc/pam.d/I<nombre>», en vez de usar los ficheros usuales e instalarlos con el nombre del paquete.

source: dh_installppp - install ppp ip-up and ip-down files
es: dh_installppp - Instala los ficheros ip-up e ip-down de ppp

source: B<dh_installppp> [S<I<debhelper options>>] [B<--name=>I<name>]
es: B<dh_installppp> [S<I<opciones-de-debhelper>>] [B<--name=>I<nombre>]

source: dh_installppp is a debhelper program that is responsible for installing ppp ip-up and ip-down scripts into package build directories.
es: dh_installppp es un programa de debhelper responsable de instalar los scripts «ip-up» e «ip-down» de ppp en los directorios de construcción del paquete.

source: debian/I<package>.ppp.ip-up
es: debian/I<paquete>.ppp.ip-up

source: Installed into etc/ppp/ip-up.d/I<package> in the package build directory.
es: Instalado en «etc/ppp/ip-up.d/I<paquete> en el directorio de construcción del paquete.

source: debian/I<package>.ppp.ip-down
es: debian/I<paquete>.ppp.ip-down

source: Installed into etc/ppp/ip-down.d/I<package> in the package build directory.
es: Instalado en «etc/ppp/ip-down.d/I<paquete> en el directorio de construcción del paquete.

source: Look for files named debian/package.name.ppp.ip-* and install them as etc/ppp/ip-*/name, instead of using the usual files and installing them as the package name.
es: Busca ficheros llamados «debian/paquete.nombre.ppp.ip-*» y los instala como «etc/ppp/ip-*/nombre», en vez de usar los ficheros usuales e instalarlos con el nombre del paquete.

source: debian/I<package>.udev
es: debian/I<paquete>.udev

source: B<--priority=>I<priority>
es: B<--priority=>I<prioridad>

source: dh_installwm - register a window manager
es: dh_installwm - Registra un gestor de ventanas

source: B<dh_installwm> [S<I<debhelper options>>] [B<-n>] [B<--priority=>I<n>] [S<I<wm ...>>]
es: B<dh_installwm> [S<I<opciones-de-debhelper>>] [B<-n>] [B<--priority=>I<n>] [S<I<gestor ...>>]

source: dh_installwm is a debhelper program that is responsible for generating the postinst and postrm commands that register a window manager with L<update-alternatives(8)>. The window manager's man page is also registered as a slave symlink (in v6 mode and up), if it is found in usr/share/man/man1/ in the package build directory.
es: dh_installwm es un programa de debhelper responsable de generar las órdenes de postinst y postrm que registran un gestor de ventanas con L<update-alternatives(8)> La página de manual del gestor de ventanas también se registra, como un enlace simbólico esclavo (en el modo v6 y superior), si se encuentra en «usr/share/man/man1/» en el directorio de construcción del paquete.

source: debian/I<package>.wm
es: debian/I<paquete>.wm

source: List window manager programs to register.
es: Lista los programas del gestor de ventanas a registrar.

source: Set the priority of the window manager. Default is 20, which is too low for most window managers; see the Debian Policy document for instructions on calculating the correct value.
es: Define la prioridad del gestor de ventanas. De forma predeterminada es 20, demasiado baja para la mayoría de gestores de ventanas; lea el documento Normas de Debian para instrucciones acerca de cómo calcular el valor correcto.

source: Do not modify postinst/postrm scripts. Turns this command into a no-op.
es: No modifica los scripts postinst/postrm. Si se especifica esta orden no hace nada.

source: I<wm ...>
es: I<gestor ...>

source: Window manager programs to register.
es: Programas del gestor de ventanas a registrar.

source: dh_installxfonts - register X fonts
es: dh_installxfonts - Registra tipos de letra para X

source: B<dh_installxfonts> [S<I<debhelper options>>]
es: B<dh_installxfonts> [S<I<opciones-de-debhelper>>]

source: dh_installxfonts is a debhelper program that is responsible for registering X fonts, so their corresponding fonts.dir, fonts.alias, and fonts.scale be rebuilt properly at install time.
es: dh_installxfonts es un programa de debhelper responsable de registrar tipos de letra para X, de forma que los correspondientes fonts.dir, fonts.alias, y fonts.scale sean reconstruidos adecuadamente durante la instalación.

source: Before calling this program, you should have installed any X fonts provided by your package into the appropriate location in the package build directory, and if you have fonts.alias or fonts.scale files, you should install them into the correct location under etc/X11/fonts in your package build directory.
es: Antes de invocar este programa, debe tener instalados los tipos de letra para X proporcionados por el paquete en el lugar apropiado del directorio de construcción, y si tiene un fichero fonts.alias o fonts.scale, debería instalarlos en el lugar correcto bajo «etc/X11/fonts» en el directorio de construcción del paquete.

source: Your package should depend on xfonts-utils so that the update-fonts-* commands are available. (This program adds that dependency to ${misc:Depends}.)
es: Su paquete debe depender de xfont-utils para que las órdenes update-fonts-* estén disponibles. (Este programa añade la dependencia a ${misc:Depends}.)

source: This program automatically generates the postinst and postrm commands needed to register X fonts. These commands are inserted into the maintainer scripts by dh_installdeb. See L<dh_installdeb(1)> for an explanation of how this works.
es: Este programa genera automáticamente las órdenes de postinst y postrm necesarias para registrar los tipos de letra para X. Estas órdenes se insertan en los scripts del desarrollador mediante dh_installdeb. Para una explicación de su funcionamiento consulte L<dh_installdeb(1)>.

source: See L<update-fonts-alias(8)>, L<update-fonts-scale(8)>, and L<update-fonts-dir(8)> for more information about X font installation.
es: Consulte L<update-fonts-alias(8)>, L<update-fonts-scale(8)>, y L<update-fonts-dir(8)> para más información acerca de la instalación de tipos de letra para X.

source: See Debian policy, section 11.8.5. for details about doing fonts the Debian way.
es: Consulte las Normas de Debian, sección 11.8.5. para detalles acerca de manejar los tipos de letra al estilo de Debian.

source: dh_link - create symlinks in package build directories
es: dh_link - crea enlace simbólicos en directorios de construcción de paquetes

source: B<dh_link> [S<I<debhelper options>>] [B<-A>] [B<-X>I<item>] [S<I<source destination ...>>]
es: B<dh_link> [S<I<opciones-de-debhelper>>] [B<-A>] [B<-X>I<elemento>] [S<I<origen destino ...>>]

source: dh_link is a debhelper program that creates symlinks in package build directories.
es: dh_link es un programa de debhelper que crea enlaces simbólicos en los directorios de construcción de paquetes.

source: dh_link accepts a list of pairs of source and destination files. The source files are the already existing files that will be symlinked from. The destination files are the symlinks that will be created. There B<must> be an equal number of source and destination files specified.
es: dh_link acepta una lista de pares de ficheros origen y destino. Los ficheros origen son ficheros ya existentes, los cuales serán enlazados. Los ficheros destino son los enlaces simbólicos que serán creados. B<Debe> especificar un número igual de ficheros origen y destino.

source: Be sure you B<do> specify the full filename to both the source and destination files (unlike you would do if you were using something like L<ln(1)>).
es: Compruebe que B<ha> definido el nombre completo del fichero en ambos ficheros, origen y destino (distinto a lo que haría si estuviese usando algo como L<ln(1)>).

source: dh_link will generate symlinks that comply with debian policy - absolute when policy says they should be absolute, and relative links with as short a path as possible. It will also create any subdirectories it needs to to put the symlinks in.
es: dh_link genera los enlaces simbólicos compatibles con las normas de Debian - absolutos cuando las normas dicen que deben serlo, y enlaces relativos con una ruta lo más corta posible. También creará cualquier directorio que sea necesario para ubicar los enlaces.

source: dh_link also scans the package build tree for existing symlinks which do not conform to debian policy, and corrects them (v4 or later).
es: dh_link también examina el árbol de construcción del paquete en busca de enlaces simbólicos existentes que no cumplen con las normas de Debian, y los corrige (v4 y posterior).

source: debian/I<package>.links
es: debian/I<paquete>.links

source: Lists pairs of source and destination files to be symlinked. Each pair should be put on its own line, with the source and destination separated by whitespace.
es: Lista parejas de ficheros de origen y destino a enlazar. Cada pareja debería aparecer en una única línea, con el origen y el destino separados por un espacio en blanco.

source: Create any links specified by command line parameters in ALL packages acted on, not just the first.
es: Crea cualquier enlace especificado por los parámetros de la linea de órdenes en TODOS los paquetes sobre los que se actúa, no solamente en el primero.

source: Do not correct symlinks that contain "item" anywhere in their filename from being corrected to comply with debian policy.
es: No corrige enlaces simbólicos, para que cumplan con las normas de Debian, que contienen «elemento» en cualquier parte de su nombre de ficheros.

source: I<source destination ...>
es: I<origen destino ...>

source: Create a file named "destination" as a link to a file named "source". Do this in the package build directory of the first package acted on. (Or in all packages if -A is specified.)
es: Crea un fichero llamado "destino" como un enlace a un fichero llamado "origen". Hace esto en el directorio de construcción de paquete del primer paquete sobre el que se actúa. (o en todos los paquetes si se especifica -A).

source: Make bar.1 be a symlink to foo.1
es: Hace de bar.1 un enlace simbólico a foo.1

source: Make /usr/lib/foo/ be a link to /var/lib/foo/, and bar.1 be a symlink to the foo.1
es: Hace de /usr/lib/foo/ un enlace a /var/lib/foo/, y de bar.1 un enlace simbólico a la página de manual foo.1x

source: B<dh_lintian> [S<I<debhelper options>>]
es: B<dh_lintian> [S<I<opciones-de-debhelper options>>]

source: debian/I<package>.lintian-overrides
es: debian/I<paquete>.lintian-overrides

source: These files are not installed, but will be scanned by lintian to provide overrides for the source package.
es: Estos ficheros no se instalan, pero lintian los analizará para ofrecer anulaciones («overrides») para el paquete fuente.

source: dh_listpackages - list binary packages debhelper will act on
es: dh_listpackages - Lista los paquetes binarios sobre los que actuará debhelper

source: B<dh_listpackages> [S<I<debhelper options>>]
es: B<dh_listpackages> [S<I<opciones-de-debhelper>>]

source: dh_listpackages is a debhelper program that outputs a list of all binary packages debhelper commands will act on. If you pass it some options, it will change the list to match the packages other debhelper commands would act on if passed the same options.
es: dh_listpackages es un programa de debhelper que retorna una lista de todos los paquetes binarios sobre los que actuarán las órdenes de debhelper. Si usted especifica algunas opciones, éste cambiará la lista para coincidir con los paquetes sobre los que otras órdenes de debhelper podrían actuar si se especifican las mismas opciones.

source: dh_makeshlibs - automatically create shlibs file and call dpkg-gensymbols
es: dh_makeshlibs - Crea automáticamente el fichero shlibs e invoca dpkg-gensymbols

source: B<dh_makeshlibs> [S<I<debhelper options>>] [B<-m>I<major>] [B<-V>I<[dependencies]>] [B<-n>] [B<-X>I<item>] [S<B<--> I<params>>]
es: B<dh_makeshlibs> [S<I<opciones-de-debhelper>>] [B<-m>I<mayor>] [B<-V>I<[dependencias]>] [B<-n>] [B<-X>I<elemento>] [S<B<--> I<parámetros>>]

source: dh_makeshlibs is a debhelper program that automatically scans for shared libraries, and generates a shlibs file for the libraries it finds.
es: dh_makeshlibs es un programa de debhelper que busca automáticamente bibliotecas compartidas, y genera un fichero «shlibs» para las bibliotecas que encuentra.

source: It also adds a call to ldconfig in the postinst and postrm scripts (in v3 mode and above only) to any packages in which it finds shared libraries.
es: También añade una invocación a ldconfig en los scripts postinst y postrm (sólo en el modo v3 y superiores) de cualquier paquete en el que encuentra bibliotecas compartidas.

source: debian/I<package>.symbols
es: debian/I<paquete>.symbols

source: debian/I<package>.symbols.I<arch>
es: debian/I<paquete>.symbols.I<arquitectura>

source: These symbols files, if present, are passed to L<dpkg-gensymbols(1)> to be processed and installed. Use the I<arch> specific names if you need to provide different symbols files for different architectures.
es: De existir, estos ficheros de símbolos se introducen a L<dpkg-gensymbols(1)> para su procesado e instalación. Use el nombre específico de la I<arquitectura> si desea proporcionar diferentes ficheros de símbolos para diferentes arquitecturas.

source: B<-m>I<major>, B<--major=>I<major>
es: B<-m>I<mayor>, B<--major=>I<mayor>

source: Instead of trying to guess the major number of the library with objdump, use the major number specified after the -m parameter. This is much less useful than it used to be, back in the bad old days when this program looked at library filenames rather than using objdump.
es: En lugar de intentar adivinar el número mayor de la biblioteca usando objdump, usa el número mayor especificado después del parámetro -m. Esto es mucho menos útil de lo que era antiguamente cuando este programa buscaba los nombres de fichero de las bibliotecas en lugar de usar objdump.

source: B<-V>, B<-V>I<dependencies>
es: B<-V>, B<-V>I<dependencias>

source: B<--version-info>, B<--version-info=>I<dependencies>
es: B<--version-info>, B<--version-info=>I<dependencias>

source: By default, the shlibs file generated by this program does not make packages depend on any particular version of the package containing the shared library. It may be necessary for you to add some version dependancy information to the shlibs file. If -V is specified with no dependency information, the current upstream version of the package is plugged into a dependency that looks like "packagename (>= packageversion)". Note that in debhelper compatibility levels before v4, the debian part of the package version number is also included. If -V is specified with parameters, the parameters can be used to specify the exact dependency information needed (be sure to include the package name).
es: Por omisión, el fichero shlibs generado por este programa no hace que los paquetes dependan de alguna versión particular del paquete que contiene la biblioteca compartida. Podría ser necesario para usted el añadir alguna información de dependencia de versión al fichero shlibs. Si se especifica «-V» sin información de dependencia, la versión actual de desarrollador principal del paquete es conectada en una dependencia de la forma «nombre_de_paquete (>= versión_de_paquete)». Tenga en cuenta que en los niveles de compatibilidad de debhelper anteriores a v4, también se incluye la parte debian del número de versión del paquete. Si se especifica «-V» con parámetros, los parámetros pueden ser usados para especificar la información de dependencia exacta requerida (asegúrese de incluir el nombre del paquete).

source: Beware of using -V without any parameters; this is a conservative setting that always ensures that other packages' shared library dependencies are at least as tight as they need to be (unless your library is prone to changing ABI without updating the upstream version number), so that if the maintainer screws up then they won't break. The flip side is that packages might end up with dependencies that are too tight and so find it harder to be upgraded.
es: Tenga cuidado al usar «-V» sin ningún parámetro; ésta es una configuración conservadora que siempre se asegura que las dependencias de bibliotecas compartidas de otros paquetes son al menos lo más pequeñas que necesitan ser (a menos que su biblioteca sea propensa a cambiar el ABI sin actualizar el número de versión del desarrollador principal), de modo que si el desarrollador las malogra éstas no se romperán. Por otro lado los paquetes podrían terminar con dependencias muy rigurosas que harían difícil su actualización.

source: Exclude files that contain "item" anywhere in their filename or directory from being treated as shared libraries.
es: Excluye ficheros que contienen "elemento" en cualquier lugar de su nombre o directorio de ser tratados como bibliotecas compartidas.

source: Create an additional line for udebs in the shlibs file and use "udeb" as the package name for udebs to depend on instead of the regular library package.
es: Crea una línea adicional para paquetes udeb en el fichero «shlibs», y usa «udeb» como el nombre del paquete sobre el que dependen paquetes udeb, en lugar del paquete de biblioteca habitual.

source: Pass "params" to L<dpkg-gensymbols(1)>.
es: Introduce parámetros a L<dpkg-gensymbols(1)>.

source: Assuming this is a package named libfoobar1, generates a shlibs file that looks something like: libfoobar 1 libfoobar1
es: Asumiendo que este es un paquete llamado libfoobar1, genera un fichero shlibs que se ve como: libfoobar 1 libfoobar1

source: Assuming the current version of the package is 1.1-3, generates a shlibs file that looks something like: libfoobar 1 libfoobar1 (>= 1.1)
es: Asumiendo que la versión actual del paquete es 1.1-3, genera un fichero shlibs que se ve como: libfoobar 1 libfoobar1 (>= 1.1)

source: Generates a shlibs file that looks something like: libfoobar 1 libfoobar1 (>= 1.0)
es: Genera un fichero shlibs que se ve como: libfoobar 1 libfoobar1 (>= 1.0)

source: dh_md5sums - generate DEBIAN/md5sums file
es: dh_md5sums - genera el fichero DEBIAN/md5sums
