Repository: elric/deb-l10n
Catalog: debhelper.po
Languages: es

source: LIMITATIONS
es: LIMITACIONES

source: dh_install cannot rename files or directories, it can only install them with the names they already have into wherever you want in the package build tree.
es: dh_install no puede renombrar ficheros o directorios, sólo puede instalarlos con los nombres que ya tengan en cualquier lugar en el árbol de construcción del paquete.

source: dh_installcatalogs - install and register SGML Catalogs
es: dh_installcatalogs - Instala y registra catálogos SGML

source: B<dh_installcatalogs> [S<I<debhelper options>>] [B<-n>]
es: B<dh_installcatalogs> [S<I<opciones-de-debhelper>>] [B<-n>]

source: dh_installcatalogs is a debhelper program that installs and registers SGML catalogs. It complies with the Debian XML/SGML policy.
es: dh_installcatalogs es un programa de debhelper que instala y registra catálogos SGML. El programa respeta las normas de Debian referentes a XML/SGML.

source: Catalogs will be registered in a supercatalog, in F</etc/sgml/I<package>.cat>.
es: Los catálogos se registrarán en un catálogo principal, en F</etc/sgml/I<paquete>.cat>.

source: This command automatically adds maintainer script snippets for registering and unregistering the catalogs and supercatalogs (unless B<-n> is used). These snippets are inserted into the maintainer scripts by dh_installdeb; see L<dh_installdeb(1)> for an explanation of Debhelper maintainer script snippets.
es: Esta orden añade automáticamente la parte necesaria a los scripts del desarrollador para registrar y borrar del registro los catálogos y los catálogos principales (a menos que se use B<-n>). Estas porciones se insertan en los scripts de desarollador mediante dh_installdeb; consulte L<dh_installdeb(1)> para una explicación acerca de la porción de código que se añade a los scripts del desarrollador.

source: A dependency on B<sgml-base> will be added to C<${misc:Depends}>, so be sure your package uses that variable in F<debian/control>.
es: Se añadirá una dependencia sobre B<sgml-base> a C<${misc:Depends}>, asegúrese que su paquete usar tal variable en F<debian/control>.

source: debian/I<package>.sgmlcatalogs
es: debian/I<paquete>.sgmlcatalogs

source: Lists the catalogs to be installed per package. Each line in that file should be of the form C<source dest>, where C<source> indicates where the catalog resides in the source tree, and C<dest> indicates the destination location for the catalog under the package build area. C<dest> should start with F</usr/share/sgml/>.
es: Lista los catálogos a instalar por cada paquete. Cada línea en ese fichero debe ser de la forma C<origen destino>, donde C<origen> indica dónde reside el catálogo dentro del árbol de las fuentes, y C<destino> indica el lugar del catálogo dentro del área de construcción del paquete. C<destino> debe empezar por F</usr/share/sgml/>.

source: Do not modify F<postinst>/F<postrm>/F<prerm> scripts.
es: No modifica los scripts F<postinst>/F<postrm>/F<prerm>.

source: Note that this command is not idempotent. L<dh_prep(1)> should be called between invocations of this command. Otherwise, it may cause multiple instances of the same text to be added to maintainer scripts.
es: Esta orden no es idempotente. Debería invocar L<dh_prep(1)> entre las invocaciones de esta orden. De otro modo, puede causar que los scripts del desarollador contengan partes duplicadas.

source: dh_installchangelogs - install changelogs into package build directories
es: dh_installchangelogs - instala los ficheros de cambios en los directorios de construcción

source: B<dh_installchangelogs> [S<I<debhelper options>>] [B<-k>] [B<-X>I<item>] [I<upstream>]
es: B<dh_installchangelogs> [S<I<opciones-de-debhelper>>] [B<-k>] [B<-X>I<elemento>] [I<fuente-original-de-software>]

source: dh_installchangelogs is a debhelper program that is responsible for installing changelogs into package build directories.
es: dh_installchangelogs es un programa de debhelper responsable de la instalación de los ficheros de registro de cambios en los directorios de construcción del paquete.

source: An upstream changelog file may be specified as an option. If none is specified, it looks for files with names that seem likely to be changelogs. (In compatibility level 7 and above.)
es: Puede definir un fichero de registro de la fuente de software original de forma opcional. Si no se define, busca ficheros con nombres que indican la posibilidad de que sean ficheros de cambios (a partir del nivel 7 de compatibilidad y superior).

source: If there is an upstream changelog file, it will be be installed as usr/share/doc/package/changelog in the package build directory. If the changelog is a html file (determined by file extension), it will be installed as usr/share/doc/package/changelog.html instead, and will be converted to plain text with html2text to generate usr/share/doc/package/changelog.
es: Si existe, el fichero de cambios del desarrollador principal se instalará en «usr/share/doc/paquete/changelog» en el directorio de construcción del paquete. Si el fichero de cambios es un fichero html (determinado por la extensión), se instalará en «usr/share/doc/package/changelog.html», y será convertido a texto simple usando html2text para generar «usr/share/doc/paquete/changelog».

source: debian/I<package>.changelog
es: debian/I<paquete>.changelog

source: debian/I<package>.NEWS
es: debian/I<paquete>.NEWS

source: Automatically installed into usr/share/doc/I<package>/ in the package build directory.
es: Automáticamanete instalado en «usr/share/doc/I<package>/» en el directorio de construcción del paquete.

source: Use the package specific name if I<package> needs a different NEWS or changelog file.
es: Use el nombre específico del paquete si el I<paquete> necesita un fichero de registro de cambios o NEWS diferente.

source: The changelog file is installed with a name of changelog for native packages, and changelog.Debian for non-native packages. The NEWS file is always installed with a name of NEWS.Debian.
es: El fichero de cambios se instala con el nombre changelog para los paquetes nativos, y changelog.Debian para paquetes no nativos. El fichero NEWS siempre se instala con el nombre NEWS.Debian.

source: Keep the original name of the upstream changelog. This will be accomplished by installing the upstream changelog as "changelog", and making a symlink from that to the original name of the changelog file. This can be useful if the upstream changelog has an unusual name, or if other documentation in the package refers to the changelog file.
es: Conserva el nombre original del fichero de cambios del desarrollador principal. Esto se realiza instalando el fichero de cambios del desarrollador principal como «changelog», y haciendo un enlace simbólico de éste al nombre original del fichero. Puede ser útil si el fichero de cambios del desarrollador principal tiene un nombre poco usual, o si alguna otra documentación en el paquete hace referencia al fichero de cambios.

source: Exclude upstream changelog files that contain "item" anywhere in their filename from being installed.
es: No se instalarán los ficheros de registro de cambios del desarrollador principal que contengan «elemento» en alguna parte de su nombre.

source: Install this file as the upstream changelog.
es: Instala este fichero como el fichero de cambios del desarrollador principal.

source: dh_installcron - install cron scripts into etc/cron.*
es: dh_installcron - instala scripts para cron en etc/cron.*

source: B<dh_installcron> [S<B<debhelper options>>] [B<--name=>I<name>]
es: B<dh_installcron> [S<B<opciones-de-debhelper>>] [B<--name=>I<nombre>]

source: dh_installcron is a debhelper program that is responsible for installing cron scripts.
es: dh_installcron es un programa de debhelper responsable de instalar scripts para cron.

source: debian/I<package>.cron.daily
es: debian/I<paquete>.cron.daily

source: debian/I<package>.cron.weekly
es: debian/I<paquete>.cron.weekly

source: debian/I<package>.cron.monthly
es: debian/I<paquete>.cron.monthly

source: debian/I<package>.cron.hourly
es: debian/I<paquete>.cron.hourly

source: debian/I<package>.cron.d
es: debian/I<paquete>.cron.d

source: Installed into the appropriate etc/cron.*/ directory in the package build directory.
es: Instalado en el directorio «etc/cron.*/» en el directorio de construcción del paquete.

source: B<--name=>I<name>
es: B<--name=>I<nombre>

source: Look for files named debian/package.name.cron.* and install them as etc/cron.*/name, instead of using the usual files and installing them as the package name.
es: Busca ficheros con el nombre «debian/paquete.nombre.cron.*» y los instala como «etc/cron.*/nombre», en vez de usar los ficheros usuales e instalarlos con el nombre del paquete.

source: dh_installdeb - install files into the DEBIAN directory
es: dh_installdeb - Instala ficheros en el directorio DEBIAN

source: B<dh_installdeb> [S<I<debhelper options>>]
es: B<dh_installdeb> [S<I<opciones-de-debhelper>>]

source: dh_installdeb is a debhelper program that is responsible for installing files into the DEBIAN directories in package build directories with the correct permissions.
es: dh_installdeb es un programa de debhelper responsable de instalar ficheros en el directorio DEBIAN con los permisos correctos en los directorios de construcción del paquete.

source: I<package>.postinst
es: I<paquete>.postinst

source: I<package>.preinst
es: I<paquete>.preinst

source: I<package>.postrm
es: I<paquete>.postrm

source: I<package>.prerm
es: I<paquete>.prerm

source: These maintainer scripts are installed into the DEBIAN directory.
es: Estos scripts de de encargado de paquete se instalan en el directorio «DEBIAN».

source: Inside the scripts, the token B<#DEBHELPER#> is replaced with shell script snippets generated by other debhelper commands.
es: Dentro de los scrips, el comodín B<#DEBHELPER#> es reemplazado con fragmentos de scripts de consola generados por otras órdenes de debhelper.

source: I<package>.triggers
es: I<paquete>.triggers

source: I<package>.shlibs
es: I<paquete>.shlibs

source: These control files are installed into the DEBIAN directory.
es: Estos ficheros de control se instalan en el directorio «DEBIAN».

source: I<package>.conffiles
es: I<paquete>.conffiles

source: This control file will be installed into the DEBIAN directory.
es: Este fichero de control se instalará en el directorio «DEBIAN».

source: In v3 compatibility mode and higher, all files in the etc/ directory in a package will automatically be flagged as conffiles by this program, so there is no need to list them manually here.
es: En el modo de compatibilidad V3 o superior, todos los ficheros en el directorio «etc/» del paquete se marcarán automáticamente como conffiles por este programa, así que no hay necesidad de listarlos aquí manualmente.

source: dh_installdebconf - install files used by debconf in package build directories
es: dh_installdebconf - Instala ficheros usados por debconf en los directorios de construcción

source: B<dh_installdebconf> [S<I<debhelper options>>] [B<-n>] [S<B<--> I<params>>]
es: B<dh_installdebconf> [S<I<opciones-de-debhelper>>] [B<-n>] [S<B<--> I<parámetros>>]

source: dh_installdebconf is a debhelper program that is responsible for installing files used by debconf into package build directories.
es: dh_installdebconf es un programa de debhelper responsable de instalar los ficheros usados por debconf en los directorios de construcción del paquete.

source: It also automatically generates the postrm commands needed to interface with debconf. The commands are added to the maintainer scripts by dh_installdeb. See L<dh_installdeb(1)> for an explanation of how that works.
es: Además, genera automáticamente las órdenes de postrm necesarias para interaccionar con debconf. Las órdenes se añaden a los scripts de desarrollador mediante dh_installdeb. Consulte L<dh_installdeb(1)> para una explicación acerca de su funcionamiento.

source: Note that if you use debconf, your package probably needs to depend on it (it will be added to ${misc:Depends} by this program).
es: Dese cuenta de que si usa debconf, probablemente su paquete dependa de él (será añadido a ${misc:Depends} por este programa).

source: Note that for your config script to be called by dpkg, your postinst needs to source debconf's confmodule. dh_installdebconf does not install this statement into the postinst automatically as it it too hard to do it right.
es: Tenga en cuenta que para que dpkg invoque su script de configuración, su postinst necesita cargar el fichero «confmodule» de debconf. dh_installdebconf no introduce esta orden automáticamente en el script de postinst porque es demasiado difícil hacerlo bien.

source: debian/I<package>.config
es: debian/I<paquete>.config

source: This is the debconf config script, and is installed into the DEBIAN directory in the package build directory.
es: Este es el script de configuración de debconf, que se instala en el directorio «DEBIAN» en el directorio de construcción del paquete.

source: Inside the script, the token B<#DEBHELPER#> is replaced with shell script snippets generated by other debhelper commands.
es: Dentro del script, el comodín B<#DEBHELPER#> es reemplazado con fragmentos de scripts de consola generados por otras órdenes de debhelper.

source: debian/I<package>.templates
es: debian/I<paquete>.templates

source: This is the debconf templates file, and is installed into the DEBIAN directory in the package build directory.
es: Este es el fichero de plantillas de debconf, que se instala en el directorio «DEBIAN» en el directorio de construcción del paquete.

source: If this directory is present, this program will automatically use L<po2debconf(1)> to generate merged templates files that include the translations from there.
es: Si este directorio está presente, el programa usara automáticamente L<po2debconf(1)> para generar ficheros de fusión de plantillas que incluyen las traducciones ahí contenidas.

source: For this to work, your package should build-depend on po-debconf.
es: Su paquete debe tener una dependencia de construcción sobre po-debconf para que esto funcione.

source: Do not modify postrm script.
es: No modifica el script postrm.

source: Pass the params to po2debconf.
es: Introduce parámetros a po2debconf.

source: dh_installdirs - create subdirectories in package build directories
es: dh_installdirs - Crea subdirectorios en directorios de construcción de paquete

source: B<dh_installdirs> [S<I<debhelper options>>] [B<-A>] [S<I<dir ...>>]
es: B<dh_installdirs> [S<I<opciones-de-debhelper>>] [B<-A>] [S<I<directorio ...>>]

source: dh_installdirs is a debhelper program that is responsible for creating subdirectories in package build directories.
es: dh_installdirs es un programa de debhelper responsable de crear subdirectorios en los directorios de construcción del paquete.

source: debian/I<package>.dirs
es: debian/I<paquete>.dirs

source: Lists directories to be created in I<package>.
es: Lista los directorios a crear en I<package>.

source: Create any directories specified by command line parameters in ALL packages acted on, not just the first.
es: Crea cualquier directorio especificado mediante los parámetros de la línea de órdenes en TODOS los paquetes sobre los que actúe, no sólo en el primero.

source: I<dir ...>
es: I<directorio ...>

source: Create these directories in the package build directory of the first package acted on. (Or in all packages if -A is specified.)
es: Crea estos directorios en el directorio de construcción del primer paquete sobre el que se actúe. (O en todos los paquetes si se especifica «-A»).

source: dh_installdocs - install documentation into package build directories
es: dh_installdocs - Instala documentación en los directorios de construcción de paquete

source: B<dh_installdocs> [S<I<debhelper options>>] [B<-A>] [B<-X>I<item>] [S<I<file ...>>]
es: B<dh_installdocs> [S<I<opciones-de-debhelper>>] [B<-A>] [B<-X>I<elemento>] [S<I<fichero ...>>]

source: dh_installdocs is a debhelper program that is responsible for installing documentation into usr/share/doc/package in package build directories.
es: dh_installdocs es un programa de debhelper responsable de instalar documentación en |usr/share/doc/paquete» en los directorios de construcción del paquete.

source: debian/I<package>.docs
es: debian/I<paquete>.docs

source: List documentation files to be installed into I<package>.
es: Lista los ficheros de documentación a instalar en el I<package>.

source: Each of these files is automatically installed if present. Use the package specific name if I<package> needs a different version of the file.
es: Se instalará automáticamente cada uno de estos ficheros si están presentes. Use el nombre específico del paquete si el I<package> necesita una versión diferente del fichero.

source: Note that debian/README.debian is also installed as README.Debian, and debian/TODO will be installed as TODO.Debian in non-native packages.
es: Tenga en cuenta que «debian/README.debian» también se instala como «README.Debian», y que «debian/TODO» se instalará como «TODO.Debian» en paquetes no nativos.

source: debian/I<package>.doc-base
es: debian/I<paquete>.doc-base

source: Installed as doc-base control files. Note that the doc-id will be determined from the "Document:" entry in the doc-base control file in question.
es: Instalado como ficheros de control de doc-base. Tenga en cuenta que el identificador del documento, doc-id, se determinará de la entrada «Document:» en el fichero de control de doc-base en cuestión.

source: debian/I<package>.doc-base.*
es: debian/I<paquete>.doc-base.*

source: If your package needs to register more than one document, you need multiple doc-base files, and can name them like this.
es: Si su paquete necesita registrar más de un documento, necesita múltiples ficheros doc-base, y puede nombrarlos de la siguiente manera.

source: Install all files specified by command line parameters in ALL packages acted on.
es: Instala todos los ficheros especificados en los parámetros de la línea de órdenes en TODOS los paquetes sobre los que actúe.

source: B<--link-doc=>I<package>
es: B<--link-doc=>I<paquete>

source: Make the documentation directory of all packages acted on be a symlink to the documentation directory of I<package>. This has no effect when acting on I<package> itself, or if the documentation directory to be created already exists when B<dh_installdocs> is run. To comply with policy, I<package> must be a binary package that comes from the same source package.
es: Hace que el directorio de documentación de todos los paquetes sobre los que se actúa sea un enlace simbólico al directorio de documentación del I<paquete>. No tiene efecto cuando se actúa sobre el mismo I<paquete>, o si el directorio de documentación a crear ya existe al ejecutar B<dh_installdocs>. Para cumplir las normas, el I<<paquete> debe ser un paquete binario que se origina del mismo paquete de fuentes.

source: debhelper will try to avoid installing files into linked documentation directories that would cause conflicts with the linked package. The B<-A> option will have no effect on packages with linked documentation directories, and copyright, changelog, README.Debian, and TODO files will not be installed.
es: debhelper intentará evitar instalar ficheros en directorios de documentación enlazados que podrían causar un conflicto con el paquete enlazado. La opción B<-A> no tendrá efecto sobre los paquetes con directorios de documentación enlazados, y no se instalarán los ficheros «copyright», «changelog», «README.Debian» y «TODO».

source: (An older method to accomplish the same thing, which is still supported, is to make the documentation directory of a package be a dangling symlink, before calling dh_installdocs.)
es: (Otro método, aún permitido, es hacer del directorio de documentación un enlace simbólico colgante, «dangling», antes de invocar dh_installdocs.)

source: Install these files as documentation into the first package acted on. (Or in all packages if B<-A> is specified).
es: Instala esos ficheros como documentación en el primer paquete sobre el que actúe. (O en todos si se especifica B<-A>).

source: This is an example of a debian/package.docs file:
es: A continuación se muestra un ejemplo de un fichero debian/paquete.docs:

source: Note that dh_installdocs will happily copy entire directory hierarchies if you ask it to (similar to cp -a). If it is asked to install a directory, it will install the complete contents of the directory.
es: Tenga en cuenta que dh_installdocs copiará sin problemas jerarquías de directorio enteras si se le pide (similar a «cp -a»). Si le pide instalar un directorio instalará todos los contenidos de éste.

source: dh_installemacsen - register an emacs add on package
es: dh_installemacsen - Registra un paquete añadido para emacs

source: B<dh_installemacsen> [S<I<debhelper options>>] [B<-n>] [B<--priority=>I<n>] [B<--flavor=>I<foo>]
es: B<dh_installemacsen> [S<I<opciones-de-debhelper>>] [B<-n>] [B<--priority=>I<n>] [B<--flavor=>I<foo>]

source: dh_installemacsen is a debhelper program that is responsible for installing files used by the debian emacsen-common package into package build directories.
es: dh_installemacsen es un programa de debhelper responsable de instalar ficheros usados por el paquete de Debian emacsen-common en los directorios de construcción del paquete.

source: It also automatically generates the postinst and prerm commands needed to register a package as an emacs add on package. The commands are added to the maintainer scripts by dh_installdeb. See L<dh_installdeb(1)> for an explanation of how this works.
es: Además, genera automáticamente las órdenes de «postinst» y «prerm» necesarios para registrar el paquete como una extensión para emacs. Las órdenes se añaden a los scripts de desarollador mediante dh_installdeb. Consulte L<dh_installdeb(1)> para una explicación acerca de su funcionamiento.

source: debian/I<package>.emacsen-install
es: debian/I<paquete>.emacsen-install

source: Installed into usr/lib/emacsen-common/packages/install/package in the package build directory.
es: Instalado en «usr/lib/emacsen-common/packages/install/paquete» en el directorio de construcción del paquete.

source: debian/I<package>.emacsen-remove
es: debian/I<paquete>.emacsen-remove

source: Installed into usr/lib/emacsen-common/packages/remove/package in the package build directory.
es: Instalado en «usr/lib/emacsen-common/packages/remove/paquete» en el directorio de construcción del paquete.

source: debian/I<package>.emacsen-startup
es: debian/I<paquete>.emacsen-startup

source: Installed into etc/emacs/site-start.d/50I<package>.el in the package build directory. Use --priority to use a different priority than 50.
es: Instalado en «etc/emacs/site-start.d/50I<paquete>.el» en el directorio de construcción del paquete. Use «--priority» para definir una prioridad distinta de 50.

source: Do not modify postinst/prerm scripts.
es: No modifica los scripts postinst/prerm.

source: Sets the priority number of a site-start.d file. Default is 50.
es: Define el número de prioridad de un fichero site-start.d. 50 es el número predeterminado.

source: Sets the flavor a site-start.d file will be installed in. Default is "emacs", alternatives include "xemacs" and "emacs20".
es: Define el sabor para el cual se instalará el fichero site-start.d. Por omisión es «emacs», las alternativas son «xemacs» y «emacs20».

source: dh_installexamples - install example files into package build directories
es: dh_installexamples - Instala ficheros de ejemplo en los directorios de construcción

source: B<dh_installexamples> [S<I<debhelper options>>] [B<-A>] [B<-X>I<item>] [S<I<file ...>>]
es: B<dh_installexamples> [S<I<opciones-de-debhelper>>] [B<-A>] [B<-X>I<elemento>] [S<I<fichero ...>>]
