Repository: elric/deb-l10n
Catalog: isoquery.po
Languages: es

source: Usage: %prog [options] [ISO codes]
es: Uso: %prog [opciones] [códigos ISO]

source: STANDARD
es: ESTÁNDAR

source: The ISO standard to use. Possible values: 639, 639-3, 3166, 3166-2, 4217, 15924. Default value: %default
es: El estándar ISO a utilizar. Valores posibles: 639, 639-3, 3166, 3166-2, 4217, 15924. Valor predeterminado: %default

source: FILE
es: FICHERO

source: Use specified XML file with ISO data. Default value: %default
es: Usa el fichero XML especificado con datos de la ISO. Valor predeterminado: %default

source: Use this locale for output
es: Usa esta configuración regional («locale») para la salida

source: Display the name for the supplied codes (default)
es: Muestra el nombre de los códigos proporcionados (predeterminado)

source: Display the official name for the supplied codes. This may be the same as --name. (Only applies to ISO 3166)
es: Muestra el nombre oficial de los códigos proporcionados. Esto puede ser lo mismo que «--name». (Sólo se aplica a la ISO 3166)

source: Display the common name for the supplied codes. This may be the same as --name. (Only applies to ISO 3166)
es: Muestra el nombre común de los códigos proporcionados. Esto puede ser lo mismo que «--name». (Sólo se aplica a la ISO 3166)

source: Separate entries with a NULL character instead of newline
es: Separa las entradas con un carácter vacío («NULL») en lugar de un salto de línea.

source: Show this information
es: Muestra esta información

source: Show program version and copyright
es: Muestra la versión del programa y los derechos de autor

source: isoquery: ISO standard '%(standard)s' is not supported.
es: isoquery: No se acepta el estándar ISO «%(standard)s».

source: isoquery: The locale '%(locale)s' is not available for ISO %(standard)s.
es: isoquery: La locale «%(locale)s» no está disponible para la ISO %(standard)s.

source: Translation to LANGUAGE Copyright ?? YEAR YOUR-NAME
es: Traducción al español. Derechos de autor ?? 2010 Omar Campagne

source: isoquery: The file '%(filename)s' could not be opened.
es: isoquery: No se pudo abrir el fichero «%(filename)s».

source: isoquery: The file '%(filename)s' could not be parsed correctly.
es: isoquery: El fichero «%(filename)s» no se pudo analizar adecuadamente.

source: isoquery: The file '%(filename)s' does not contain valid ISO %(standard)s data.
es: isoquery: El fichero «%(filename)s» no contiene datos ISO %(standard)s válidos.

source: isoquery: The code '%(code)s' is not defined in ISO %(standard)s.
es: isoquery: El código «%(code)s» no está definido en la ISO %(standard)s.
