Repository: elric/deb-l10n
Catalog: po4a-pod-*.po
Languages: es

source: The C<po4a-normalize> script is a debugging tool used to make sure that po4a don't change the document when it's not supposed to. Only use it if you're developing a new module, or if you doubt the sanity of the tools.
es: El script C<po4a-normalize> es una herramienta de depurado usada para comprobar que po4a no cambia el documento cuando no debe. Sólo debe usarlo si está desarrollando un módulo nuevo, o si duda de la corrección de las herramientas.

source: The generated document will be written to po4a-normalize.output while the generated po file will be written to po4a-normalize.po. No way to change that ;)
es: El documento generado se escribirá en «po4a-normalize.output» mientras que el fichero po generado se escribirá en «po4a-normalize.po». No hay forma de cambiarlo ;)

source: Create an blank translated document. The generated translated document will be generated assuming all messages are translated by a space or new line.
es: Crear un documento traducido en blanco. El documento traducido generado se procesará como si la traducción de todos los mensajes en un espacio o una línea nueva.

source: This is useful to check what parts of the document cannot be translated.
es: Esto es de utilidad para revisar qué partes del documento no se pueden traducir.

source: po4a-translate - convert a po file back to documentation format
es: po4a-translate - Conversión de un fichero po al formato de documentación.

source: po4a-translate -f E<lt>fmtE<gt> -m E<lt>master.docE<gt> -p E<lt>XX.poE<gt> -l E<lt>XX.docE<gt>
es: po4a-translate -f E<lt>formatoE<gt> -m E<lt>principal.docE<gt> -p E<lt>XX.poE<gt> -l E<lt>XX.docE<gt>

source: (XX.doc is the output, all others are inputs)
es: (XX.doc es la salida, todos los otros son entrada)

source: The C<po4a-translate> script is in charge of converting the translation (which was done in a po file) under the documentation format back. The provided C<po> file should be the translation of the C<pot> file which were produced by po4a-gettextize(1).
es: El script C<po4a-translate> se encarga de convertir la traducción (que se hizo en un fichero po) de vuelta al formato de documentación. El fichero C<po> proporcionado debe ser la traducción del fichero C<pot> que se produjo con po4a-gettextize(1).

source: Add a file to the resulting file (to put translator's name or a section "About this translation", for example). The first line of the file to insert should be a PO4A header indicating where it should be added (see section I<HOWTO add extra text to translations> in po4a(7)).
es: Añadir un fichero al fichero resultante (para poner el nombre del traductor o una sección «Acerca de esta traducción», por ejemplo). La primera línea del fichero a insertar debe ser la cabecera PO4A indicando dónde se debe insertar (ver sección I<Cómo añadir cosas que no son traducciones> en po4a(7)).

source: File containing the master document to translate.
es: El fichero que contiene el documento principal a traducir.

source: File where the localized (translated) document should be written.
es: El fichero donde se debe escribir el documento localizado (traducido).

source: File from which the message catalog should be read.
es: El fichero del que se debe leer el catálogo de mensajes.

source: Column at which we should wrap the resulting file.
es: La columna en la que se debe justificar el fichero resultante.

source: Adding content (beside translations) to generated files
es: Añadir contenido (aparte de las traducciones) a los ficheros generados

source: To add some extra content to the generated document beside what you translated (like the name of the translator, or a "about this translation" section), you should use the C<--addendum> option.
es: Para añadir algún contenido adicional al documento generado además de lo traducido (como el nombre del traductor, o una sección «Sobre ésta traducción»), debe usar la opción C<--addendum>.

source: The first line of the addendum must be a header indicating where to put it in the document (it can be before or after a given part of the document). The rest of the file will be added verbatim to the resulting file without further processing.
es: La primera línea de un apéndice debe ser una cabecera indicando en qué parte del documento se debe insertar (puede ser antes o después de una parte del documento). El resto del fichero se insertará tal cual al fichero resultante sin ningún procesamiento.

source: Note that if po4a-translate fails to add one of the given files, it discards the whole translation (because the missing file could be the one indicating the author, what would prevent the users to contact him to report bugs in the translation).
es: Tenga en cuenta que si po4a-translate no puede añadir uno de los ficheros dados, descarta la traducción entera (porque el fichero que falta puede ser el que contenía los datos del autor, lo que impediría a los usuarios contactar con él para informarle de errores en la traducción).

source: The header has a pretty rigid syntax. For more information on how to use this feature and how it works, please refer to the po4a(7) man page.
es: La cabecera tiene una sintaxis bastante rígida. Para más información sobre cómo usar esta característica y su funcionamiento, véase la página de manual de po4a(7).

source: po4a-updatepo - update the translation (in po format) of documentation
es: po4a-updatepo - Actualizar la traducción (en formato po) de la documentación.

source: po4a-updatepo -f E<lt>fmtE<gt> (-m E<lt>master.docE<gt>)+ (-p E<lt>XX.poE<gt>)+
es: po4a-updatepo -f E<lt>formatoE<gt> (-m E<lt>principal.docE<gt>)+ (-p E<lt>XX.poE<gt>)+

source: (XX.po are the outputs, all others are inputs)
es: (XX.po son la salida, todos los otros son entrada)

source: The C<po4a-updatepo> script is in charge of updating po files to make them reflect the changes made to the original documentation file. For that, it converts the documentation file to a pot file, and call L<msgmerge(1)> on this new pot and on the provided po files.
es: El script C<po4a-updatepo> se encarga de la actualización de los ficheros po para que reflejen los cambios realizados en los ficheros de documentación originales. Para eso, convierte el fichero de documentación a un fichero pot, e invoca L<msgmerge(1)> sobre este nuevo pot y los ficheros po proporcionados.

source: It is possible to give more than one po file (if you want to update several languages at once), and several documentation files (if you want to store the translations of several documents in the same po file).
es: Es posible proporcionar más de un fichero po (si quiere actualizar varios idiomas a la vez), y varios ficheros de documentación (si quiere guardar la traducción de varios documentos en el mismo ficheros po).

source: If the master document has non-ascii characters, it will convert the po files to utf-8 (if they weren't already), in order to allow non-standard characters in a culture independent way.
es: Si el documento original contiene caracteres no-ascii, convertirá los ficheros po a utf-8 (si no lo usaban ya), para permitir caracteres no estándar de una forma independiente de la cultura.

source: COMMAND-LINE OPTIONS
es: OPCIONES EN LÍNEA DE ÓRDENES

source: File(s) containing the master document to translate.
es: Los fichero(s) que contienen el documento principal a traducir.

source: Charset of the files containing the document to translate. Note that all files must have the same charset.
es: El juego de caracteres de los ficheros que contienen el documento a traducir. Todos los ficheros deben tener el mismo juego de caracteres.

source: Po file(s) to update. If these files do not exist, they are created by C<po4a-updatepo>.
es: Fichero(s) po a actualizar. Si no existen los ficheros se generan mediante C<po4a-updatepo>.

source: Extra option(s) to pass to the format plugin and other po4a internal module. Specify each option in the 'name=value' format. See the documentation of each plugin for more information about the valid options and their meanings.
es: Opciones adicionales que introducir a la extensión del formato y otro módulo interno de po4a. Especifique cada opción en el formato 'nombre=valor'. Véase la documentación de cada extensión para más información acerca de las opciones válidas y sus significados.

source: List the documentation format handled by po4a.
es: Listar los formatos de documentación que po4a puede tratar.

source: Copyright 2002, 2003, 2004, 2005 by SPI, inc.
es: Copyright 2002, 2003, 2004, 2005 por SPI, inc.

source: msguntypot - update po files when a typo is fixed in pot file
es: msguntypot - Actualizar ficheros po cuando se corrige un error tipográfico en el fichero po.

source: msguntypot -o E<lt>old_potE<gt> -n E<lt>new_potE<gt> pofiles...
es: msguntypot -o E<lt>pot_antiguoE<gt> -n E<lt>pot_nuevoE<gt> ficheros_po...

source: When you fix a trivial error which surely doesn't affect translations (e.g. a typo) in a .pot file, you should unfuzzy the corresponding msgstr in the translated .po files to avoid so extra work to the translators.
es: Cuando arregle un error trivial que con seguridad no afecta a las traducciones (p. ej., un error tipográfico) en un fichero .pot, debería quitar la condición de cadena borrosa (unfuzzy) al correspondiente msgstr en los ficheros po para así evitar trabajo adicional a los traductores.

source: This task is difficult and error prone when done manually, and this tool is there to help doing so correctly. You just need to provide the two versions of the pot file: before the edition and after as marked in the above synopsis, and it all becomes automatic.
es: Esta tarea es difícil y proclive a fallos si se hace manualmente, y esta herramienta existe para ayudarle a que lo haga correctamente. Solo necesita proporcionar las dos versiones del fichero pot: antes de la edición y después, como se refleja en el anterior resumen, y el proceso pasa a ser automático.

source: HOW TO USE IT
es: MODO DE EMPLEO

source: In short, when you discover a typo in one of your [english] message, do the following:
es: Resumiendo, cuando descubre un error tipográfico en uno de sus mensajes (en inglés), haga lo siguiente:

source: - Regenerate your pot and po files.
es: - Regenerar sus ficheros po y pot.

source: make -C po/ update-po # for message program translations debconf-updatepo # for debconf translations po4a po4a.conf # for po4a based documentation translations
es: make -C po/ update-po # para traducciones de mensajes de programa debconf-updatepo # para traducciones de debconf po4a po4a.conf # para traducciones de documentación basados en po4a

source: or something else, depending on your project's building settings. You know how to make sure your pot an po files are uptodate, don't you??
es: u otra cosa, dependiendo de la configuración de compilación de su proyecto. Ya sabe como asegurarse de que sus ficheros po y pot están al día, ¿no?

source: - Make a copy of your pot file.
es: - Hacer una copia de su fichero pot.

source: cp myfile.pot myfile.pot.orig
es: cp mi_fichero.pot mi_fichero.pot.orig

source: - Make a copy of all your files.
es: - Hacer una copia de todos sus ficheros.

source: mkdir po_fridge; cp *.po po_fridge
es: mkdir po_baúl; cp *.po po_baúl

source: - Fix your typo
es: - Arreglar el error tipográfico.

source: $EDITOR the_file_in_which_there_is_a_typo
es: $EDITOR el_fichero_en_el_que_hay_un_error

source: See above.
es: Véase arriba.

source: At this point, the typo fix fuzzied all the translations, and this unfortunate change is the only one between the po files of your main directory and the one from the fridge. Here is how to solve this.
es: En este punto, el error corregido ha convertido en borrosas traducciones presentes en todos los ficheros po, y este desafortunado cambio es el único entre los ficheros po de su directorio principal y aquellos en el baúl. Aquí tiene la solución.

source: - Discard fuzzy translation, restore the ones from the fridge.
es: - Descartar las traducciones borrosas, restaurando aquellas en el baúl.

source: cp po_fridge/*.po .
es: cp po_baúl/*.po .

source: - Manually merge the po files with the new pot file, but taking the useless fuzzy into account
es: - Fusionar manualmente los ficheros po con el nuevo fichero pot, pero teniendo en cuenta la cadena borrosa inútil.

source: msguntypot -o myfile.pot.orig -n myfile.pot *.po
es: msguntypot -o mi_fichero.pot.orig -n mi_fichero.pot *.po

source: - Cleanups.
es: - Limpiar-

source: rm -rf myfile.pot.orig po_fridge
es: rm -rf mi_fichero.pot.orig po_baúl

source: You're done. The typo was eradicated from msgstr of both your pot and po files, and the po files were not fuzzyied in the process. Your translators love you already.
es: Y ya está. El error se eliminó de los msgstr de los de los ficheros pot y po, y los ficheros po no añadieron cadenas borrosas en el proceso. Sus traductores ya le aman.

source: Despite its name, this tool is not part of the gettext tool suite. It is instead part of po4a. More precisely, it's a random perl script using the fine po4a modules. For more information about po4a, please see:
es: A pesar de su nombre, esta herramienta no forma parte del conjunto de herramientas de gettext. En lugar de ello, forma parte de po4a. Más exactamente, es un script aleatorio de perl que usa los módulos de po4a. Para más información acerca de po4a, véase:

source: Copyright 2005 by SPI, inc.
es: Copyright 2005 por SPI, inc.

source: po4a-build.conf - configuration file for building translated content
es: po4a-build.conf - Fichero de configuración para construir contenido traducido.

source: Introduction
es: Introducción

source: F<po4a-build.conf> describes how C<po4a-build> should build translated and untranslated documentation from a set of untranslated source documents and corresponding PO files.
es: F<po4a-build.conf> describe cómo C<po4a-build> debe construir la documentación original y traducida a partir de un conjunto de documentos originales y sus correspondientes ficheros po.

source: All supported formats, in all supported combinations, can be handled in a single F<po4a-build.conf> configuration file and in a single call to C<po4a-build>. However, you can also choose to separate the F<po/> directories and have one configuration file for each run. (Call C<po4a-build -f FILE> for each one.)
es: Puede gestionar todo con un solo fichero de configuración F<po4a-build.conf> y una sola invocación a C<po4a-build>. Por otro lado, también puede escoger separar los directorios F<po/> y usar un fichero de configuración cada vez. (Invoque C<po4a-build -f fichero> para cada uno de ellos.)

source: (See also KEEP below for some limitations of combining lots of files into one POT file and one C<po4a-build> run.
es: (Consulte KEEP, más adelante, para ver las limitaciones al combinar varios ficheros pot en una sola invocación a C<po4a-build>.

source: Note that although F<po4a-build> includes support for adding gettext support for translation of script output messages, F<po4a-build.conf> itself has no bearing on such translations. F<po4a-build.conf> only relates to translating static content like manpages.
es: Observe que a pesar de que F<po4a-build> posibilita añadir la compatibilidad gettext con la traducción de los mensajes de salida de scripts, F<po4a-build.conf> no tiene constancia de tales traducciones. F<po4a-build.conf> sólo se remite a traducir contenido estático como páginas de manual.

source: For F<po4a-build> support of runtime message translation, see F<po4a-runtime (7)>.
es: Consulte F<po4a-runtime (7)> para ver la compatibilidad de F<po4a-runtime (7)> con mensajes en tiempo de ejecución.

source: Currently, C<po4a-build> supports the following combinations:
es: A día de hoy, C<po4a-build> es compatible con las siguientes combinaciones:

source: Docbook XML for Sections 1 and 3
es: DocBook XML en las secciones 1 y 3.

source: Typically used for manpages for shell scripts or other interpreters that do not have their own documentation format like POD. Suitable XML can be generated directly from an existing manpage using C<doclifter> and C<po4a-build> will then generate a POT file with no extra workload. The POT file can then be offered for translation and the PO files added to the relevant F<po/> directory. C<po4a-build> will then prepare not only the untranslated manpage from the C<doclifter> XML but also use C<po4a> to prepare translated XML from the PO files and then build translated manpages from the XML.
es: Generalmente usado por las páginas de manual, scripts de consola u otros intérpretes que no tienen un formato de documentación como POD. Puede generar XML a partir de una página de manual existente con C<doclifter>, tras lo cual C<po4a-build> generará un fichero POT sin más carga en el proceso. El fichero POT puede así ofrecerse para su traducción, y añadir los ficheros PO al directorio F<po/> apropiado. Llegado a este punto, C<po4a-build> no solo preparará la página de manual original a partir del fichero XML y C<doclifter>, sino que también usará C<po4a> para preparar el XML traducido a partir de los ficheros PO, y generando al final las páginas de manual construidas a partir del XML.

source: Manpages are generated using default support in docbook-xsl - the stylesheet used can be overridden using the C<XSLFILE> setting in the C<po4a-build> configuration file.
es: Las páginas de manual se generan con la compatibilidad predeterminada en docbook-xsl. Puede invalidar la hoja de estilo usando el elemento de configuración C<XSLFILE> en el fichero de configuracion C<po4a-build>.

source: DocBook XML for HTML
es: DocBook XML para HTML

source: The stylesheet used to prepare the final HTML can be left as the default (or overridden using the C<HTMLXSL> setting in the C<po4a-build> configuration file.
es: Puede usar la hoja de estilo usada para preparar el HTML final de manera predeterminada (o lo puede invalidar con el elemento de configuración <HTMLXSL> en el fichero de configuración C<po4a-build>).

source: POD for Sections 1, 3, 5 and 7.
es: POD para las secciones 1, 3, 5 y 7.

source: pod2man is used to convert POD content for each of the supported sections.
es: pod2man sirve para la conversión de contenido pod para cada una de las secciones compatibles.

source: Use C<PODFILE> for section 1, C<PODMODULES> for section 3, C<POD5FILES> for section 5 and C<POD7FILES> for section 7.
es: Use C<PODFILE> para la sección 1, C<PODMODULES> para la sección 3, C<POD5FILES> para la sección 5 y C<POD7FILES> para la sección 7.

source: For content in sections 5 or 7, (which tends to need a filename which is also used for section 1 content), if the filename includes the 5 or 7 as part of the filename, this (and any filename extension) will be automatically stripped.
es: Si un nombre de fichero incluye el 5 o el 7, con contenido para las secciones 5 o 7 (que generalmente necesita un nombre de fichero usado también para el contenido en la sección 1), perderá el número en su nombre (y cualquier extensión de nombre de fichero).

source: e.g. to prepare F</usr/share/man/man7/po4a.7.gz> :
es: Por ejemplo, para preparar F</usr/share/man/man7/po4a.7.gz>:

source: # POD files for section 7 POD7FILES="doc/po4a.7.pod"
es: # Ficheros POD para la sección 7 POD7FILES="doc/po4a.7.pod"

source: File contents
es: Contenido del fichero

source: Configuration values can appear in any order in the configuration file.
es: Los valores de configuración pueden tener cualquier orden dentro del fichero de configuración.

source: Any content after a '#' is ignored.
es: El contenido después de un «#» se ignorará.

source: Any value that would always be empty can be dropped from the file.
es: Puede descartar del fichero cualquier valor que siempre vaya a dejar vacío.

source: Some configuration fields are required - F<po4a-build> could end up with nothing to do if required fields are empty.
es: Se precisan algunos campos de configuración, ya que F<po4a-build> podría acabar sin nada que hacer debido a campos vacíos.

source: CONFIG
es: CONFIGURACIÓN

source: Required.
es: Obligatorio.

source: # name and location of the config file CONFIG="_build/po4a.config"
es: # Nombre y ubicación del fichero de configuración. CONFIG="_build/po4a.config"

source: Name and location of the (temporary) C<po4a> configuration file that C<po4a-build> will generate and maintain. This file does not need to live in your version control system and can be safely cleaned up during the package build.
es: Nombre y ubicación del fichero de configuración (temporal) de C<po4a> que C<po4a-build> generará y mantendrá. Este fichero no necesita estar en su sistema de control de versiones y puede eliminarlo sin problema durante la construcción del paquete.

source: # PODIR po directory for manpages/docs PODIR="po/pod"
es: # PODIR directorio po para páginas de manual/documentación PODIR="po/pod"

source: The directory containing the PO files for ALL translations handled by this configuration file. All strings will be merged into a POT file in this directory and all PO files merged with that POT file. Any KEEP threshold (see below) will be applied across all strings from all input files specified in this file and all PO files in this directory. The directory does not need to be called 'po'.
es: El directorio que contiene todos los ficheros po para TODAS las traducciones incluidas en este fichero de configuración. Todas los cadenas se fusionarán en un fichero pot dentro de este directorio, y todos los ficheros po serán fusionados con ese fichero pot. Cualquier umbral de KEEP (véase más adelante), se aplicará a todas las cadenas de todos los ficheros de entrada especificados en este fichero y a todos los ficheros po contenidos en este directorio. El directorio no precisa llamarse «/po».

source: POTFILE
es: POTFILE (fichero pot)

source: Path to the POTFILE (relative to the location of this configuration file) that will be generated, maintained and updated by C<po4a-build> for these translations.
es: La ruta al POTFILE (relativa a la ubicación de este fichero de configuración) que se generará, mantendrá y actualizará para estas traducciones mediante C<po4a-build>.

source: # POTFILE path POTFILE="po/pod/po4a-pod.pot"
es: # Ruta al POTFILE. POTFILE="po/pod/po4a-pod.pot"

source: Base directory for writing out the translated content.
es: El directorio base en el que escribir el contenido traducido.

source: # base directory for generated files, e.g. doc BASEDIR="_build"
es: # Directorio base para los ficheros generados, p. ej., doc. BASEDIR="_build"

source: BINARIES
es: BINARIES (Binarios)

source: Even if only one package is built, at least one value is required here.
es: Debe introducir un valor aunque solo se construya un paquete.

source: The string itself is arbitrary but typically consists of the package name. Generated content will then appear in sub-directories of F<BASEDIR/BINARIES>:
es: La cadena en si misma es arbitraria, pero consiste generalmente de un nombre de paquete. El contenido generado aparecerá en los sub-directorios de F<BASEDIR/BINARIES>:

source: If the package builds more than one binary package (i.e. one source package and multiple .deb or .rpm files), this field can help isolate content intended for each target, making it easier to automate the build process.
es: Si el paquete se construye con más de un paquete binario (p. ej., un paquete de fuentes y varios ficheros .deb o .rpm), puede emplear este campo para aislar el contenido para cada paquete, facilitando así automatizar el proceso de construcción.

source: Separate strings with a space.
es: Separe las cadenas con un espacio.

source: # the binary packages that will contain generated manpages BINARIES="po4a"
es: # Los paquetes binarios que contendrán las páginas de manual generadas. BINARIES="po4a"
