Repository: elric/deb-l10n
Catalog: po4a-pod-*.po
Languages: es

source: This module can be used directly to handle generic TeX documents. This will split your document in smaller blocks (paragraphs, verbatim blocks, or even smaller like titles or indexes).
es: Este módulo se puede usar directamente para tratar documentos TeX genéricos. Esto dividirá el documento en bloques más pequeños (párrafos, bloques literales, o incluso más pequeños, como títulos o índices).

source: There are some options (described in the next section) that can customize this behavior. If this doesn't fit to your document format you're encouraged to write your own module derived from this, to describe your format's details. See the section "Writing derivate modules" below, for the process description.
es: Hay algunas opciones (descritas en la siguiente sección) que pueden personalizar este comportamiento. Si eso no es suficiente para su formato de documento, le animo a que escriba su propio módulo derivado de éste para describir los detalles de su formato. Consulte la sección «Escribir módulos derivados» que encontrará más abajo, para una descripción del proceso.

source: This module can also be customized by lines starting with "% po4a:" in the TeX file. These customizations are described in the B<INLINE CUSTOMIZATION> section.
es: Este módulo se puede personalizar con lineas que empiecen con «% po4a:» en el fichero TeX. Esta personalización se describe en la sección B<PERSONALIZACIÓN DE OBJETOS EN LÍNEA>.

source: Coma-separated list of environments which should not be re-wrapped.
es: Lista separada por comas de los entornos que no se deben justificar.

source: Note that there is a difference between verbatim and no_wrap environments. There is no command and comments analysis in verbatim blocks.
es: Tenga en cuenta que los entornos literales (verbatim) y no_wrap son diferentes. En los bloques literales no se analizan las órdenes ni los comentarios.

source: If this environment was not already registered, po4a will consider that this environment does not take any parameters.
es: Si este entorno no se registró ya, po4a considerará que este entorno no acepta ningún argumento.

source: Colon-separated list of files that should not be included by \input and \include.
es: Lista separada por dos puntos de los ficheros que no se deben incluir mediante «\input» e «\include».

source: The name of a file containing definitions for po4a, as defined in the B<INLINE CUSTOMIZATION> section. You can use this option if it is not possible to put the definitions in the document being translated.
es: El nombre de un fichero que contiene definiciones para po4a, tal y como se define en la sección B<PERSONALIZACIÓN DE OBJETOS EN LÍNEA>. Puede usar esta opción si no es posible introducir definiciones en el documento que está traduciendo.

source: Coma-separated list of environments which should be taken as verbatim.
es: Lista separada por comas de los entornos que no se deben justificar.

source: Using these options permits to override the behaviour of the commands defined in the default lists.
es: Utilizar estas opciones puede modificar el comportamiento de las órdenes definidas en las listas predeterminadas.

source: INLINE CUSTOMIZATION
es: PERSONALIZACIÓN DE OBJETOS EN LÍNEA

source: The TeX module can be customized with lines starting by "% po4a:". These lines are interpreted as commands to the parser. The following commands are recognized:
es: El módulo TeX se puede personalizar mediante lineas que empiecen con «% po4a:». Estas lineas se interpretan como órdenes para el analizador. Se reconocen las siguientes órdenes:

source: % po4a: command I<command1> alias I<command2>
es: % po4a: orden I<orden1> alias I<orden2>

source: Indicates that the arguments of the I<command1> command should be treated as the arguments of the I<command2> command.
es: Indica que los argumentos de la orden I<orden1> se deben tratar como los argumentos de la orden I<orden2>.

source: % po4a: command I<command1> I<parameters>
es: % po4a: orden I<orden1> I<parámetros>

source: This permit to describe in detail the parameters of the I<command1> command. This information will be used to check the number of arguments and their types.
es: Esto permite describir en detalle los parámetros de la orden I<orden1>. Esta información se usará para revisar el número de argumentos y su tipo.

source: You can precede the I<command1> command by
es: Puede preceder la orden I<command1> con

source: an asterisk (*)
es: un asterisco (*)

source: po4a will extract this command from paragraphs (if it is located at the beginning or the end of a paragraph). The translators will then have to translate the parameters that are marked as translatable.
es: po4a extraerá esta orden de los párrafos (si está ubicada al principio o final de un párrafo). Los traductores tendrán que traducir los argumentos marcados como traducibles.

source: a plus (+)
es: un signo de suma (+)

source: As for an asterisk, the command will be extracted if it appear at an extremity of a block, but the parameters won't be translated separately. The translator will have to translate the command concatenated to all its parameters. This permits to keep more context, and is useful for commands with small words in parameter, which can have multiple meanings (and translations).
es: En cuanto al asterisco, la orden se extraerá en caso de aparecer en el extremo de un bloque, pero los argumentos no se traducirán separadamente. El traductor tendrá que traducir la orden unida a todos sus argumentos. Esto permite mantener un contexto más completo, y es útil con aquellas órdenes con pequeñas palabras en sus argumentos, los cuales pueden tener varios significados (y traducciones).

source: Note: In this case you don't have to specify which parameters are translatable, but po4a must know the type and number of parameters.
es: Nota: En este caso, no necesita especificar que argumentos son traducibles, pero po4a debe conocer el tipo y número de argumentos.

source: a minus (-)
es: un signo de resta (-)

source: In this case, the command won't be extracted from any block. But if it appear alone on a bloc, then only the parameters marked as translatable will be presented to the translator. This is useful for font command. These commands should generally not be separated from their paragraph (to keep the context), but there is no reason to annoy the translator with them if a whole string is enclosed in such a command.
es: En este caso, no se extraerá la orden de ningún bloque. Pero si aparece solo en un bloque, sólo los argumentos marcados como traducibles se entregarán al traductor. Esto es de utilidad para las órdenes de tipo de letra. Por lo general, estas órdenes no se deberían separar de su párrafo, (para mantener el contexto), pero no hay ninguna razón para molestar al traductor con ellas de aparecer una cadena completa dentro de una orden dada.

source: The I<parameters> argument is a set of [] (to indicate an optional argument) or {} (to indicate a mandatory argument). You can place an underscore (_) between these brackets to indicate that the parameter must be translated. For example: % po4a: command *chapter [_]{_}
es: El argumento I<parameters> es un conjunto de [] (para indicar un argumento opcional) o {} (para indicar un argumento obligatorio). Puede colocar un subrayado (_) entre estos corchetes para indicar que el parámetro se debe traducir. Por ejemplo: % po4a: orden *chapter [_] {_}

source: This indicates that the chapter command has two parameters: an optional (short title) and a mandatory one, which must both be translated. If you want to specify that the href command has two mandatory parameters, that you don't want to translate the URL (first parameter), and that you don't want this command to be separated from its paragraph (which allow the translator to move the link in the sentence), you can use: % po4a: command -href {}{_}
es: Esto indica que la orden «chapter» tiene dos parámetros: uno opcional (título corto) y uno obligatorio, los cuales se deben traducir. Si desea especificar que la orden «href» tiene dos parámetros obligatorios, que no quiere traducir la dirección URL (primer parámetro), y que no quiere que se separe esta orden de su párrafo (lo cual permite al traductor desplazar el enlace en la oración), puede usar: % po4a: command -href {}{_}

source: In this case, the information indicating which arguments must be translated is only used if a paragraph is only composed of this href command.
es: En este caso, la información que indica qué argumentos se deben traducir sólo se emplea si un párrafo está enteramente compuesto de la orden «href».

source: This permits to define the parameters accepted by the I<env> environment. This information is latter used to check the number of arguments of the \begin command, and permit to specify which one must be translated. The syntax of the I<parameters> argument is the same as described for the commands. The first parameter of the \begin command is the name of the environment. This parameter must not be specified in the list of parameters. Here are some examples: % po4a: environment multicols {} % po4a: environment equation
es: Esto permite difinir los parámetros aceptados por el entorno I<env>. Esta información se emplea más adelante para revisar el número de argumentos de la orden «\begin», y permite especificar cual se debe traducir. La sintaxis del argumento I<parameters> es la misma descrita para las órdenes. El primer párametro de la orden «\begin» es el nombre del entorno. No debe especificar este parámetro en la lista de parámetros. A continuación tiene unos ejemplos: % po4a: environment multicols {} % po4a: environment equation

source: As for the commands, I<env> can be preceded by a plus (+) to indicate that the \begin command must be translated with all its arguments.
es: La igual que con las órdenes, puede preceder I<env> con un signo de suma (+) para indicar que la orden «\begin» se debe traducir con todos sus argumentos.

source: Indicates that an environment should be split according to the given regular expression.
es: Indicar que un entorno se debería dividir de acuerdo a la expresión regular dada.

source: The regular expression is delimited by quotes. It should not create any backreference. You should use (?:) if you need a group. It may also need some escapes.
es: La expresión regular está delimitada por comillas. No debería crear ninguna referencia de apoyo. Debería usar (?:) si necesita un grupo. Puede precisar también algunos escapes.

source: For example, the LaTeX module uses the "(?:&|\\\\)" regular expression to translate separately each cell of a table (lines are separated by '\\' and cells by '&').
es: Por ejemplo, el módulo LaTeX usa la expresión regular "(?:&|\\\\)" para traducir cada celula de la tabla por separado (las líneas separan con '\\' y las celulas con '&').

source: The notion of environment is expended to the type displayed in the PO file. This can be used to split on "\\\\" in the first mandatory argument of the title command. In this case, the environment is title{#1}.
es: La noción de entorno depende del tipo mostrado en el fichero PO. Puede usar esto para dividirse con "\\\\" en el primer argumento obligatorio del nombre de la orden. En este caso, el entorno es «title{#1}».

source: % po4a: verbatim environment I<env>
es: % po4a: entorno literal I<env>

source: Indicate that I<env> is a verbatim environment. Comments and commands will be ignored in this environment.
es: Indica que I<env> es un entorno literal. Los comentarios y órdenes se ignoran en este entorno.

source: WRITING DERIVATE MODULES
es: ESCRIBIR MODULOS DERIVADOS

source: Wrapper around Transtractor's translate, with pre- and post-processing filters.
es: Un «wrapper» (envoltorio) el translate del Transtractor, con filtros de pre- y post-procesado.

source: Comments of a paragraph are inserted as a PO comment for the first translated string of this paragraph.
es: Los comentarios de un párrafo se insertan como comentarios del PO en la primera cadena traducida del párrafo.

source: This function returns:
es: Esta función devuelve:

source: A command name
es: El nombre de la orden

source: If no command is found at the beginning of the given buffer, this string will be empty. Only commands that can be separated are considered. The %separated_command hash contains the list of these commands.
es: Si no se encuentra ninguna orden al principio de la memoria intermedia dada, esta cadena estará vacía. Sólo se consideran las órdenes que se pueden separar. La serie asociativa «$separated_commands¢» contiene la lista separada por espacios de estas órdenes.

source: A variant
es: Una variante

source: This indicate if a variant is used. For example, an asterisk (*) can be added at the end of sections command to specify that they should not be numbered. In this case, this field will contain "*". If there is no variant, the field is an empty string.
es: Indica si se utiliza una variante. Por ejemplo, se puede añadir un asterisco (*) al final de la orden de secciones para especificar que no se deben enumerar. En ese caso, este campo contendría "*". Si no hay ninguna variante, el campo contiene una cadena vacía.

source: An array of tuples (type of argument, argument)
es: Una arreglo de tuplas (tipo de argumento, argumento)

source: The type of argument can be either '{' (for mandatory arguments) or '[' (for optional arguments).
es: El tipo de argumento puede ser «{» (para argumentos obligatorios) o «[» (para argumentos opcionales).

source: The remaining buffer
es: El resto de la memoria intermedia

source: The rest of the buffer after the removal of this leading command and its arguments. If no command is found, the original buffer is not touched and returned in this field.
es: El resto de la memoria intermedia después de la eliminación de la orden inicial y sus parámetros. Si no se encuentra ninguna orden, se devuelve a este campo la memoria intermedia original intacta.

source: The same as get_leading_command, but for commands at the end of a buffer.
es: Lo mismo que get_leading_command, pero para las órdenes al final de la memoria intermedia.

source: Recursively translate a buffer by separating leading and trailing commands (those which should be translated separately) from the buffer.
es: Traducir recursivamente una memoria intermedia separando de la misma la orden inicial y la final (los que se deben traducir por separado).

source: If a function is defined in %translate_buffer_env for the current environment, this function will be used to translate the buffer instead of translate_buffer().
es: Si una función se define en «%translate_buffer_env» para el entorno actual, esta función se usará para traducir la memoria intermedia en lugar de «translate_buffer()».

source: Overload Transtractor's read
es: Sobrecarga la lectura («read») del Transtractor

source: Recursively read a file, appending included files which are not listed in the @exclude_include array. Included files are searched using the B<kpsewhich> command from the Kpathsea library.
es: Lee un fichero recursivamente, añadiendo los ficheros incluidos que no están listados en la lista «@exclude_include». Los ficheros incluidos se buscan con la orden B<kpsewhich> de la biblioteca Kpathsea.

source: Except from the file inclusion part, it is a cut and paste from Transtractor's read.
es: Exceptuando la parte de inclusión de ficheros, es una copia del «read» de Transtractor.

source: Subroutine for parsing a file with po4a directive (definitions for newcommands).
es: Subrutina para analizar un fichero con directivas po4a (definiciones de órdenes nuevas).

source: Parse a definition line of the form "% po4a: ".
es: Analizar una linea de definición con la forma «% po4a: ».

source: See the INLINE CUSTOMIZATION section for more details.
es: Véase la sección PERSONALIZACIÓN DE OBJETOS EN LÍNEA para más detalles.

source: INTERNAL FUNCTIONS used to write derivated parsers
es: FUNCIONES INTERNAS utilizadas para escribir analizadores derivados

source: Command and environment functions take the following arguments (in addition to the $self object):
es: Las funciones de orden y entorno toman los siguientes argumentos (además del objeto $self):

source: An array of (type, argument) tuples
es: Una serie de tuplas (tipo, argumento)

source: The current environment
es: El entorno actual

source: The first 3 arguments are extracted by get_leading_command or get_trailing_command.
es: Los primeros 3 parámetros se extraen con «get_leading_command» o «get_trailing_command».

source: Command and environment functions return the translation of the command with its arguments and a new environment.
es: Las funciones de orden y de entorno devuelven la traducción de la orden con sus argumentos y un nuevo entorno.

source: Environment functions are called when a \begin command is found. They are called with the \begin command and its arguments.
es: Las funciones de entorno se invocan cuando se encuentra una orden «\begin». Se invocan con la orden «\begin» y sus argumentos.

source: The TeX module only proposes one command function and one environment function: generic_command and generic_environment.
es: El módulo TeX sólo propone una orden de función y una orden de entorno: «generic_command» y «generic_environment».

source: generic_command uses the information specified by register_generic_command or by adding definition to the TeX file: % po4a: command I<command1> I<parameters>
es: «generic_command» usa la información especificada por «register_generic_command», o añadiendo una definición para el fichero TeX: % po4a: orden I<orden1> I<argumentos>

source: generic_environment uses the information specified by register_generic_environment or by adding definition to the TeX file: % po4a: environment I<env> I<parameters>
es: «generic_environment» usa la información especificada por «register_generic_environment» o añadiendo una definición al fichero de TeX: % po4a: environment I<entorno> I<argumentos>

source: Both functions will only translate the parameters that were specified as translatable (with a '_'). generic_environment will append the name of the environment to the environment stack and generic_command will append the name of the command followed by an identifier of the parameter (like {#7} or [#2]).
es: Ambas funciones sólo traducen los parámetros especificados como traducibles (con una '_'). «generic_environment» afijará el nombre del entorno a la pila del entorno, y «generic_command» afijará el nombre de la orden seguida por un identificador del parámetro (como {#7} o [#2]).

source: This module needs more tests.
es: Este módulo necesita más pruebas.

source: It was tested on a book and with the Python documentation.
es: Se ha probado con un libro y con la documentación de Python.

source: TODO LIST
es: LISTA DE TAREAS PENDIENTES

source: Automatic detection of new commands
es: Detección automática de órdenes nuevas

source: The TeX module could parse the newcommand arguments and try to guess the number of arguments, their type and whether or not they should be translated.
es: El módulo TeX podría analizar los argumentos de la orden nueva e intentar determinar el número de argumentos, su tipo y si se deberían traducir.

source: Tranlation of the environment separator
es: Traducción del separador de entorno

source: When \item is used as an environment separator, the item argument is attached to the following string.
es: Cuando usa «\item» como un separador de entorno, el elemento argumento se añade a la siguiente cadena.

source: Some commands should be added to the environment stack
es: Algunas órdenes se deberían añadir a la pila de entorno

source: These commands should be specified by couples. This could allow to specify commands beginning or ending a verbatim environment.
es: Estas órdenes se deberían especificar por parejas. Esto permitiría especificar órdenes que inician o finalizan un entorno literal.

source: Others
es: Otros

source: Various other points are tagged TODO in the source.
es: Hay varios puntos etiquetados TODO en el código.

source: KNOWN BUGS
es: FALLOS CONOCIDOS

source: Various points are tagged FIXME in the source.
es: Hay varios puntos etiquetados con FIXME en el código.

source: Locale::Po4a::Text - Convert text documents from/to PO files
es: Locale::Po4a::Text - Conversión de documentos de texto desde/a ficheros PO.

source: Locale::Po4a::Text is a module to help the translation of text documents into other [human] languages.
es: Locale::Po4a::Text es un módulo que asiste en la traducción de documentación en formato de texto a otros lenguajes (humanos).

source: Paragraphs are split on empty lines (or lines containing only spaces or tabulations).
es: La división de los párrafos aparece las en líneas vacías (o líneas que sólo contienen espacios o tabulaciones).

source: If a paragraph contains a line starting by a space (or tabulation), this paragraph won't be rewrapped.
es: Si un párrafo contiene una línea que empieza con un espacio (o tabulación), este párrafo no se justificará.

source: Deactivate detection of bullets.
es: Desactivar la detección de «bullets» (separador de viñetas de texto).

source: By default, when a bullet is detected, the bullet paragraph is not considered as a verbatim paragraph (with the no-wrap flag in the PO file), but the module rewrap this paragraph in the generated PO file and in the translation.
es: Por omisión, cuando se detecta un «bullet», el párrafo del «bullet» no se toma como un párrafo literal (con la marca no-wrap en el fichero PO), pero el módulo justifica este párrafo en el fichero PO generado y en la traducción.

source: B<tabs>=I<mode>
es: B<tabs>=I<modo>

source: Specify how tabulations shall be handled. The I<mode> can be any of:
es: Especificar como se tratan las tabulaciones. El I<modo> puede ser cualquiera de los siguientes:

source: Lines with tabulations introduce breaks in the current paragraph.
es: Las líneas con tabulaciones insertan líneas nuevas en el párrafo actual.

source: Paragraph containing tabulations will not be re-wrapped.
es: Los párrafos que contienen tabulaciones no se justificarán.

source: By default, tabulations are considered as spaces.
es: Por omisión, las tabulaciones se consideran espacios.

source: B<breaks>=I<regex>
es: B<breaks>=I<expresión_regular>

source: A regular expression matching lines which introduce breaks. The regular expression will be anchored so that the whole line must match.
es: Una expresión regular que coincide con las líneas que introducen nuevas líneas. La expresión será anclada para que la línea completa tenga que coincidir con el patrón.

source: Handle the header and footer of released versions, which only contain non translatable informations.
es: Tratar la cabecera y pié de página de las versiones publicadas, que sólo contienen información no traducible.

source: Handle the fortunes format, which separate fortunes with a line which consists in '%' or '%%', and use '%%' as the beginning of a comment.
es: Tratar el formato fortunes, que separa fortunes con una línea que consiste de '%' o '%%', y usa '%%' al inicio de un comentario.

source: Handle some special markup in Markdown-formatted texts.
es: Tratar algunas marcas especiales en textos con formato Markdown.

source: Handle documents in the asciidoc format.
es: Tratar documentos en formato asciidoc.

source: Tested successfully on simple text files and NEWS.Debian files.
es: Probado con éxito en ficheros de texto simple y ficheros «NEWS.Debian».

source: Copyright 2005-2008 by Nicolas FRANÇOIS <nicolas.francois@centraliens.net>.
es: Copyright 2005-2008 por Nicolas FRANÇOIS <nicolas.francois@centraliens.net>.

source: Locale::Po4a::TransTractor - Generic trans(lator ex)tractor.
es: Locale::Po4a::TransTractor - Trans(lator ex)tractor genérico (traductor extractor).
