Repository: elric/deb-l10n
Catalog: po4a-pod-*.po
Languages: es

source: Moreover, such problems are hard to detect (i.e., only Korean readers will detect that the encoding of Korean is broken [because of the Russian translator])
es: Además, estos problemas son difíciles de detectar (es decir, solo los lectores Coreanos detectarán que falla la codificación del Coreano [por culpa del traductor ruso])

source: gettext solves all those problems together.
es: gettext soluciona todos estos problemas a la vez.

source: But gettext wasn't designed for that use!
es: ¡Pero gettext no se diseñó para este uso!

source: That's true, but until now nobody came with a better solution. The only known alternative is manual translation, will all the maintenance issues.
es: Es cierto, pero hasta el momento nadie ha propuesto una solución mejor. La única alternativa conocida es la traducción manual, con todos los problemas de mantenimiento.

source: What about the other translation tools for documentation using gettext?
es: ¿Qué hay de las otras herramientas de traducción de documentación que usan gettext?

source: As far as I know, there are only two of them:
es: Hasta donde yo sé, sólo hay dos de ellas:

source: This is the tool developed by KDE people to handle DocBook XML. AFAIK, it was the first program to extract strings to translate from documentation to po files, and inject them back after translation.
es: Esta es la herramienta desarrollada por la gente de KDE para tratar DocBook XML. Me parece que este fue el primer programa que extrajo cadenas de texto a traducir desde la documentación a ficheros po, e inyectarlas de vuelta después de la traducción.

source: It can only handle XML, and only a particular DTD. I'm quite unhappy with the handling of lists, which end in one big msgid. When the list become big, the chunk becomes harder to shallow.
es: Únicamente puede tratar xml, y solo un dtd en particular. Estoy bastante insatisfecho con el tratamiento que hacen de las listas, que terminan en un único msgid. Cuando la lista crece, el bloque se hace difícil de tratar.

source: This program done by Denis Barbier is a sort of precursor of the po4a sgml module, which more or less deprecates it. As the name says, it handles only the debiandoc dtd, which is more or less a deprecated dtd.
es: Este programa hecho por Denis Barbier es un tipo de precursor del módulo sgml de po4a, que más o menos lo deja obsoleto. Como su nombre indica, únicamente trata el dtd de debiandoc, que además es un dtd anticuado.

source: The main advantages of po4a over them are the ease of extra content addition (which is even worse there) and the ability to achieve gettextization.
es: Las principales ventajas de po4a sobre ellos son la facilidad de adición de contenidos extra (que es aún peor ahí) y la habilidad de realizar la gettextización.

source: Educating developers about translation
es: Educar a los desarrolladores sobre la traducción

source: When you try to translate documentation or programs, you face three kinds of problems; linguistics (not everybody speaks two languages), technical (that's why po4a exists) and relational/human. Not all developers understand the necessity of translating stuff. Even when good willed, they may ignore how to ease the work of translators. To help with that, po4a comes with lot of documentation which can be referred to.
es: Al intentar traducir documentación o programas, se puede encontrar con tres tipos de problemas; lingüísticos (no todo el mundo habla dos lenguas), técnicos (por eso existe po4a) y relacionales/humanos. No todos los desarrolladores entienden la necesidad de traducir las cosas. Incluso los concienciados podrían ignorar como se facilita el trabajo a los traductores. Para ayudar en este tema, po4a trae bastante documentación a la que se puede acudir.

source: Another important point is that each translated file begins with a short comment indicating what the file is, how to use it. This should help the poor developers flooded with tons of files in different languages they hardly speak, and help them dealing correctly with it.
es: Otro punto importante es que cada fichero traducido empieza con un breve comentario que indica qué es el fichero, y como usarlo. Esto debería ayudar a los pobres desarrolladores que sufren avalanchas de ficheros en diferentes idiomas que no entienden, y ayudarles a tratarlos correctamente.

source: In the po4a project, translated documents are not source files anymore. Since sgml files are habitually source files, it's an easy mistake. That's why all files present this header:
es: En el proyecto po4a, la documentación traducida ya no se considera como ficheros de fuentes. Como los ficheros sgml son habitualmente ficheros de fuentes, es un fallo habitual. Es por ello que todos los ficheros presentan esta cabecera:

source: Likewise, gettext's regular po files only need to be copied to the po/ directory. But B<this is not the case of the ones manipulated by po4a>. The major risk here is that a developer erases the existing translation of his program with the translation of his documentation. (Both of them can't be stored in the same po file, because the program needs to install its translation as an mo file while the documentation only uses its translation at compile time). That's why the po files produced by the po-debiandoc module contain the following header:
es: Así mismo, los ficheros po regulares de gettext solo necesitan ser copiados al directorio «po/». Pero B<éste no es el caso de los po tratados por po4a>. Aquí el mayor riesgo es que el desarrollador elimine las traducciones existentes del programa con la traducción de su documentación. (Ambos no se pueden almacenar en el mismo fichero po, porque el programa necesita instalar su traducción en un fichero mo, mientras que la documentación solo utiliza su traducción en tiempo de compilación). Es por esto que los ficheros po producidos por el módulo po-debiandoc contienen la siguiente cabecera:

source: SUMMARY of the advantages of the gettext based approach
es: RESUMEN de las ventajas de la metodología basada en gettext

source: The translations are not stored along with the original, which makes it possible to detect if translations become out of date.
es: Las traducciones no se guardan junto con el original, lo que hace posible la detección de traducciones anticuadas.

source: The translations are stored in separate files from each other, which prevents translators of different languages from interfering, both when submitting their patch and at the file encoding level.
es: Las traducciones se guardan en ficheros separados unos de otros, lo que impide que traductores de diferentes idiomas interfieran en su trabajo tanto al enviar parches, como a nivel de codificación de ficheros.

source: It is based internally on C<gettext> (but C<po4a> offers a very simple interface so that you don't need to understand the internals to use it). That way, we don't have to re-implement the wheel, and because of their wide use, we can think that these tools are more or less bug free.
es: Está basado internamente en C<gettext> (pero C<po4a> ofrece una interfaz muy simple de forma que no necesita entender el funcionamiento interno para usarlo). De esa forma no tenemos que reinventar la rueda, y debido a su uso extendido podemos imaginar que estas herramientas están más o menos libres de fallos.

source: Nothing changed for the end-user (beside the fact translations will hopefully be better maintained :). The resulting documentation file distributed is exactly the same.
es: Para el usuario final nada ha cambiado (aparte de que, probablemente, las traducciones estarían mejor actualizadas :). El fichero de documentación resultante es exactamente el mismo.

source: No need for translators to learn a new file syntax and their favorite po file editor (like emacs' po mode, kbabel or gtranslator) will work just fine.
es: No hace falta que los traductores aprendan una nueva sintaxis de fichero, y sus editores favoritos de ficheros po (como el modo po de emacs, kbabel o gtranslator) servirán a la perfección.

source: Gettext offers a simple way to get statistics about what is done, what should be reviewed and updated, and what is still to do. Some example can be found at those addresses:
es: Gettext ofrece una manera simple de conseguir estadísticas sobre qué está hecho, qué se debería repasar y actualizar, y lo que queda por hacer. Puede encontrar algunos ejemplos en estas direcciones:

source: But everything isn't green, and this approach also has some disadvantages we have to deal with.
es: Pero no todo es bonito, y este enfoque también tiene algunas desventajas con las que debemos lidiar.

source: Addenda are... strange at the first glance.
es: Los apéndices son... extraños a primera vista.

source: You can't adapt the translated text to your preferences, like splitting a paragraph here, and joining two other ones there. But in some sense, if there is an issue with the original, it should be reported as a bug anyway.
es: No puede adaptar el texto traducido a su gusto, como dividir párrafos por aquí, y juntar esos dos allí. Pero por supuesto, si hay algún problema con el original debería remitir un informe de fallo.

source: Even with an easy interface, it remains a new tool people have to learn.
es: Incluso con una interfaz fácil, sigue siendo una nueva herramienta que la gente debe aprender.

source: One of my dreams would be to integrate somehow po4a to gtranslator or kbabel. When an sgml file is opened, the strings are automatically extracted. When it's saved a translated sgml file can be written to disk. If we manage to do an MS Word (TM) module (or at least RTF) professional translators may even use it.
es: Uno de mis sueños es integrar de alguna forma po4a con gtranslator o kbabel. Cuando se abre un fichero sgml, se extraen las cadenas automáticamente. Al guardar se guarda un fichero sgml traducido en el disco. Si consiguiéramos hacer un módulo para MS Word (TM) (o al menos RTF) incluso podrían usarlo traductores profesionales.

source: po4a-runtime - po4a and runtime gettext translation without autotools.
es: po4a-runtime - po4a y traducción gettext en tiempo de ejecución sin autotools.

source: With F<po4a-build>, F<po4a> also includes support for adding translation of runtime script output messages using gettext but without requiring the package to adopt autotools and the typical F<./configure> process.
es: Gracias a F<po4a-build>, F<po4a> permite también añadir las traducciones de mensajes de salida de scripts en tiempo de ejecución, usando gettext. Ademas, se hace sin necesidad de integrar autotools y el típico proceso F<./configure>.

source: Using example F<Makefile> snippets, packages can harness F<intltool> with minimal effort.
es: Usando secciones de ejemplo de F<Makefile>, los paquetes pueden usar F<intltool> con el mínimo esfuerzo.

source: Layout
es: Diseño

source: Documentation translation should NOT use the same F<po/> directory as the runtime translation. Whilst runtime translation can use directories other than F<po/>, it is usually easiest to go with the convention.
es: La documentación de la traducción NO debería usar el mismo directorio F<po/> que las traducciones de mensajes en tiempo de ejecución. Aunque la traducción de mensajes tiempo de ejecución puede usar otros directorios aparte de F<po/>, es más fácil seguir el uso convencional.

source: Multiple languages
es: Varios lenguajes

source: Just a word on packages that use scripts in multiple programming languages. A common mix is perl and shell. Note bene: gettext WILL get confused and omit strings from one or other language unless file extensions are used for whichever is the least problematic language.
es: Sólo un apunte acerca de paquetes que usan scripts en varios lenguajes de programación. Una mezcla común es perl y el intérprete de consola. Nota: gettext se equivocará y omitirá cadenas de uno u otro idioma, a menos que use extensiones de fichero para el lenguaje menos problemático.

source: When using multiple languages, experiment with various settings in F<po/Makevars> until you get all the strings you need in the POT file.
es: Al usar varios lenguajes, experimente con varias configuraciones en F<po/Makevars> hasta que obtenga las cadenas necesarias en el fichero pot.

source: In particular, specifying two languages in F<po/Makevars> can be problematic. Instead of:
es: Especificar dos lenguajes en F<po/Makevars> puede ser problemático. En lugar de:

source: # Don't do this: XGETTEXT_OPTIONS = -L Perl -L Shell --from-code=iso-8859-1
es: # No hagas esto: XGETTEXT_OPTIONS = -L Perl -L Shell --from-code=iso-8859-1

source: Consider renaming (or providing symlink(s) for) all files for one of the languages involved and omitting the explicit -L options. The file extension only needs to exist during the time that F<po/POTFILES.in> is being processed.
es: considere renombrar (o proporcionar symlink(s)) para todos los ficheros de uno de los lenguajes implicados, y omita las opciones de -L explicitas. La extensión del fichero solo tiene que existir mientras se procese F</POTFILES.in>

source: The --keywords option can also be useful - see the xgettext documentation.
es: La opción «--keywords» también puede ser de utilidad. Consulte la documentacion de xgettext.

source: Populating po/
es: Llenar «po/»

source: So, create your top level F<po/> directory and then use the example files in F</usr/share/doc/po4a/examples/> to populate it.
es: Finalizando, tiene que crear su directorio F<po/> de nivel superior y después usar los ficheros de ejemplo en F</usr/share/doc/po4a/examples/> para llenarlo.

source: Must exist, even if empty. Consists of a list of translations - each line not starting with a '#' must match an existing PO file. e.g. if LINGUAS contains a single line, 'fr', an F<fr.po> file must exist alongside the LINGUAS file.
es: Este campo debe estar presente, incluso vacío. Consiste de una lista de traducciones, cada línea que no empiece con un «#» debe coincidir con un fichero po ya existente. Por ejemplo, si LINGUAS contiene una sola línea, «fr», debe tener un fichero F<fr.po> al igual que en el fichero LINGUAS.

source: By convention, the LINGUAS file is sorted alphabetically but that is a manual process.
es: Por convención, el fichero LINGUAS está organizado alfabéticamente, pero este es un proceso manual.

source: The list of files containing the messages that need to be translated at runtime - i.e. your scripts. If you've used the top level F<po/> directory, the paths should be relative to the top level directory, not the F<po/> directory itself.
es: La lista de ficheros que contienen mensajes que se traducirán en tiempo de ejecución, por ejemplo, sus scripts. De emplear el directorio F<po/> de nivel superior, las rutas tendrán que ser relativas al directorio de nivel superior, no al mismo directorio F<po/>.

source: $ ls -l myscript.pl another.pl foo/support.pl po/ po/POTFILES.in $ cat po/POTFILES.in myscript.pl another.pl foo/support.pl $
es: $ ls -l mi_script.pl otro.pl foo/compatibilidad.pl po/ po/POTFILES.in $ cat po/POTFILES.in mi_script.pl otro.pl foo/compatibilidad.pl $

source: Note that it is explicitly supported that the scripts themselves can contain strings for both runtime and documentation translation, e.g. using gettext functions for runtime and embedded POD content for documentation. So it is not a problem to have the same file listed in F<po/POTFILES.in> and F<doc/po4a-build.conf>
es: Observe que se menciona explícitamente que los scripts pueden contener cadenas para la traducción de mensajes de documentación y también de mensajes en tiempo de ejecución. Por ejemplo, usar funciones de gettext para los mensajes en tiempo de ejecución y el contenido integrado de la documentación pod. Por ello, no es problema si tiene el mismo fichero listado en F<po/POTFILES.in> y F<doc/po4a-build.conf>.

source: If your scripts are perl, copy this example file as F<po/Makevars> and edit it to suit.
es: Si sus scripts están escritos en perl, copie este fichero de ejemplo como F<po/Makevars> y ajústelo a sus necesidades.

source: If your scripts are shell, copy this example file as F<po/Makevars> and edit it to suit.
es: Si sus scripts son de intérprete de órdenes, cope este fichero de ejemplo como F<po/Makevars> y ajústelo a sus necesidades.

source: Copy this example file as F<po/Makefile> - it shouldn't need editing but you may want to keep it updated against F</usr/share/doc/po4a/examples/po4a-build.make> as it may need to be updated within po4a releases as the underlying intltool support changes. (The file itself was generated from another project using autotools and intltool.)
es: Copie este fichero de ejemplo como F<po/Makefile>. No tendría porqué editarlo, pero puede que quiera crear un symlink con F</usr/share/doc/po4a/examples/po4a-build.make>, ya que puede precisar actualización en futuras publicaciones de po4a, a medida que cambia el elemento subyacente de apoyo intltool. (El fichero en si mismo se generó en otro proyecto usando autotools e intltool.)

source: Building
es: Construir

source: These snippets need to be added to your top level Makefile or whatever other method you use to prepare your sources for distribution.
es: Necesita añadir estas partes a su Makefile de nivel superior, o a cualquier otro método que use para preparar las fuentes para su distribución.

source: (In an autotools project, this would happen automatically by simply adding F<po> to the C<SUBDIRS> value in F<Makefile.am>.)
es: (En un proyecto con autotools, esto ocurre automáticamente si añade F<po> al valor de <SUBDIRS> en <Makefile.am>.)

source: Maintenance
es: Actualización

source: Runtime translation isn't quite as easy as F<po4a-build> in that adding a new translation does require editing F<po/LINGUAS>, but apart from that, updating translations is merely a case of replacing the relevant PO file with the new version.
es: La traducción en tiempo de ejecución no es tan sencilla como con F<po4a-build>, ya que necesita editar F<po/LINGUAS> para añadir una nueva traducción. Pero aparte de esto, actualizar traducciones es tan fácil como reemplazar el fichero po relevante con la nueva versión.

source: Depending on how you prepare your source tarball, you may also need to list new PO files in the MANIFEST file or add to the script(s) that prepare the tarball. (That also applies to F<po4a-build>.)
es: Dependiendo de como prepare su tarball de fuentes, puede que también necesite listar los nuevos ficheros po en el fichero MANIFEST o añadir el/los script(s) que preparan el tarball (esto también afecta a F<po4a-build>).

source: Any F<*.mo> or F<*.gmo> files in po can be deleted / cleaned up.
es: Puede borrar todo fichero F<*.mo> o F<*.gmo> del directorio «po/».

source: Whilst the example files are part of the po4a project, you are free to use, modify and distribute them in your own projects without needing to refer back to po4a or list the po4a team in your own copyright notices, in the same manner as other build tools like automake itself. If you want to mention po4a, that is fine too.
es: Aunque los ficheros de ejemplo sean parte del proyecto po4a, es libre de usar, modificar o distribuir los mismos en sus proyectos sin necesidad de remitirse a po4a o incluir al equipo de po4a en sus notas de derechos de autor, al igual que con otras herramientas de compilación como el mismo automake. No pondremos objeciones si desea mencionar po4a en su proyecto.

source: Locale::Po4a::BibTeX - Convert BibTeX documents from/to PO files
es: Locale::Po4a::BibTeX - Conversión de documentos BibTeX de/a ficheros PO.

source: Locale::Po4a::BibTeX is a module to help the translation of bibliographies in the BibTeX format into other [human] languages.
es: Locale::Po4a::BibTeX es un módulo que le asiste en la traducción de bibliografías en formato BibTex a otros lenguajes (humanos).

source: Fields values are extracted and proposed for translation.
es: Los valores de los campos se extraen, y propuestas para su traducción.

source: OPTIONS ACCEPTED BY THIS MODULE
es: OPCIONES ACEPTADAS POR ESTE MODULO

source: NONE.
es: NINGUNA.

source: STATUS OF THIS MODULE
es: ESTADO DE ESTE MODULO

source: It is a very simple module, but still young.
es: Es un módulo muy simple, pero aún reciente.

source: Copyright 2006 by Nicolas FRANÇOIS <nicolas.francois@centraliens.net>.
es: Copyright 2006 por Nicolas FRANÇOIS <nicolas.francois@centraliens.net>.

source: Locale::Po4a::Chooser - Manage po4a modules
es: Locale::Po4a::Chooser - Gestión de módulos de po4a

source: Locale::Po4a::Chooser is a module to manage po4a modules. Before, all po4a binaries used to know all po4a modules (pod, man, sgml, etc). This made the add of a new module boring, to make sure the documentation is synchronized in all modules, and that each of them can access the new module.
es: Locale::Po4a::Chooser es un módulo para la gestión de los módulos de po4a. Antes, todos los binarios de po4a conocían toda la información acerca de todos los módulos (pod, man, sgml, etc). Esto hacía que la adición de un nuevo módulo fuese una tarea aburrida, para asegurarse de que la documentación estuviese sincronizada en todos los módulos, y que todos pudiesen acceder al nuevo módulo.

source: Now, you just have to call the Locale::Po4a::Chooser::new() function, passing the name of module as argument.
es: Ahora, solamente tiene que invocar la función «Locale::Po4a::Chooser::new()», introduciendo el nombre del módulo como argumento.

source: You also have the Locale::Po4a::Chooser::list() function which lists the available format and exits on the value passed as argument.
es: También dispone de la función «Locale::Po4a::Chooser::list()», la cual lista los formatos disponibles y cierra con el valor introducido como argumento.

source: About po4a:
es: Acerca de po4a:

source: About modules:
es: Acerca de los módulos:

source: Copyright 2002,2003,2004,2005 by SPI, inc.
es: Copyright 2002,2003,2004,2005 por SPI, inc.

source: Locale::Po4a::Common - Common parts of the po4a scripts and utils
es: Locale::Po4a::Common - Partes comunes de los scripts de po4a y herramientas

source: Locale::Po4a::Common contains common parts of the po4a scripts and some useful functions used along the other modules.
es: Locale::Po4a::Common contiene partes comunes a los scripts de po4a y algunas funciones útiles usadas junto con los otros módulos.

source: In order to use Locale::Po4a programatically, one may want to disable the use of Text::WrapI18N, by writing e.g.
es: Para poder usar Locale::Po4a programáticamente, puede que desee desactivar el uso de Text::WrapI18N introduciendo, por ejemplo

source: instead of:
es: en lugar de:

source: Ordering is important here: as most Locale::Po4a modules themselves load Locale::Po4a::Common, the first time this module is loaded determines whether Text::WrapI18N is used.
es: El orden aquí es importante: ya que la mayoría de los módulos Locale::Po4a cargan también Locale::Po4a::Common, la primera vez que cargue el módulo determinará si se usa Text::WrapI18N.

source: FUNCTIONS
es: FUNCIONES

source: Showing output messages
es: Mostrar mensajes de salida

source: Shows the current version of the script, and a short copyright message. It takes the name of the script as an argument.
es: Mostrar la versión actual del script, y un breve mensaje de derechos de autor. Toma el nombre del script como argumento.

source: This function displays a message the same way than sprintf() does, but wraps the result so that they look nice on the terminal.
es: Esta función muestra un mensaje de la misma manera que lo hace sprintf(), pero justifica el resultado para que se vea bien en la terminal.
