Repository: elric/deb-l10n
Catalog: po4a-pod-*.po
Languages: es

source: Locale::Po4a::Xml is a module to help the translation of XML documents into other [human] languages. It can also be used as a base to build modules for XML-based documents.
es: Locale::Po4a::Xml es un módulo que asiste en la traducción de documentación en el formato XML a otros lenguajes (humanos). También se puede usar como base para construir módulos para documentos basados en XML.

source: TRANSLATING WITH PO4A::XML
es: TRADUCIR CON PO4A::XML

source: This module can be used directly to handle generic XML documents. This will extract all tag's content, and no attributes, since it's where the text is written in most XML based documents.
es: Este módulo se puede usar directamente para tratar documentos XML genéricos. Extraerá el contenido de todas las etiquetas, y ningún atributo, ya que ahí es donde se escribe el texto en la mayoría de documentos basados en XML.

source: The global debug option causes this module to show the excluded strings, in order to see if it skips something important.
es: La opción debug global provoca que este módulo muestre las cadenas excluidas, para ver si se salta algo importante.

source: Prevents it to strip the spaces around the extracted strings.
es: Evita que se quiten los espacios alrededor de las cadenas extraídas.

source: Canonizes the string to translate, considering that whitespaces are not important, and wraps the translated document. This option can be overridden by custom tag options. See the "tags" option below.
es: Canoniza las cadenas a traducir, considerando que los espacios en blanco no son importantes, y justifica el documento traducido. Tienen preferencia sobre esta, las opciones personalizadas de cada etiqueta. Consulte la opción «tags» de más abajo.

source: It makes the tags and attributes searching to work in a case insensitive way. If it's defined, it will treat E<lt>BooKE<gt>laNG and E<lt>BOOKE<gt>Lang as E<lt>bookE<gt>lang.
es: Permitir que las búsquedas de etiquetas y atributos no tengan en cuenta mayúsculas y minúsculas. Si está definido, tratará E<lt>BooKE<gt>laNG y E<lt>BOOKE<gt>Lang como E<lt>bookE<gt>lang.

source: When defined, external entities are included in the generated (translated) document, and for the extraction of strings. If it's not defined, you will have to translate external entities separately as independent documents.
es: De estar definido, se incluirán las entidades externas en el documento (traducido) generado, así como para la extracción de cadenas. De no estar definido tendrá que traducir las entidades externas separadamente, como documentos independientes.

source: This option defines the behavior of the module when it encounter a invalid Xml syntax (a closing tag which does not match the last opening tag, or a tag's attribute without value). It can take the following values:
es: Esta opción define el comportamiento del módulo cuando encuentra sintaxis Xml no válido (una etiqueta de cierra que no concuerda con la última etiqueta de inicio, o un atributo de etiqueta sin un valor). Puede tomar los siguientes valores.

source: This is the default value. The module will exit with an error.
es: Éste es el valor predeterminado. El módulo cerrará con un mensaje de error.

source: The module will continue, and will issue a warning.
es: El módulo continuará, mostrando una advertencia.

source: The module will continue without any warnings.
es: El módulo continuará sin advertencias.

source: Be careful when using this option. It is generally recommended to fix the input file.
es: Sea cuidadoso a la hora de usar esta opción. En general, recomendamos arreglar el fichero de entrada.

source: Extracts only the specified tags in the "tags" option. Otherwise, it will extract all the tags except the ones specified.
es: Extraer únicamente las etiquetas especificadas en la opción «tags». De no ser así, extraerá todas las etiquetas excepto las especificadas.

source: Note: This option is deprecated.
es: Nota: Esta opción está obsoleta.

source: String that will try to match with the first line of the document's doctype (if defined). If it doesn't, a warning will indicate that the document might be of a bad type.
es: La cadena que intentará encajar con la primera línea del «doctype» del documento (si está definida). Una advertencia indicará que el documento puede ser de un tipo equivocado, si no encaja.

source: String indicating the path (e.g. E<lt>bbbE<gt>E<lt>aaaE<gt>) of a tag where a lang="..." attribute shall be added. The language will be defined as the basename of the PO file without any .po extension.
es: Cadena que indica la ruta (por ejemplo, E<lt>bbbE<gt>E<lt>aaaE<gt>) de una etiqueta donde se ha de añadir el atributo «lang="..."». El idioma se se definirá como el nombre base del fichero po sin ninguna extensión «po».

source: Space-separated list of tags you want to translate or skip. By default, the specified tags will be excluded, but if you use the "tagsonly" option, the specified tags will be the only ones included. The tags must be in the form E<lt>aaaE<gt>, but you can join some (E<lt>bbbE<gt>E<lt>aaaE<gt>) to say that the content of the tag E<lt>aaaE<gt> will only be translated when it's into a E<lt>bbbE<gt> tag.
es: Lista separada por espacios de las etiquetas que desea traducir u omitir. Por omisión, se excluirán las etiquetas especificadas, pero si utiliza la opción «tagsonly», las etiquetas especificadas serán los únicos incluidos. Las etiquetas deben tener la forma E<lt>aaaE<gt>, pero puede juntar algunos (E<lt>bbbE<gt>E<lt>aaaE<gt>) para indicar que el contenido de la etiqueta E<lt>aaaE<gt> sólo se debe traducir cuando esté dentro de la etiqueta E<lt>bbbE<gt>.

source: You can also specify some tag options putting some characters in front of the tag hierarchy. For example, you can put 'w' (wrap) or 'W' (don't wrap) to override the default behavior specified by the global "wrap" option.
es: También puede especificar algunas opciones de etiqueta poniendo algunos caracteres delante de la jerarquía de etiquetas. Por ejemplo, puede poner «w» (justificar) o «W» (no justificar) para hacer caso omiso del comportamiento predeterminado especificado por la opción global «wrap».

source: Example: WE<lt>chapterE<gt>E<lt>titleE<gt>
es: Ejemplo: WE<lt>chapterE<gt>E<lt>titleE<gt>

source: Note: This option is deprecated. You should use the B<translated> and B<untranslated> options instead.
es: Nota: Esta opción está obsoleta. En lugar de ello, debería usar las opciones B<translated> y B<untranslated>.

source: Space-separated list of tag's attributes you want to translate. You can specify the attributes by their name (for example, "lang"), but you can prefix it with a tag hierarchy, to specify that this attribute will only be translated when it's into the specified tag. For example: E<lt>bbbE<gt>E<lt>aaaE<gt>lang specifies that the lang attribute will only be translated if it's into an E<lt>aaaE<gt> tag, and it's into a E<lt>bbbE<gt> tag.
es: Lista separada por espacios de los atributos de etiquetas que quiere traducir. Puede especificar los atributos por su nombre (por ejemplo, «lang»), pero puede añadirle como prefijo una jerarquía de etiquetas para especificar que esta etiqueta sólo se debe traducir cuando esté dentro de la etiqueta especificada. Por ejemplo: E<lt>bbbE<gt>E<lt>aaaE<gt>lang indica que el atributo «lang» sólo se traducirá cuando esté dentro de la etiqueta E<lt>aaaE<gt>, y ésta esté dentro de una etiqueta E<lt>bbbE<gt>.

source: Do not translate attributes in inline tags. Instead, replace all attributes of a tag by po4a-id=<id>.
es: No traducir los atributos en etiquetas en línea. En lugar de ello, reemplazar todos los atributos de una etiqueta con po4a-id=<id>.

source: This is useful when attributes shall not be translated, as this simplifies the strings for translators, and avoids typos.
es: Esto es útil cuando no se deben traducir los atributos, simplificando las cadenas a las traductores evitando así errores al teclear.

source: Space-separated list of tags which should not be treated as tags. These tags are treated as inline, and do not need to be closed.
es: Lista separada por espacios de las etiquetas que no se deberían tratar como tales. Éstas se tratan como etiquetas en línea, y no precisan cierre.

source: Space-separated list of tags which should break the sequence. By default, all tags break the sequence.
es: Lista separada por espacios de las etiquetas que deberían romper la secuencia. Por omisión todas las etiquetas rompen la secuencia.

source: The tags must be in the form <aaa>, but you can join some (<bbb><aaa>), if a tag (<aaa>) should only be considered when it's into another tag (<bbb>).
es: Las etiquetas deben tener la forma <aaa>, pero puede unir algunos (<bbb><aaa>), si una etiqueta (<aaa>) sólo se debe considerar cuando está dentro de otra etiqueta.

source: Space-separated list of tags which should be treated as inline. By default, all tags break the sequence.
es: Lista separada por espacios de las etiquetas que quiere tratar como elementos en línea (que no rompen la secuencia). Por omisión todas las etiquetas rompen la secuencia.

source: Space-separated list of tags which should be treated as placeholders. Placeholders do not break the sequence, but the content of placeholders is translated separately.
es: Lista separada por espacios de las etiquetas que se deberían tratar como marcadores de posición («placeholders»). Éstos no rompen la secuencia, pero su contenido se traduce separadamente.

source: The location of the placeholder in its block will be marked with a string similar to:
es: La ubicación del «placeholder» dentro de su bloque se marcará con una cadena similar a:

source: Space separated list of tags that the module should not try to set by default in any category.
es: Una lista separada por espacios de etiquetas que el módulo no debería definir en ninguna categoría de manera predeterminada.

source: Support C preprocessor directives. When this option is set, po4a will consider preprocessor directives as paragraph separators. This is important if the XML file must be preprocessed because otherwise the directives may be inserted in the middle of lines if po4a consider it belong to the current paragraph, and they won't be recognized by the preprocessor. Note: the preprocessor directives must only appear between tags (they must not break a tag).
es: Compatibilidad con directivas de preprocesador de C. Si activa esta opción, po4a tratará las directivas de preprocesador como separadores de párrafo. Esto cobra importancia si se debe preprocesar el fichero XML, ya que de otra forma las directivas se podrían insertar en medio de la línea si po4a considera que pertenecen al párrafo actual, y serían irreconocibles para el preprocesador. Nota: las directivas del preprocesador deben aparecer entre etiquetas (no deben romper etiquetas).

source: Space-separated list of tags you want to translate.
es: Una lista separada por espacios de etiquetas que desea traducir.

source: You can also specify some tag options putting some characters in front of the tag hierarchy. For example, you can put 'w' (wrap) or 'W' (don't wrap) to overide the default behavior specified by the global "wrap" option.
es: También puede especificar algunas opciones de etiquetas poniendo algunos caracteres delante de la jerarquía de etiquetas. Por ejemplo, puede poner «w» (justificar) o «W» (no justificar) para hacer caso omiso del comportamiento por defecto especificado por la opción global «wrap».

source: Space-separated list of tags you do not want to translate.
es: Lista separada por espacios de las etiquetas que no desea traducir.

source: The default categories for tags that are not in any of the translated, untranslated, break, inline, or placeholder.
es: Las categorías predeterminadas para las etiquetas que no pertenecen a translated, untranslated, break, inline, o placeholder.

source: This is a set of letters:
es: Este es un conjunto de letras:

source: Tags should be translated and content can be re-wrapped.
es: Las etiquetas deben traducirse, y se puede justificar el contenido.

source: Tags should be translated and content should not be re-wrapped.
es: Las etiquetas deben traducirse, y no se debe justificar el contenido.

source: Tags should be translated inline.
es: Las etiquetas se deberían traducir como elementos en línea.

source: Tags should be translated as placeholders.
es: Las etiquetas se deberían traducir como marcadores de posición.

source: DEFINE WHAT TAGS AND ATTRIBUTES TO TRANSLATE
es: DEFINIR QUÉ ETIQUETAS Y ATRIBUTOS TRADUCIR

source: The simplest customization is to define which tags and attributes you want the parser to translate. This should be done in the initialize function. First you should call the main initialize, to get the command-line options, and then, append your custom definitions to the options hash. If you want to treat some new options from command line, you should define them before calling the main initialize:
es: La personalización más simple es definir qué etiquetas («tags») y atributos quiere que el analizador traduzca. Esto se debe hacer en la función initialize. Primero debe invocar la inicialización principal, para obtener las opciones de la línea de órdenes, y luego, añadir sus definiciones personalizadas a la tabla hash de opciones. Si quiere tratar nuevas opciones de la línea de órdenes, debe definirlas antes de llamar a la función initialize principal:

source: You should use the B<_default_inline>, B<_default_break>, B<_default_placeholder>, B<_default_translated>, B<_default_untranslated>, and B<_default_attributes> options in derivated modules. This allow users to override the default behavior defined in your module with command line options.
es: Debería usar las opciones B<_default_inline>, B<_default_break>, B<_default_placeholder>, B<_default_translated>, B<_default_untranslated> y B<_default_attributes> con módulos derivados. Esto permite a los usuarios invalidar el comportamiento predeterminado definido en su módulo, mediante las opciones de línea de órdenes.

source: OVERRIDING THE found_string FUNCTION
es: REDEFINIR LA FUNCIÓN found_string

source: Another simple step is to override the function "found_string", which receives the extracted strings from the parser, in order to translate them. There you can control which strings you want to translate, and perform transformations to them before or after the translation itself.
es: Otro paso simple es redefinir la función «found_string», que recibe las cadenas extraídas por el analizador para su traducción. Ahí puede controlar qué cadenas quiere traducir, y realizar pequeñas transformaciones antes o después de la traducción misma.

source: It receives the extracted text, the reference on where it was, and a hash that contains extra information to control what strings to translate, how to translate them and to generate the comment.
es: Recibe el texto extraído, la referencia de dónde está, y una tabla hash que contiene información adicional para controlar qué cadenas traducir, cómo traducirlas y generar el comentario.

source: The content of these options depends on the kind of string it is (specified in an entry of this hash):
es: El contenido de las opciones depende del tipo de cadena que sea (especificado en una entrada de este hash):

source: type="tag"
es: type=«etiqueta»

source: The found string is the content of a translatable tag. The entry "tag_options" contains the option characters in front of the tag hierarchy in the module "tags" option.
es: La cadena encontrada es el contenido de una etiqueta traducible. La entrada «tag_options» (opciones de etiquetas) contiene los caracteres de opciones delante de la jerarquía de etiquetas en la opción «tags» del módulo.

source: type="attribute"
es: type=«atributo»

source: Means that the found string is the value of a translatable attribute. The entry "attribute" has the name of the attribute.
es: Significa que la cadena encontrada es el valor de un atributo traducible. La entrada «atributo» contiene el nombre del atributo.

source: It must return the text that will replace the original in the translated document. Here's a basic example of this function:
es: Debe devolver el texto que reemplazará al original en el documento traducido. Aquí hay un ejemplo básico de ésta función:

source: There's another simple example in the new Dia module, which only filters some strings.
es: Aquí tiene otro ejemplo simple en el nuevo módulo de Dia, que sólo filtra algunas cadenas.

source: MODIFYING TAG TYPES (TODO)
es: MODIFICAR LOS TIPOS DE ETIQUETA (PENDIENTE)

source: This is a more complex one, but it enables a (almost) total customization. It's based in a list of hashes, each one defining a tag type's behavior. The list should be sorted so that the most general tags are after the most concrete ones (sorted first by the beginning and then by the end keys). To define a tag type you'll have to make a hash with the following keys:
es: Esta personalización es más compleja, pero le permite una personalización (prácticamente) total. Está basada en una lista de tablas hash, cada una de las cuales define el comportamiento de un tipo de etiqueta. La lista debe estar ordenada para que las etiquetas más generales estén después de las más concretas (ordenado primero por la llave «beginning» y luego por la llave «end»). Para definir un tipo de etiqueta debe construir un hash con las siguientes llaves:

source: Specifies the beginning of the tag, after the "E<lt>".
es: Especifica el principio de la etiqueta, después de «E<lt>».

source: Specifies the end of the tag, before the "E<gt>".
es: Especifica el final de la etiqueta, antes de «E<gt>».

source: It says if this is a breaking tag class. A non-breaking (inline) tag is one that can be taken as part of the content of another tag. It can take the values false (0), true (1) or undefined. If you leave this undefined, you'll have to define the f_breaking function that will say whether a concrete tag of this class is a breaking tag or not.
es: Indica si esta clase de etiqueta rompe la secuencia. Una etiqueta en línea («inline») que no rompe la secuencia es uno que puede tomarse como parte del contenido de otra etiqueta. Puede tomar los valores falso (0), cierto (1) o indefinido. Si se deja indefinido, deberá definir la función «f_breaking», que indicará si una etiqueta de esta clase en concreto rompe o no la secuencia.

source: It's a function that will tell if the next tag is a breaking one or not. It should be defined if the "breaking" option is not.
es: Es una función que dirá si la siguiente etiqueta rompe o no. Debe definirla si la opción «breaking» no lo está.

source: If you leave this key undefined, the generic extraction function will have to extract the tag itself. It's useful for tags that can have other tags or special structures in them, so that the main parser doesn't get mad. This function receives a boolean that says if the tag should be removed from the input stream or not.
es: Si deja esta llave indefinida, la función de extracción genérica deberá extraer la etiqueta por si misma. Es útil con etiquetas que pueden contener otras etiquetas o estructuras especiales dentro, y que pueden confundir al analizador principal. Esta función recibe un booleano que indica si la etiqueta se debe eliminar del documento de entrada o no.

source: This function receives the tag (in the get_string_until() format) and returns the translated tag (translated attributes or all needed transformations) as a single string.
es: Esta función devuelve la etiqueta (en el formato «get_string_until()») y devuelve la etiqueta traducida (atributos y toda la información necesaria traducidos) como una única cadena.

source: WORKING WITH TAGS
es: TRABAJAR CON ETIQUETAS

source: This function returns the path to the current tag from the document's root, in the form E<lt>htmlE<gt>E<lt>bodyE<gt>E<lt>pE<gt>.
es: Esta función devuelve la ruta hasta la etiqueta actual desde la raíz del documento, con la forma E<lt>htmlE<gt>E<lt>bodyE<gt>E<lt>pE<gt>.

source: An additional array of tags (without brackets) can be passed in argument. These path elements are added to the end of the current path.
es: Puede introducir como argumento una lista adicional de etiquetas (sin corchetes). Estos elementos de ruta se añaden la final de la ruta actual.

source: This function returns the index from the tag_types list that fits to the next tag in the input stream, or -1 if it's at the end of the input file.
es: Esta función devuelve el índice de la lista «tag_types» que encaja con la siguiente etiqueta en el documento de entrada, o «-1» si está al final del fichero.

source: This function returns the next tag from the input stream without the beginning and end, in an array form, to maintain the references from the input file. It has two parameters: the type of the tag (as returned by tag_type) and a boolean, that indicates if it should be removed from the input stream.
es: Esta función devuelve la próxima etiqueta del documento de entrada sin el principio ni el final, en forma de vector, para mantener las referencias del fichero de entrada. Tiene dos parámetros: el tipo de la etiqueta (tal como devuelve «tag_type») y un booleano, que indica si se debe eliminar del fichero de entrada.

source: This function returns the name of the tag passed as an argument, in the array form returned by extract_tag.
es: Esta función devuelve el nombre de la etiqueta introducida como argumento, en la forma de vector devuelta por «extract_tag».

source: This function returns a boolean that says if the next tag in the input stream is a breaking tag or not (inline tag). It leaves the input stream intact.
es: Esta función devuelve un booleano que indica si la siguiente etiqueta del documento de entrada es una etiqueta que rompe o no (es una etiqueta en línea). Esto deja el documento de entrada intacto.

source: This function translates the next tag from the input stream. Using each tag type's custom translation functions.
es: Esta función traduce la siguiente etiqueta del documento de entrada. Usa las funciones de traducción personalizadas de cada tipo de etiqueta.

source: This function returns a string value that says if the first argument (a tag hierarchy) matches any of the tags from the second argument (a list of tags or tag hierarchies). If it doesn't match, it returns 0. Else, it returns the matched tag's options (the characters in front of the tag) or 1 (if that tag doesn't have options).
es: Esta función devuelve una cadena que dice si el primer argumento (una jerarquía de etiquetas) encaja con alguna de las etiquetas del segundo argumento (una lista de etiquetas o jerarquías de etiqueta). Si no encaja, devuelve 0. De otra forma, devuelve las opciones de la etiqueta emparejada (los caracteres delante de la etiqueta) o 1 (si la etiqueta no tiene opciones).

source: WORKING WITH ATTRIBUTES
es: TRABAJAR CON ATRIBUTOS

source: This function handles the translation of the tags' attributes. It receives the tag without the beginning / end marks, and then it finds the attributes, and it translates the translatable ones (specified by the module option "attributes"). This returns a plain string with the translated tag.
es: Esta función trata la traducción de los atributos de las etiquetas. Recibe una etiqueta sin las marcas de beginning / end, y luego busca los atributos y traduce los traducibles (especificados con la opción «attributes» del módulo). Devuelve una cadena con la etiqueta traducido.

source: WORKING WITH THE MODULE OPTIONS
es: TRABAJAR CON LAS OPCIONES DEL MÓDULO
