Repository: elric/deb-l10n
Catalog: po4a-pod-*.po
Languages: es

source: This function fills the internal structures that contain the tags, attributes and inline data with the options of the module (specified in the command-line or in the initialize function).
es: Esta función llena las estructuras internas que contienen las etiquetas, atributos y datos de elementos en línea con las opciones del módulo (especificadas en la línea de órdenes o en la función initialize).

source: GETTING TEXT FROM THE INPUT DOCUMENT
es: OBTENER EL TEXTO DEL DOCUMENTO DE ENTRADA

source: This function returns an array with the lines (and references) from the input document until it finds the first argument. The second argument is an options hash. Value 0 means disabled (the default) and 1, enabled.
es: Esta función devuelve una lista con las lineas (y referencias) del documento de entrada hasta que encuentra el primer argumento. El segundo argumento es una tabla hash de opciones. El valor 0 significa desactivado (predeterminado) y 1, activado.

source: The valid options are:
es: Las opciones válidas son:

source: This makes the returned array to contain the searched text
es: Esto hace que la lista de retorno contenga la cadena buscada.

source: This removes the returned stream from the input
es: Esto elimina la cadena del flujo de entrada.

source: This ensures that the searched text is outside any quotes
es: Esto asegura que el texto buscado se encuentra fuera de fragmentos entrecomillados.

source: This function receives as argument the reference to a paragraph (in the format returned by get_string_until), skips his heading spaces and returns them as a simple string.
es: Esta función recibe como argumento la referencia a un párrafo (en el formato devuelto por «get_string_until»), omite los espacios de la cabecera y los devuelve como una cadena simple.

source: This function returns a simple string with the text from the argument array (discarding the references).
es: Esta función devuelve una simple cadena con el texto de la lista del argumento (descartando las referencias).

source: This module can translate tags and attributes.
es: Este módulo puede traducir etiquetas y atributos.

source: DOCTYPE (ENTITIES)
es: DOCTYPE (ENTIDADES)

source: There is a minimal support for the translation of entities. They are translated as a whole, and tags are not taken into account. Multilines entities are not supported and entities are always rewrapped during the translation.
es: Existe una mínima compatibilidad con la traducción de entidades. Se traducen en conjunto, y no se tienen en cuenta las etiquetas. Las entidades multi-línea no son compatibles y siempre se justifican las entidades durante la traducción.

source: MODIFY TAG TYPES FROM INHERITED MODULES (move the tag_types structure inside the $self hash?)
es: MODIFICAR LOS TIPOS DE ETIQUETA DE LOS MÓDULOS HERENCIADOS (¿mover la estructura «tag_types» dentro de la tabla hash $self?)

source: L<po4a(7)|po4a.7>, L<Locale::Po4a::TransTractor(3pm)|Locale::Po4a::TransTractor>.
es: L<po4a(7)|po4a.7>, L<Locale::Po4a::TransTractor(3pm)>, L<Locale::Po4a::Pod(3pm)>.

source: Copyright (c) 2004 by Jordi Vilalta <jvprat@gmail.com> Copyright (c) 2008-2009 by Nicolas François <nicolas.francois@centraliens.net>
es: Copyright (c) 2004 por Jordi Vilalta <jvprat@gmail.com> Copyright (c) 2008-2009 por Nicolas François <nicolas.francois@centraliens.net>
