Repository: elric/deb-l10n
Catalog: po4a-pod-*.po
Languages: es

source: B<translate_joined> indicates that po4a must propose to translate the arguments of the macro.
es: B<translate_joined> indica a po4a que proponga la traducción de los argumentos de la macro.

source: With B<translate_each>, the arguments will also be proposed for the translation, except that each one will be translated separately.
es: Con B<translate_each>, los argumentos se propondrán también para su traducción, sólo que se traducirá cada uno separadamente.

source: This option takes in argument a list of coma-separated couples I<begin>:I<end>, where I<begin> and I<end> are commands that delimit the begin and end of a section that should not be rewrapped.
es: Esta opción toma como argumento una lista de parejas separadas por comas I<begin>:I<end>, donde I<begin> y I<end> son órdenes que delimitan el principio y final de una sección que no debería justificarse.

source: Note: no test is done to ensure that an I<end> command matches its I<begin> command; any ending command stop the no_wrap mode. If you have a I<begin> (respectively I<end>) macro that has no I<end> (respectively I<begin>), you can specify an existing I<end> (like fi) or I<begin> (like nf) as a counterpart. These macros (and their arguments) wont be translated.
es: Nota: no se realiza ningún examen para verificar que una orden I<end> coincida con su orden I<begin>; cualquier orden de finalización finaliza el modo «no_wrap». Si tiene una macro I<begin> (o I<end>) que no tiene I<end> (o I<begin>), puede especificar un I<end> ya existente (como «fi») o I<begin> (como «nf») como contrapartida. Estas macros (y sus argumentos) no se traducirán.

source: This option specifies a list of coma-separated macros that must not split the current paragraph. The string to translate will then contain I<foo E<lt>.bar baz quxE<gt> quux>, where I<bar> is the command that should be inlined, and I<baz qux> its arguments.
es: Esta opción especifica una lista separada por comas de macros que no deben dividir el párrafo actual. La cadena a traducir contendrá I<foo E<lt>.bar baz quxE<gt> quux>, siendo I<bar> la orden que debería ser un elemento en línea, y I<baz qux> sus argumentos.

source: This option indicates how po4a should behave when an unknown macro is found. By default, po4a fails with a warning. It can take the following values: I<failed> (the default value), I<untranslated>, I<noarg>, I<translate_joined>, I<translate_each>.
es: Esta opción indica a po4a como actuar cuando encuentre una macro desconocida. Por omisión, po4a da un aviso cuando falla. Puede tomar los siguientes valores: I<failed> (predefinido), I<untranslated>, I<noarg>, I<translate_joined> y I<translate_each>.

source: AUTHORING MAN PAGES COMPLIANT WITH PO4A::MAN
es: ESCRIBIR PÁGINAS DE MANUAL COMPATIBLES CON PO4A::MAN

source: This module is still very limited, and will always be, because it's not a real nroff interpreter. It would be possible to do a real nroff interpreter, to allow authors to use all the existing macros, or even to define new ones in their pages, but we didn't want to. It would be too difficult, and we thought it wasn't necessary. We do think that if manpages' authors want to see their productions translated, they may have to adapt to ease the work of translators.
es: Este módulo es muy limitado, y siempre lo será, debido a que no es un intérprete real de nroff. Sería posible hacer un intérprete real de nroff para permitir a los autores usar las macros existentes, o incluso definir macros nuevas en sus páginas, pero no quisimos. Sería demasiado difícil y no pensamos que fuera necesario. Opinamos que si los autores de las páginas de manual quieren ver su producción traducida, deben adaptarse para facilitar el trabajo de los traductores.

source: So, the man parser implemented in po4a have some known limitations we are not really inclined to correct, and which will constitute some pitfalls you'll have to avoid if you want to see translators taking care of your documentation.
es: Por lo tanto, el analizador de man implementado en po4a tiene algunas limitaciones conocidas que no tenemos en mente corregir, y que representan unos puntos débiles que deberá evitar si quiere que los traductores se interesen por su documentación.

source: Don't program in nroff
es: No programe en nroff

source: nroff is a complete programming language, with macro definition, conditionals and so on. Since this parser isn't a fully featured nroff interpreter, it will fail on pages using these facilities (There are about 200 such pages on my box).
es: nroff es un lenguaje de programación completo, con definiciones de macros, condicionales y todo eso. Como este analizador no es un analizador de nroff completo, fallará en páginas que utilicen esas partes (hay unas 200 páginas así en mi sistema).

source: Use the plain macro set
es: Utilice el juego de macros simples

source: There are still some macros which are not supported by po4a::man. This is only because I failed to find any documentation about them. Here is the list of unsupported macros used on my box. Note that this list isn't exhaustive since the program fails on the first encountered unsupported macro. If you have any information about some of these macros, I'll happily add support for them. Because of these macros, about 250 pages on my box are inaccessible to po4a::man.
es: Aún hay algunas macros no compatibles con po4a::man. Esto es porque no he conseguido encontrar documentación sobre ellas. Aquí hay una lista de las macros no soportadas usadas en mi máquina. Tenga en cuenta que la lista no es exhaustiva ya que el programa falla en la primera macro no soportada que encuentra. Si tiene alguna información sobre alguna de estas macros, intentaré añadir la compatibilidad. Debido a estas macros, hay unas 250 páginas en mi máquina no accesibles a po4a::man.

source: Hiding text to po4a
es: Ocultar texto a po4a

source: Sometimes, the author knows that some parts are not translatable, and should not be extracted by po4a. For example, an option may accept an I<other> argument, and I<other> may also appear as the last item of a list. In the first case, I<other> should be not be translatable. And in the second case, I<other> should be translated.
es: A veces, el autor sabe que hay partes no traducibles, las cuales no debería extraer po4a. Por ejemplo, una opción puede aceptar I<other> (otro) argumento, y I<other> puede también aparecer como el último elemento de una lista. En el primer caso, no se debería traducir I<other>. Y en el segundo, I<other> debería traducirse.

source: In such case, the author can avoid po4a to extract some strings, using some special groff constructs:
es: En tal caso, el autor puede evitar que po4a extraiga algunas cadenas, usando algunos constructos especiales de groff:

source: (this will require the B<-o groff_code=verbatim> option)
es: (esto requiere la opción B<-o groff_code=verbatim>)

source: A new macro can also be defined to automate this: .de IR_untranslated . IR \\$@ ..
es: También puede definir una nueva macro para automatizar ésto: .de IR_untranslated . IR \\$@ ..

source: (this will require the options B<-o groff_code=verbatim> and B<-o untranslated=IR_untranslated>; with this construct, the B<.if !'po4a'hide'> conditional is not strictly needed since po4a will not parse the internal of the macro definition)
es: (esto requiere las opciones B<-o groff_code=verbatim> y B<-o untranslated=IR_untranslated>; con este constructo, el condicional B<.if !'po4a'hide'> no es estrictamente necesario ya que po4a no analizará el interior de la definición de macro)

source: or using an alias: .als IR_untranslated IR
es: o usando un alias .als IR_untranslated IR

source: (this will require the B<-o untranslated=als,IR_untranslated> option)
es: (esto requiere la opción B<-o untranslated=als,IR_untranslated>)

source: Conclusion
es: Conclusión

source: To summarise this section, keep simple, and don't try to be clever while authoring your man pages. A lot of things are possible in nroff, and not supported by this parser. For example, don't try to mess with \c to interrupt the text processing (like 40 pages on my box do). Or, be sure to put the macro arguments on the same line that the macro itself. I know that it's valid in nroff, but would complicate too much the parser to be handled.
es: Para resumir esta sección, manténgase en lo simple, e intente no ser demasiado listo cuando escriba sus páginas de manual. nroff le permite hacer un montón de cosas que no están soportadas por este analizador. Por ejemplo, intente no trabajar con \c para interrumpir el procesado de texto (como hacen 40 páginas en mi máquina). O asegúrese de poner los parámetros de las macros en la misma línea que la macro en sí. Ya sé que nroff lo acepta, pero tratarlo añadiría complicaciones al analizador.

source: Of course, another possibility is to use another format, more translator friendly (like pod using po4a::pod, or one of the xml familly like sgml), but thanks to po4a::man it isn't needed anymore. That being said, if the source format of your documentation is pod, or xml, it may be clever to translate the source format and not this generated one. In most cases, po4a::man will detect generated pages and issue a warning. It will even refuse to process Pod generated pages, because those pages are perfectly handled by po4a::pod, and because their nroff counterpart defines a lot of new macros I didn't want to write support for. On my box, 1432 of the 4323 pages are generated from pod and will be ignored by po4a::man.
es: Por supuesto, otra posibilidad es usar otro formato, más amigable a los traductores (como pod usando po4a::pod, o uno de la familia de xml, como sgml), pero gracias a po4a::man ya no los necesita más. Una vez dicho esto, si el formato de origen de su documentación es pod o xml, debería interesarle más traducir el formato de origen y no el generado. En muchos casos, po4a::man detectará las páginas generadas y le informará. Incluso rechazará procesar las páginas generadas desde Pod, ya que esas páginas se tratan a la perfección con po4a::pod, y porque la versión nroff define un montón de macros para las que no quería escribir la compatiblidad. En mi sistema, 1432 de las 4323 páginas son generadas a partir de pod, y se ignoran por po4a::man.

source: In most cases, po4a::man will detect the problem and refuse to process the page, issuing an adapted message. In some rare cases, the program will complete without warning, but the output will be wrong. Such cases are called "bugs" ;) If you encounter such case, be sure to report this, along with a fix when possible...
es: En la mayoría de casos, po4a::man detectará el problema y se negará a procesar la página, mostrando un mensaje adaptado. En algunos casos extraños, el programa terminará sin ningún aviso, pero la salida será mala. Estos casos los llamamos fallos («bugs» ;) Si se encuentra con algún caso así, asegúrese de comunicarlo, además de enviar un arreglo cuando sea posible...

source: This module can be used for most of the existing man pages.
es: Este módulo se puede usar con la mayoría de páginas de manual existentes.

source: Some tests are regularly run on Linux boxes:
es: Algunas pruebas se realizan con regularidad en sistemas Linux:

source: one third of the pages are refused because they were generated from another format supported by po4a (e.g. pod or SGML).
es: Una tercera parte de las páginas se rechazan porque se generaron a partir de otro formato no compatible con po4a (p. ej., pod o SGML).

source: 10% of the remaining pages are rejected with an error (e.g. a groff macro is not supported).
es: El 10% de las páginas restantes se rechazan con un error (p. ej., una macro de groff no es compatible)

source: Then, less than 1% of the pages are accepted silently by po4a, but with significant issues (i.e. missing words, or new words inserted)
es: Por último, po4a acepta sin problema aparentes menos del 1% de las páginas, pero con algunos asuntos de gravedad (p. ej., palabras omitidas, o inserción de nuevas palabras)

source: The other pages are usually handled without differences more important than spacing differences or line rewrapped (font issues in less than 10% of the processed pages).
es: Las otras páginas se tratan normalmente sin diferencias más importantes que la alteración del espaciado o el retorno automático de línea (con problemas de tipo de fuente en menos del 10% de las páginas procesadas).

source: Locale::Po4a::NewsDebian - Convert NEWS.Debian documents from/to PO files
es: Locale::Po4a::NewsDebian - Conversión de documentos NEWS.Debian desde/a ficheros PO.

source: Locale::Po4a::NewsDebian is a module to help the translation of the NEWS.Debian files into other [human] languages. Those files are where maintainer are supposed to write the important news about their package.
es: Locale::Po4a::NewsDebian es un módulo que asiste en la traducción de documentos NEWS.Debian a otros lenguajes (humanos). Estos son los ficheros donde los responsables de los paquetes deben escribir las noticias más relevantes.

source: A finer split of the entries may be preferable (search for /^ */, for example), but this version is more robust and NEWS.Debian entries are not supposed to change that often.
es: La división de las cadenas podría ser más elegante (busca /^ */, por ejemplo )pero esta versión es más solida y se supone que las entradas en NEWS.Debian no cambian con regularidad.

source: This module is loosely inspired from /usr/lib/dpkg/parsechangelog/debian, which is:
es: Este módulo está vagamente inspirado en «/usr/lib/dpkg/parsechangelog/debian».

source: The adaptation for po4a was done by:
es: La adaptación a po4a la realizaron:

source: Locale::Po4a::Pod - Convert POD data from/to PO files
es: Locale::Po4a::Pod - Conversión de datos POD desde/a ficheros PO.

source: # Read POD from STDIN and write to STDOUT. $parser->parse_from_filehandle;
es: # Leer el POD de STDIN y escribir en STDOUT. $parser->parse_from_filehandle;

source: # Read POD from file.pod and write to file.txt. $parser->parse_from_file ('file.pod', 'file.txt');
es: # Leer el POD de fichero.pod y escribir en fichero.txt. $parser->parse_from_file ('fichero.pod', 'fichero.txt');

source: Locale::Po4a::Pod is a module to help the translation of documentation in the POD format (the preferred language for documenting Perl) into other [human] languages.
es: Locale::Po4a::Pod es un módulo que asiste en la traducción de documentación en formato POD (el lenguaje preferido para documentar Perl) a otros lenguajes (humanos).

source: I think that this module is rock stable, and there is only one known bug:
es: Me parece que este módulo es muy estable, y sólo hay un fallo conocido:

source: I have another problem with /usr/lib/perl5/Tk/MainWindow.pod (and some other pages, see below) which contains:
es: Tengo otro problema con «/usr/lib/perl5/Tk/MainWindow.pod» (y algunas otras páginas, véase más abajo) que contiene:

source: Lack of luck, in the po4a version, this was splited on the space by the wrapping. As result, in the original version, the man contain
es: Mala suerte, en la versión de po4a esto se separó en el espacio debido al justificado. Como resultado, en la versión original la página de manual contiene

source: and mine contain
es: y el mio contiene

source: which is logic since C<foobar> is rewritten "foobar"
es: lo cual es lógico ya que C<foobar> se reescribe como "foobar"

source: Complete list of pages having this problem on my box (from 564 pages ; note that it depends on the chosen wrapping column): /usr/lib/perl5/Tk/MainWindow.pod /usr/share/perl/5.8.0/overload.pod /usr/share/perl/5.8.0/pod/perlapi.pod /usr/share/perl/5.8.0/pod/perldelta.pod /usr/share/perl/5.8.0/pod/perlfaq5.pod /usr/share/perl/5.8.0/pod/perlpod.pod /usr/share/perl/5.8.0/pod/perlre.pod /usr/share/perl/5.8.0/pod/perlretut.pod
es: La lista completa de las páginas que dan este problema en mi máquina (de 564 páginas; observe que esto depende de la puntuación elegida para el justificado): /usr/lib/perl5/Tk/MainWindow.pod /usr/share/perl/5.8.0/overload.pod /usr/share/perl/5.8.0/pod/perlapi.pod /usr/share/perl/5.8.0/pod/perldelta.pod /usr/share/perl/5.8.0/pod/perlfaq5.pod /usr/share/perl/5.8.0/pod/perlpod.pod /usr/share/perl/5.8.0/pod/perlre.pod /usr/share/perl/5.8.0/pod/perlretut.pod

source: INTERNALS
es: FUNCIONAMIENTO INTERNO

source: As a derived class from Pod::Parser, Locale::Po4a::Pod supports the same methods and interfaces. See L<Pod::Parser> for all the details; briefly, one creates a new parser with C<< Locale::Po4a::Pod->new() >> and then calls either parse_from_filehandle() or parse_from_file().
es: Como clase derivada de Pod::Parser, Locale::Po4a::Pod es compatible con los mismos métodos e interfaces. Consulte L<Pod::Parser> para más detalles; brevemente, uno crea un nuevo analizador con C<< Locale::Po4a::Pod->new() >> y luego invoca «parse_from_filehandle()» o bien «parse_from_file()».

source: new() can take options, in the form of key/value pairs, that control the behavior of the parser. The recognized options common to all Pod::Parser children are:
es: new() puede tomar opciones, en forma de pares llave/valor, que controlan el comportamiento del analizador. Las opciones comunes reconocidas por todos los hijos de Pod::Parser son:

source: If set to a true value, selects an alternate output format that, among other things, uses a different heading style and marks C<=item> entries with a colon in the left margin. Defaults to false.
es: Si tiene valor verdadero, selecciona un formato alternativo de salida que, entre otras cosas, utiliza un estilo de cabecera diferente y marca las entradas C<=item> con dos puntos en el margen izquierdo. Falso por omisión.

source: If set to a true value, the non-POD parts of the input file will be included in the output. Useful for viewing code documented with POD blocks with the POD rendered and the code left intact.
es: Si es verdadero, las partes no POD del fichero de entrada se incluirán en la salida. Esto es útil para visualizar código documentado con bloques POD, con el POD tratado y el código dejado intacto.

source: The number of spaces to indent regular text, and the default indentation for C<=over> blocks. Defaults to 4.
es: El número de espacios para indentar texto regular, y la indentación por defecto de los bloques C<=over>. Por omisión vale 4.

source: If set to a true value, a blank line is printed after a C<=head1> heading. If set to false (the default), no blank line is printed after C<=head1>, although one is still printed after C<=head2>. This is the default because it's the expected formatting for manual pages; if you're formatting arbitrary text documents, setting this to true may result in more pleasing output.
es: Si toma valor verdadero, se imprime una línea en blanco después de las cabeceras C<=head1>. De ser falso (predeterminado), no se imprimen líneas en blanco después de C<=head1>, pero sí después de C<=head2>. Este es el comportamiento predeterminado porque éste es el formateo esperado para las páginas de manual; si está formateando documentos de texto arbitrario, introducir ésta opción puede resultar en una salida más agradable.

source: Sets the quote marks used to surround CE<lt>> text. If the value is a single character, it is used as both the left and right quote; if it is two characters, the first character is used as the left quote and the second as the right quoted; and if it is four characters, the first two are used as the left quote and the second two as the right quote.
es: Ajustar las marcas de cita CE<lt>> alrededor de texto. Si el valor es un único carácter, se utilizará para las marcas izquierda y derecha; si son dos caracteres, se utilizará el primero para la marca izquierda, y el segundo para la derecha; y si son cuatro caracteres, los dos primeros se utilizarán como marca izquierda, y los dos últimos como marca derecha.

source: This may also be set to the special value C<none>, in which case no quote marks are added around CE<lt>> text.
es: También se le puede dar el valor especial C<none>, en cuyo caso no se añadirán comillas alrededor del texto CE<lt>>.

source: If set to a true value, Locale::Po4a::Pod will assume that each sentence ends in two spaces, and will try to preserve that spacing. If set to false, all consecutive whitespace in non-verbatim paragraphs is compressed into a single space. Defaults to true.
es: Si se define como verdadero, Locale::Po4a::Pod asumirá que cada frase termina con dos espacios, e intentará preservar éste espaciado. Si se define como falso, todos los espacios consecutivos encontrados en un párrafo que no se deba mantener tal cual se comprimirán a un único espacio. Por omisión tiene valor verdadero.

source: The column at which to wrap text on the right-hand side. Defaults to 76.
es: La columna a la cual se justifica el texto en el lado derecho. Por omisión vale 76.

source: Locale::Po4a::Po - po file manipulation module
es: Locale::Po4a::Po - Módulo para la manipulación de ficheros po

source: # Read po file $pofile->read('file.po');
es: # Leer el fichero po $pofile->read('fichero.po');

source: # Add an entry $pofile->push('msgid' => 'Hello', 'msgstr' => 'bonjour', 'flags' => "wrap", 'reference'=>'file.c:46');
es: # Añadir una entrada $pofile->push('msgid' => 'Hello', 'msgstr' => 'hola', 'flags' => "wrap", 'reference'=>'file.c:46');

source: # Extract a translation $pofile->gettext("Hello"); # returns 'bonjour'
es: # Extraer una traducción $pofile->gettext("Hello"); # devuelve 'Hola'

source: # Write back to a file $pofile->write('otherfile.po');
es: # Escribir el resultado en un fichero $pofile->write('otrofichero.po');

source: Locale::Po4a::Po is a module that allows you to manipulate message catalogs. You can load and write from/to a file (which extension is often I<po>), you can build new entries on the fly or request for the translation of a string.
es: Locale::Po4a::Po es un módulo que permite manejar catálogos de mensajes. Con él puede leer y escribir desde/a un fichero (cuya extensión es a menudo I<po>), puede crear nuevas entradas sobre la marcha o pedir la traducción de una cadena.

source: For a more complete description of message catalogs in the po format and their use, please refer to the documentation of the gettext program.
es: Para una descripción más completa de los catálogos de mensajes en formato po y su uso, consulte la documentación del programa gettext.

source: This module is part of the PO4A project, which objective is to use po files (designed at origin to ease the translation of program messages) to translate everything, including documentation (man page, info manual), package description, debconf templates, and everything which may benefit from this.
es: Este módulo es parte del proyecto PO4A, cuyo objetivo es usar ficheros po (diseñados originalmente para facilitar la traducción de mensajes de programa) para traducir de todo, incluyendo documentación (páginas de manual, manuales info), descripciones de paquetes, plantillas debconf, y cualquier cosa que se pueda beneficiar de esto.

source: This specifies the reference format. It can be one of 'none' to not produce any reference, 'noline' to not specify the line number, and 'full' to include complete references.
es: Esto especifica el formato de referencia. Puede usar 'none', para no producir ninguna referencia, 'noline' para no especificar el número de la línea, y 'full' para incluir referencias completas.

source: Functions about whole message catalogs
es: Funciones sobre el catálogo de mensajes entero

source: Creates a new message catalog. If an argument is provided, it's the name of a po file we should load.
es: Crear un nuevo catálogo de mensajes. Si se introduce un argumento, este será el nombre del fichero po a cargar.
