Repository: elric/deb-l10n
Catalog: po4a-pod-*.po
Languages: es

source: Reads a po file (which name is given as argument). Previously existing entries in self are not removed, the new ones are added to the end of the catalog.
es: Leer un fichero po (cuyo nombre se introduce como argumento). Las entradas anteriormente existentes no se eliminan, las nuevas se añaden al final del catálogo.

source: Writes the current catalog to the given file.
es: Escribir el catálogo actual al fichero dado.

source: Like write, but if the PO or POT file already exists, the object will be written in a temporary file which will be compared with the existing file to check that the update is needed (this avoids to change a POT just to update a line reference or the POT-Creation-Date field).
es: Al igual que «write», pero si el fichero PO o POT ya existe, el objeto se escribirá en un fichero temporal para su comparación con el fichero existente, y así determinar si precisa una actualización (esto evita modificar el POT para sólo actualizar una línea de referencia o el campo «POT-Creation-Date»)

source: This function produces one translated message catalog from two catalogs, an original and a translation. This process is described in L<po4a(7)|po4a.7>, section I<Gettextization: how does it work?>.
es: Esta función produce un catálogo de mensajes traducidos desde dos catálogos, uno original y otro su traducción. Este proceso se describe en la sección de L<po4a(7)|po4a.7> I<Gettextización: ¿cómo funciona?>.

source: This function extracts a catalog from an existing one. Only the entries having a reference in the given file will be placed in the resulting catalog.
es: Esta función extrae un catálogo desde uno existente. Sólo se colocan en el catálogo resultante las entradas que tengan una referencia en el fichero dado.

source: This function parses its argument, converts it to a perl function definition, eval this definition and filter the fields for which this function returns true.
es: Esta función analiza su argumento, lo convierte en una definición de una función de perl, la pasa por «eval» y filtra los campos por los que esta función devuelve verdadero («true»).

source: I love perl sometimes ;)
es: A veces me encanta perl ;)

source: Recodes to utf-8 the po's msgstrs. Does nothing if the charset is not specified in the po file ("CHARSET" value), or if it's already utf-8 or ascii.
es: Recodificar los msgtr del po a utf-8. No hace nada si el juego de caracteres no está especificado en el fichero po (valor "CHARSET"), o si ya está en utf-8 o ascii.

source: Functions to use a message catalog for translations
es: Funciones para usar un catálogo de mensajes para traducciones

source: Request the translation of the string given as argument in the current catalog. The function returns the original (untranslated) string if the string was not found.
es: Solicitar la traducción de la cadena dada como argumento en el catálogo actual. La función devuelve la cadena original (sin traducir) si no se ha encontrado la cadena.

source: After the string to translate, you can pass a hash of extra arguments. Here are the valid entries:
es: Después de la cadena a traducir, puede pasar una serie asociativa de argumentos adicionales. Aquí están las entradas válidas:

source: boolean indicating whether we can consider that whitespaces in string are not important. If yes, the function canonizes the string before looking for a translation, and wraps the result.
es: Booleano que indica si se puede considerar que los espacios blancos de la cadena son irrelevantes. De ser así, la función canoniza la cadena antes de buscar su traducción, y justifica el resultado.

source: The column at which we should wrap (default: 76).
es: La columna en la que se debe hacer el salto de línea (por omisión: 76).

source: Returns statistics about the hit ratio of gettext since the last time that stats_clear() was called. Please note that it's not the same statistics than the one printed by msgfmt --statistic. Here, it's statistics about recent usage of the po file, while msgfmt reports the status of the file. Example of use:
es: Devolver estadísticas sobre la tasa de aciertos de gettext desde la última vez que se invocó «stats_clear()». Cabe destacar que éstas no son las mismas estadísticas que muestra «msgfmt --statistic». Estas son sobre el uso reciente del fichero po, mientras que msgfmt informa del estado del fichero. Ejemplo de uso:

source: [some use of the po file to translate stuff]
es: [algún uso del fichero po para traducir cosas]

source: ($percent,$hit,$queries) = $pofile->stats_get(); print "So far, we found translations for $percent\% ($hit of $queries) of strings.\n";
es: ($percent,$hit,$queries) = $pofile->stats_get(); print "Hasta el momento hemos encontrado traducciones para el $percent\% ($hit of $queries) de cadenas.\n";

source: Clears the statistics about gettext hits.
es: Limpiar las estadísticas de aciertos de gettext.

source: Functions to build a message catalog
es: Funciones para construir un catálogo de mensajes

source: Push a new entry at the end of the current catalog. The arguments should form a hash table. The valid keys are:
es: Insertar una nueva entrada al final del catálogo actual. Los argumentos deberían formar una tabla de hash. Las claves válidas son:

source: the string in original language.
es: La cadena en el idioma original.

source: the translation.
es: La traducción.

source: an indication of where this string was found. Example: file.c:46 (meaning in 'file.c' at line 46). It can be a space-separated list in case of multiple occurrences.
es: Una indicación de dónde se encontró la cadena. Ejemplo: «fichero.c:46» (significa en la línea 46 del 'fichero.c'). Puede ser una lista separada por espacios en caso de múltiples apariciones.

source: a comment added here manually (by the translators). The format here is free.
es: Un comentario añadido aquí manualmente (por los traductores). El formato aquí es libre.

source: a comment which was automatically added by the string extraction program. See the I<--add-comments> option of the B<xgettext> program for more information.
es: Un comentario que añadió automáticamente el programa de extracción de cadenas. Véase la opción I<--add-comments> del programa B<xgettext> para más información.

source: space-separated list of all defined flags for this entry.
es: Lista separada por espacios de todas las «flags» (marcas) definidas para ésta entrada.

source: Valid flags are: c-text, python-text, lisp-text, elisp-text, librep-text, smalltalk-text, java-text, awk-text, object-pascal-text, ycp-text, tcl-text, wrap, no-wrap and fuzzy.
es: Las marcas válidas son: c-text, python-text, lisp-text, elisp-text, librep-text, smalltalk-text, java-text, awk-text, object-pascal-text, ycp-text, tcl-text, wrap, no-wrap y fuzzy.

source: See the gettext documentation for their meaning.
es: Véase la documentación de gettext para conocer sus significados.

source: This is mostly an internal argument: it is used while gettextizing documents. The idea here is to parse both the original and the translation into a po object, and merge them, using one's msgid as msgid and the other's msgid as msgstr. To make sure that things get ok, each msgid in po objects are given a type, based on their structure (like "chapt", "sect1", "p" and so on in docbook). If the types of strings are not the same, that means that both files do not share the same structure, and the process reports an error.
es: Este es principalmente un parámetro interno: se usa cuando se gettextizan documentos. La idea aquí es analizar el original y la traducción en un objeto po, y fusionarlos, usando el msgid de uno como msgid y el msgid del otro como msgstr. Para asegurarnos de que todo va bien, a cada msgid de los objetos po se le da un tipo, basado en su estructura (como «chapt», «sect1», «p» y demás en docbook). Si los tipos de las cadenas no coinciden, significa que ambos ficheros no tienen la misma estructura, y el proceso devuelve un error.

source: This information is written as automatic comment in the po file since this gives to translators some context about the strings to translate.
es: Esta información se escribe como un comentario automático en el fichero po, ya que informa al traductor del contexto de la cadena a traducir.

source: boolean indicating whether whitespaces can be mangled in cosmetic reformattings. If true, the string is canonized before use.
es: Booleano que indica si los espacios en blanco se pueden manipular en reformateos cosméticos. Si es verdadero, la cadena se canoniza antes de su uso.

source: This information is written to the po file using the 'wrap' or 'no-wrap' flag.
es: Esta información se escribe en el fichero po usando las marcas 'wrap' o 'no-wrap'.

source: This information is not written to the po file.
es: Esta información no se escribe en el fichero po.

source: Miscellaneous functions
es: Funciones varias

source: Returns the number of entries in the catalog (without the header).
es: Devolver el número de entradas del catálogo (sin la cabecera)

source: Returns the number of entries in document. If a string appears multiple times in the document, it will be counted multiple times
es: Devolver el número de entradas del documento. Si una cadena aparece varias veces en el documento, se contará varias veces.

source: Returns the msgid of the given number.
es: Devolver el msgid con el número dado.

source: Returns the msgid with the given position in the document.
es: Devolver el msgid y su posición en el documento.

source: Returns the character set specified in the po header. If it hasn't been set, it will return "CHARSET".
es: Devuelve el juego de caracteres especificado en la cabecera po. Si no se le ha dado valor, devuelve "CHARSET".

source: This sets the character set of the po header to the value specified in its first argument. If you never call this function (and no file with a specified character set is read), the default value is left to "CHARSET". This value doesn't change the behavior of this module, it's just used to fill that field in the header, and to return it in get_charset().
es: Esto define el juego de caracteres de la cabecera po con el valor especificado en su primer argumento. Si nunca invoca esta función (y no se carga ningún fichero con un juego de caracteres especificado), el valor predefinido es "CHARSET". Este valor no cambia el comportamiento del módulo, simplemente se usa para llenar el campo de la cabecera, y para devolverlo en «get_charset()».

source: Locale::Po4a::Sgml - Convert sgml documents from/to PO files
es: Locale::Po4a::Sgml - Conversión de documentos sgml desde/a ficheros PO.

source: Locale::Po4a::Sgml is a module to help the translation of documentation in the SGML format into other [human] languages.
es: Locale::Po4a::Sgml es un módulo para asistir en la traducción de documentación en formato SGML a otros lenguajes (humanos).

source: This module uses B<nsgmls> to parse the SGML files. Make sure it is installed. Also make sure that the DTD of the SGML files are installed in the system.
es: Este módulo usa B<nsgmls> para analizar los ficheros SGML. Asegúrese de que está instalado. Asegúrese también de que el DTD de los ficheros SGML están instalados en el sistema.

source: Space separated list of keywords indicating which part you want to debug. Possible values are: tag, generic, entities and refs.
es: Es una lista de palabras clave separadas por espacios que indican qué partes se quieren depurar. Posibles valores son: «tag», «generic», «entities» y «refs».

source: Give more information about what's going on.
es: Mostrar más información sobre qué está pasando,

source: Space separated list of extra tags (beside the dtd provided ones) whose content should form an extra msgid.
es: Lista de las etiquetas («tags») adicionales (aparte de los proporcionados por dtd) cuyo contenido debe generar un msgid adicionales, separados por espacios.

source: Space separated list of extra tags (beside the dtd provided ones) containing other tags, some of them being of category 'translate'.
es: Lista separada por espacios de las etiquetas adicionales (aparte de los proporcionados por el dtd) que pueden contener otras etiquetas, algunos de los cuales pueden ser de la categoría 'translate'.

source: Space separated list of tags which increase the indentation level.
es: Lista de todas las etiquetas que aumentan el nivel de indentación, separadas por espacios.

source: The layout within those tags should not be changed. The paragraph won't get wrapped, and no extra indentation space or new line will be added for cosmetic purpose.
es: La organización del contenido de estas etiquetas no se debe cambiar. El párrafo no se justificará ni se añadirán espacios de indentación ni saltos de línea por propósitos estéticos.

source: Tags not needing to be closed.
es: Etiquetas que no necesita cerrar.

source: Tags ignored and considered as plain char data by po4a. That is to say that they can be part of an msgid. For example, E<lt>bE<gt> is a good candidate for this category since putting it in the translate section would create msgids not being whole sentences, which is bad.
es: Las etiquetas ignoradas y consideradas por po4a como datos de caracteres planos. Esto significa que pueden ser parte de un msgid. Por ejemplo, E<lt>bE<gt> es un buen candidato para esta categoría ya que añadirlo en la sección «translate» crearía unos msgid que no serían la frase completa, lo cual no es recomendable.

source: A space separated list of attributes that need to be translated. You can specify the attributes by their name (for example, "lang"), but you can also prefix it with a tag hierarchy, to specify that this attribute will only be translated when it is into the specified tag. For example: E<lt>bbbE<gt>E<lt>aaaE<gt>lang specifies that the lang attribute will only be translated if it is in an E<lt>aaaE<gt> tag, which is in a E<lt>bbbE<gt> tag. The tag names are actually regular expressions so you can also write things like E<lt>aaa|bbbbE<gt>lang to only translate lang attributes that are in an E<lt>aaaE<gt> or a E<lt>bbbE<gt> tag.
es: Lista separada por espacios de los atributos que necesita traducir. Puede especificar los atributos por su nombre (por ejemplo, lang), pero puede añadirle como prefijo una jerarquía de etiquetas para especificar que esta etiqueta sólo se debe traducir cuando esté dentro de la etiqueta especificada. Por ejemplo: E<lt>bbbE<gt>E<lt>aaaE<gt>lang indica que el atributo lang sólo se traducirá cuando esté dentro de la etiqueta E<lt>aaaE<gt>, y este esté dentro de una etiqueta E<lt>bbbE<gt>. Los nombres de las etiquetas son, generalmente, expresiones regulares que le permiten escribir cosas tales como E<lt>aaa|bbbbE<gt>lang sólo para traducir atributos de lang que están dentro de una etiqueta E<lt>aaaE<gt> o E<lt>bbbE<gt>.

source: A space separated list of attributes for which the translation must be qualified by the attribute name. Note that this setting automatically adds the given attribute into the 'attributes' list too.
es: Una lista de elementos separados por espacios de los atributos, para los que la traducción se debe calificar por el nombre del atributo. Observe que definir esto automáticamente también añade el atributo en la lista de 'attributes'.

source: Proceed even if the DTD is unknown or if nsgmls finds errors in the input file.
es: Proceder aunque se desconozca el DTD o si nsgmls encuentra errores en el fichero de entrada.

source: By default, msgids containing only one entity (like '&version;') are skipped for the translator comfort. Activating this option prevents this optimisation. It can be useful if the document contains a construction like "<title>&Aacute;</title>", even if I doubt such things to ever happen...
es: Por omisión, los msgid que contienen solamente una entidad (por ejemplo '&version;') se obvian, para comodidad de los traductores. Evitará esta optimización si activa ésta opción. Puede ser útil si el documento contiene una construcción como «<title>&Aacute;</title>», aunque dudo que nunca pase algo así...

source: Space separated list of entities that won't be inlined. Use this option with caution: it may cause nsgmls (used internally) to add tags and render the output document invalid.
es: Lista de entidades separadas por espacios que no se tratarán como elementos en línea. Use esta opción con cuidado: puede causar que nsgmls (usado internamente) añada etiquetas, y por ello dejar sin valor el documento de salida.

source: The result is perfect. I.e., the generated documents are exactly the same. But there are still some problems:
es: El resultado es perfecto. Es decir, los documentos generados son idénticos. A pesar de todo aún hay algunos problemas:

source: the error output of nsgmls is redirected to /dev/null, which is clearly bad. I don't know how to avoid that.
es: La salida de error de nsgmls se redirige a «/dev/null», lo cual es definitivamente malo. No sé como evitarlo.

source: The problem is that I have to "protect" the conditional inclusions (ie, the C<E<lt>! [ %foo [> and C<]]E<gt>> stuff) from nsgmls. Otherwise nsgmls eats them, and I don't know how to restore them in the final document. To prevent that, I rewrite them to C<{PO4A-beg-foo}> and C<{PO4A-end}>.
es: El problema es que debo «proteger» la inclusión condicional (p. ej., las cosas como C<E<lt>! [ %blah [> y C<]]E<gt>>) de nsgml, porque si no, nsgmls se lo come, y no sé como restaurarlo en el documento final. Para evitarlo, lo reescribo como C<{PO4A-beg-blah}> y C<{PO4A-end}>.

source: The problem with this is that the C<{PO4A-end}> and such I add are valid in the document (not in a E<lt>pE<gt> tag or so).
es: El problema con esto es que C<{PO4A-end}> y otros que añado son válidos en el documento (pero no en un tag E<lt>pE<gt> o parecido).

source: Everything works well with nsgmls's output redirected that way, but it will prevent us from detecting that the document is badly formatted.
es: Con la salida de nsgmls redirigida de esta manera todo funciona bien, pero esto nos impide detectar si el documento está mal formateado.

source: It does work only with the debiandoc and docbook dtd. Adding support for a new dtd should be very easy. The mechanism is the same for every dtd, you just have to give a list of the existing tags and some of their characteristics.
es: Esto sólo funciona con debiandoc y el dtd de docbook. Añadir compatibilidad para un nuevo dtd debería ser muy fácil. El mecanismo es común para todos los dtd, sólo tiene que dar una lista de las etiquetas existentes y algunas de sus características.

source: I agree, this needs some more documentation, but it is still considered as beta, and I hate to document stuff which may/will change.
es: Estoy de acuerdo, esto necesita un poco más de documentación, pero aún se considera beta, y odio documentar cosas que probablemente cambiarán.

source: Warning, support for dtds is quite experimental. I did not read any reference manual to find the definition of every tag. I did add tag definition to the module 'till it works for some documents I found on the net. If your document use more tags than mine, it won't work. But as I said above, fixing that should be quite easy.
es: Advertencia: la compatibilidad con dtd es aún experimental. No leí ningún manual de referencia para mirar la definición de cada los etiqueta. Fui añadiendo definiciones de etiquetas al módulo hasta que funcionaba para varios documentos que encontré en la red. Si su documento utiliza más etiquetas que el mío, no funcionará. Pero tal y como he dicho, arreglar esto debe ser muy fácil.

source: I did test docbook against the SAG (System Administrator Guide) only, but this document is quite big, and should use most of the docbook specificities.
es: Sólo probé docbook con SAG (System Administrator Guide, Guia del administrador de sistemas), pero este documento es muy grande, y debe usar la mayoría de las características específicas de docbook.

source: For debiandoc, I tested some of the manuals from the DDP, but not all yet.
es: Para debiandoc, he probado algunos de los manuales de DDP, pero no todos aún.

source: In case of file inclusion, string reference of messages in po files (ie, lines like C<#: en/titletoc.sgml:9460>) will be wrong.
es: En el caso de inclusión de ficheros, la cadena de referencia del mensaje del fichero po (p.e., líneas como C<#: en/titletoc.sgml:9460>) serán incorrectas.

source: This is because I preprocess the file to protect the conditional inclusion (ie, the C<E<lt>! [ %foo [> and C<]]E<gt>> stuff) and some entities (like &version;) from nsgmls because I want them verbatim to the generated document. For that, I make a temp copy of the input file and do all the changes I want to this before passing it to nsgmls for parsing.
es: Esto es debido a que proceso el fichero para proteger la inclusión condicional (p.e., las cosas como C<E<lt>! [ %blah [> y C<]]E<gt>>) y algunas entidades (como &version;) de nsgmls porque lo quiero igual en el documento generado. Por eso hago una copia temporal del fichero de entrada y hago todos los cambios que quiero en éste antes de pasarlo por nsgmls para su análisis.

source: So that it works, I replace the entities asking for a file inclusion by the content of the given file (so that I can protect what needs to in subfile also). But nothing is done so far to correct the references (i.e., filename and line number) afterward. I'm not sure what the best thing to do is.
es: Para que esto funcione, reemplazo las entidades que incluyen un fichero con el contenido del fichero dado (de forma que puedo proteger lo que convenga del sub-fichero también). Pero por ahora no se hace nada para corregir las referencias (p.ej., nombre de fichero y número de línea) después. No estoy seguro de cuál es la mejor solución.

source: This module is an adapted version of sgmlspl (SGML postprocessor for the SGMLS and NSGMLS parsers) which was:
es: Este módulo es una versión adaptada de sgmlspl (postprocesador SGML para los analizadores SGMLS y NSGMLS) que hizo:

source: Copyright (c) 1995 by David Megginson <dmeggins@aix1.uottawa.ca> Copyright 2002, 2003, 2004, 2005 by SPI, inc.
es: Copyright (c) 1995 por David Megginson <dmeggins@aix1.uottawa.ca> Copyright 2002, 2003, 2004, 2005 por SPI, inc.

source: Locale::Po4a::Texinfo - Convert Texinfo documents and derivates from/to PO files
es: Locale::Po4a::TeXinfo - Conversión de documentos TeXinfo y derivados desde/a ficheros PO.

source: Locale::Po4a::Texinfo is a module to help the translation of Texinfo documents into other [human] languages.
es: Locale::Po4a::Docbook es un módulo que asiste en la traducción de documentación en el formato DocBook XML a otros lenguajes (humanos).

source: This module contains the definitions of common Texinfo commands and environments.
es: Este módulo contiene las definiciones de las órdenes y los entornos más habituales de Texinfo.

source: Locale::Po4a::TeX - Convert TeX documents and derivates from/to PO files
es: Locale::Po4a::TeX - Conversión de documentos TeX y derivados desde/a ficheros PO.

source: Locale::Po4a::TeX is a module to help the translation of TeX documents into other [human] languages. It can also be used as a base to build modules for TeX-based documents.
es: Locale::Po4a::TeX es un módulo que asiste en la traducción de documentos TeX a otros lenguajes (humanos). También se puede usar como base para construir módulos para documentos basados en TeX.

source: Users should probably use the LaTeX module, which inherite from the TeX module and contains the definitions of common LaTeX commands.
es: Probablemente, los usuarios deberían usar el módulo LaTeX, que hereda del módulo TeX y contiene las definiciones de las órdenes más comunes de LaTeX.

source: TRANSLATING WITH PO4A::TEX
es: TRADUCIR CON PO4A::TEX
