Repository: elric/deb-l10n
Catalog: po4a-pod-*.po
Languages: es

source: A value to be passed directly to C<po4a -k> to specify the threshold for correctly translated content before a particular translation is omitted from the build. Leave empty or remove to use the default (80%) or specify zero to force the inclusion of all content, even if completely untranslated.
es: Este es un valor que puede introducir directamente a C<po4a -k> para especificar el umbral porcentual de traducción necesaria en un fichero po para su construcción, antes de omitir una traducción en particular del proceso de construcción por no superarlo. De estar vacío o no presente, usará el valor predeterminado (80), o especifique -k 0 para forzar la inclusión de todo el contenido, aunque no exista nada traducido.

source: For full control over such behaviour, consider carefully which files are assigned to which F<po4a-build.conf> configuration file. Every file listed in any one F<po4a-build.conf> file will be included in the calculation for the percentage of strings correctly translated. If there is one large file that is poorly translated, this will prevent other, smaller, files from being included in the build even if those individual files are 100% translated.
es: Para controlar totalmente ese comportamiento, tenga muy en cuenta qué ficheros asigna a cada fichero de configuración F<po4a-build.conf>. Se incluirá en el cálculo total del número de cadenas correctamente traducidas todo fichero listado en F<po4a-build.conf>. Si hay un fichero grande que esté muy poco traducido, éste evitará que otros ficheros, más pequeños, se incluyan en la construcción aunque éstos estén traducidos al 100%.

source: On the other hand, having lots of files in one POT file can be more convenient for translators, especially if files have strings in common. Conversely, POT files with thousands of long strings are daunting for translators, leading to long string freezes.
es: Por una parte, tener varios ficheros en un solo fichero pot puede ser conveniente para traductores, especialmente si hay cadenas compartidas. Por otra, los ficheros po con miles de largas cadenas atemorizan a los traductores, conduciendo a un largo proceso de estabilización de cadenas.

source: # Minimal threshold for translation percentage to keep KEEP=
es: # El umbral mínimo de porcentaje traducido para generar la documentación. KEEP=

source: DocBook XML files to generate manpages in Section 1. Separate filenames with spaces. All files need to be in the XMLDIR directory.
es: Los ficheros DocBook XML para generar páginas de manual en la Sección 1. Separe los nombres de fichero con espacios. Todos los ficheros deben estar en el directorio XMLDIR.

source: It is common practice to fold multiple XML files into one book, in order to provide a table of contents etc. If the book contains files also specified in XMLMAN3, only specify the XML files for section 1 here, not the book itself. If the book only contains content for this section, only specify the book file.
es: Unir varios ficheros XML en un solo libro es una práctica bastante extendida, para así poder ofrecer una tabla de contenidos, etc. Si el libro contiene ficheros también especificados en XMLMAN3, especifique sólo los ficheros XML para la Sección 1, no el libro completo. Si el libro sólo contiene contenido destinado a esta sección, especifique únicamente el fichero del libro.

source: # the DocBook XML files for Section 1. XMLMAN1="po4a-build.xml po4aman-display-po.xml po4apod-display-po.xml"
es: # Los ficheros DocBook XML para la Sección 1. XMLMAN1="po4a-build.xml po4aman-display-po.xml po4apod-display-po.xml"

source: DocBook XML files to generate manpages in Section 3. Separate filenames with spaces. All files need to be in the XMLDIR directory.
es: Los ficheros DocBook XML para generar páginas de manual en la Sección 3. Separe los nombres de fichero con espacios. Todos los ficheros deben estar en el directorio XMLDIR.

source: It is common practice to fold multiple XML files into one book, in order to provide a table of contents etc. If the book contains files also specified in XMLMAN1, only specify the XML files for section 3 here, not the book itself. If the book only contains content for this section, only specify the book file.
es: Unir varios ficheros XML en un solo libro es una práctica bastante extendida, para así poder ofrecer una tabla de contenidos, etc. Si el libro contiene ficheros también especificados en XMLMAN1, especifique sólo los ficheros XML para la Sección 3, no el libro completo. Si el libro sólo contiene contenido destinado a esta sección, especifique sólo el fichero del libro.

source: # the Docbook XML manpages for Section 3. XMLMAN3=""
es: # Las páginas de manual Docbook XML para la Seccion 3. XMLMAN3=""

source: Location of all the Docbook XML files. Currently, C<po4a-build> expects to be able to find all files listed in XMLMAN1 and XMLMAN3 by looking for *.xml files in this directory.
es: Esta es la ubicación de todos los ficheros DocBook XML. A día de hoy, C<po4a-build> espera ser capaz de encontrar todos los ficheros listados en XMLMAN1 y XMLMAN3 buscando en este directorio los ficheros *.xml.

source: Must be specified if XMLMAN1 or XMLMAN3 are used. Paths are relative to the location of the configuration file.
es: Debe especificar si usa XMLMAN1 o XMLMAN3. Las rutas son relativas a la ubicación del fichero de configuración.

source: # the location of the XML files XMLDIR="share/doc/"
es: # La ubicación de los ficheros XML. XMLDIR="share/doc/"

source: Which packages, out of the list in BINARIES, use XML source content.
es: Los paquetes listados en BINARIES que emplean contenido XML en las fuentes.

source: If any values are given in XMLMAN1 or XMLMAN3, a value must be given here as well.
es: Si da un valor a XMLMAN1 o XMLMAN3, debe también especificar un valor en este campo.

source: # the binary packages using DocBook XML & xsltproc XMLPACKAGES="po4a"
es: # Los paquetes binarios que usan DocBook XML y xsltproc XMLPACKAGES="po4a"

source: Similar to XMLDIR but only used to prepare the translated DocBook files. If your package wants to use .sgml files, please discuss how these should be built on the po4a-devel mailing list.
es: Es similar a XMLDIR, pero solo se usa para preparar los ficheros DocBook traducidos. Si su paquete quiere usar ficheros .sgml, comente en la lista de correo po4a-devel cómo estos se deberían construir.

source: # the pattern to find the .docbook files DOCBOOKDIR=""
es: # El patrón donde encontrar los ficheros .docbook. DOCBOOKDIR=""

source: The XSL stylesheet used to prepare the translated and untranslated content from the DocBook XML files.
es: La hoja de estilo XSL usada para preparar el contenido traducido y original a partir de los ficheros DocBook XML.

source: # the XSL file to use for Docbook XSL XSLFILE="http://docbook.sourceforge.net/release/xsl/current/manpages/docbook.xsl"
es: # El fichero XSL a usar con Docbook XSL. XSLFILE="http://docbook.sourceforge.net/release/xsl/current/manpages/docbook.xsl"

source: The POD file(s) for generating manpage content in section 1. Separate POD files with spaces. Paths, if used, need to be relative to the location of the specified configuration file.
es: Esto especifica el fichero pod que genera el contenido de una página de manual en la Sección 1. Separe los ficheros pod con espacios. De usar rutas, deben ser relativas a la ubicación del fichero de configuración especificado.

source: # the POD files for man1 PODFILE="po4a po4a-gettextize po4a-normalize scripts/msguntypot"
es: # Los ficheros pod para man1. PODFILE="po4a po4a-gettextize po4a-normalize scripts/msguntypot"

source: Specialised support for perl modules containing POD content - the module name will be reconstructed from the path (so this should be the typical perl layout) and manpages are automatically put into section 3.
es: La compatibilidad específica para los módulos perl que contienen el contenido pod. El nombre del módulo se reconstruirá a partir de la ruta (el típico diseño perl) y lás páginas de manual se instalarán automáticamente en la Sección 3.

source: # the POD files for man3/ - module names regenerated from the path. PODMODULES="lib/Locale/Po4a/*.pm"
es: # Los ficheros pod para man3/ - Los nombres de módulo se generan con la ruta. PODMODULES="lib/Locale/Po4a/*.pm"

source: Arbitrary POD content for use generating manpages for section 5. Paths, if used, need to be relative to the location of the specified configuration file.
es: El contenido pod arbitrario a usar para generar páginas de manual en la Sección 5. Si usa rutas, deben ser relativas a la ubicación del fichero de configuración especificado.

source: # POD files for section 5 POD5FILES="doc/po4a-build.conf.5.pod"
es: # Los ficheros pod para la Sección 5 POD5FILES="doc/po4a-build.conf.5.pod"

source: Arbitrary POD content for use generating manpages for section 7. Paths, if used, need to be relative to the location of the specified configuration file.
es: El contenido pod para generar páginas de manual en la Sección 7. Si usa rutas, deben ser relativas a la ubicación del fichero de configuración especificado.

source: Similar to XMLPACKAGES - any package expecting content to be built from POD files needs to include a value in PODPACKAGES. Required if any values are specified for PODFILE, PODMODULES, POD5FILES or POD7FILES.
es: Es parecido a XMLPACKAGES: Debe incluir un valor a PODPACKAGES para cada paquete que espere contenido construido a partir de ficheros pod. Es obligatorio de haber especificado cualquier valor en PODFILE,PODMODULES,POD5FILES o POD7FILES.

source: # the binary packages using POD PODPACKAGES="po4a"
es: # Los paquetes binarios que usan pod. PODPACKAGES="po4a"

source: A subdirectory of BASEDIR to be used to output the untranslated and translated HTML output.
es: Un sub-directorio de BASEDIR que se usará para depositar la salida HTML tanto traducida como no.

source: # html output (subdirectory of BASEDIR) HTMLDIR=""
es: # Salida html (sub-directrio de BASEDIR) HTMLDIR=""

source: The DocBook file to be converted to HTML (may be the same as one of the files in XMLFILE). Sections are not relevant to HTML output, so feel free to use the single book file here so that the HTML has a table of contents etc.
es: El fichero DocBook a convertir a HTML (puede ser igual a uno de los ficheros en XMLFILE). Las secciones carecen de importancia para la salida de HTML, así que puede usar un solo fichero de libro, ya que HTML tiene una tabla de contenidos.

source: # html DocBook file HTMLFILE=""
es: # El fichero html de DocBook. HTMLFILE=""

source: The default is to use a chunked XSL stylesheet. It is not currently supported to use more than one stylesheet per HTML run.
es: Por omisión se usa una hoja de estilo XSL chunk. No puede usar más de una hoja de estilo por HTML en cada ejecución.

source: # the XSL file to use for Docbook XSL HTMLXSL="http://docbook.sourceforge.net/release/xsl/current/html/chunk.xsl"
es: # El fichero a usar para Docbook XSL. HTMLXSL="http://docbook.sourceforge.net/release/xsl/current/html/chunk.xsl"

source: po4a - framework to translate documentation and other materials
es: po4a - Un marco de trabajo para traducir documentación y otro material.

source: 1 Why should I use po4a? What is it good for?
es: 1 ¿Porqué debería usar po4a? ¿Para qué sirve?

source: This introducing chapter explains the motivation of the project and its philosophy. You should read it first if you are in the process of evaluating po4a for your own translations.
es: Este capítulo introductorio explica la motivación del proyecto y su filosofía. Debería leerlo primero si está en el proceso de evaluación de po4a para sus propias traducciones.

source: 2 How to use po4a?
es: 2 ¿Cómo usar po4a?

source: This chapter is a sort of reference manual, trying to answer the users' questions and to give you a better understanding of the whole process. This introduces how to do things with po4a and serve as an introduction to the documentation of the specific tools.
es: Este capítulo es como un manual de referencia, dónde se intenta contestar a las preguntas de los usuarios, y se le ofrece una idea general del proceso. Le introducirá al método de trabajo con po4a y sirve como documentación introductoria a las herramientas específicas.

source: HOWTO begin a new translation?
es: ¿Cómo empezar una nueva traducción?

source: HOWTO change the translation back to a documentation file?
es: ¿Cómo transformar la traducción de vuelta a un fichero de documentación?

source: HOWTO update a po4a translation?
es: ¿Cómo actualizar una traducción con po4a?

source: HOWTO convert a pre-existing translation to po4a?
es: ¿Cómo convertir una traducción ya existente a po4a?

source: HOWTO add extra text to translations (like translator's name)?
es: ¿Cómo añadir texto adicional a las traducciones (como el nombre del traductor)?

source: HOWTO do all this in one program invocation?
es: ¿Cómo hacer todo esto en una sola invocación al programa?

source: HOWTO customize po4a?
es: ¿Cómo configurar po4a?

source: 3 How does it work?
es: 3 ¿Cómo funciona?

source: This chapter gives you a brief overview of the po4a internals, so that you may feel more confident to help us maintaining and improving it. It may also help you understanding why it does not do what you expected, and how to solve your problems.
es: Este capítulo ofrece una breve explicación del funcionamiento interno de po4a, de forma que se pueda sentir más seguro para ayudarnos a desarrollar y mejorarlo. También le puede ayudar a entender porqué no hace lo que esperaba, y cómo solucionar sus problemas.

source: 4 FAQ
es: 4 Preguntas frecuentes

source: This chapter groups the Frequently Asked Questions. In fact, most of the questions for now could be formulated that way: "Why is it designed this way, and not that one?" If you think po4a isn't the right answer to documentation translation, you should consider reading this section. If it does not answer your question, please contact us on the E<lt>po4a-devel@lists.alioth.debian.orgE<gt> mailing list. We love feedback.
es: Este capítulo agrupa las preguntas frecuentes. De hecho, la mayoría de preguntas actuales se pueden formular así: «¿Porqué se ha diseñado de esta manera, y no otra?» Si piensa que po4a no es la solución ideal para la traducción de documentación, debería considerar leer ésta sección. Si no responde a su pregunta, contacte con nosotros en la lista de correo E<lt>po4a-devel@lists.alioth.debian.orgE<gt>. Queremos escuchar su opinión.

source: 5 Specific notes about modules
es: 5 Notas específicas acerca de los módulos

source: This chapter presents the specificities of each module from the translator and original author's point of view. Read this to learn the syntax you will encounter when translating stuff in this module, or the rules you should follow in your original document to make translators' life easier.
es: Este capítulo presenta los puntos específicos de cada módulo desde el punto de vista tanto del traductor como del autor original. Lea esto para aprender la sintaxis que se encontrará cuando traduzca textos con un módulo, o las reglas que debe seguir en el documento original para facilitar la vida del traductor.

source: Actually, this section is not really part of this document. Instead, it is placed in each module's documentation. This helps ensuring that the information is up to date by keeping the documentation and the code together.
es: Actualmente esta sección no forma parte de este documento. En realidad está en la documentación de cada módulo. Esto permite asegurar que la información está actualizada al mantener la documentación y el código juntos.

source: Why should I use po4a? What it is good for?
es: ¿Porqué debo usar po4a? ¿Para qué sirve?

source: I like the idea of open-source software, making it possible for everybody to access to software and to their source code. But being French, I'm well aware that the licensing is not the only restriction to the openness of software: non-translated free software is useless for non-English speakers, and we still have some work to make it available to really everybody out there.
es: Me gusta la idea del software de código abierto, lo que hace posible que todo el mundo pueda acceder al software y a su código fuente. Pero al ser francés soy bien consciente de que la licencia no es la única restricción a la libertad del software: los programas libres no traducidos son inservibles para gente de habla no inglesa, y todavía nos queda bastante tarea para hacerlos disponibles para todos.

source: The perception of this situation by the open-source actors did dramatically improve recently. We, as translators, won the first battle and convinced everybody of the translations' importance. But unfortunately, it was the easy part. Now, we have to do the job and actually translate all this stuff.
es: La percepción de ésta situación por los responsables del software libre ha mejorado drásticamente en los últimos tiempos. Nosotros, como traductores, hemos ganado la primera batalla y hemos convencido a todo el mundo de la importancia de las traducciones. Pero por desgracia, ésta era la parte fácil. Ahora tenemos que ponernos en marcha y empezar a traducir.

source: Actually, open-source software themselves benefit of a rather decent level of translation, thanks to the wonderful gettext tool suite. It is able to extract the strings to translate from the program, present a uniform format to translators, and then use the result of their works at run time to display translated messages to the user.
es: Actualmente, el software libre se beneficia de un nivel decente de traducción, gracias al maravilloso paquete de herramientas gettext. Éste puede extraer las cadenas a traducir de un programa, presentarlas en un formato uniforme a los traductores, y luego usar el resultado de su trabajo durante la ejecución para mostrar los mensajes traducidos al usuario.

source: But the situation is rather different when it comes to documentation. Too often, the translated documentation is not visible enough (not distributed as a part of the program), only partial, or not up to date. This last situation is by far the worst possible one. Outdated translation can reveal worse than no translation at all to the users by describing old program behavior which are not in use anymore.
es: Pero la situación es bastante diferente para la documentación. Demasiado a menudo, la documentación traducida no es suficientemente visible (no se distribuye como parte del programa), sólo lo está parcialmente, o no está actualizada. La última situación es la peor de todas. Para los usuarios, las traducciones anticuadas pueden ser peor que si no existiera la traducción si describen viejos comportamientos del programa que ya no se usan.

source: The problem to solve
es: El problema a solucionar

source: Translating documentation is not very difficult in itself. Texts are far longer than the messages of the program and thus take longer to be achieved, but no technical skill is really needed to do so. The difficult part comes when you have to maintain your work. Detecting which parts did change and need to be updated is very difficult, error-prone and highly unpleasant. I guess that this explains why so much translated documentation out there are outdated.
es: Traducir documentación no es muy difícil por sí solo. Los textos son bastante más largos que los mensajes de programa, y por lo tanto, tardan más en traducirse, pero no se necesitan conocimientos técnicos para hacerlo. La parte difícil llega cuando se debe mantener el trabajo al día. Detectar qué partes han cambiado y se necesitan actualizar es muy difícil, conduce a errores y es bastante desagradable. Creo que ésto explica porqué tantas de las traducciones de documentación que hay por ahí están anticuadas.

source: The po4a answers
es: Las respuestas de po4a

source: So, the whole point of po4a is to make the documentation translation I<maintainable>. The idea is to reuse the gettext methodology to this new field. Like in gettext, texts are extracted from their original locations in order to be presented in a uniform format to the translators. The classical gettext tools help them updating their works when a new release of the original comes out. But to the difference of the classical gettext model, the translations are then re-injected in the structure of the original document so that they can be processed and distributed just like the English version.
es: Por ello, el objetivo de po4a es poder I<mantener> la traducción de documentación al día. La idea es reusar la metodología de gettext en este nuevo campo. Al igual que con gettext, los textos se extraen de su ubicación original para ser presentados en un formato uniforme a los traductores. Las herramientas clásicas de gettext ayudan a actualizar el trabajo cuando aparece una nueva versión del original. Pero a diferencia del modelo clásico de gettext, las traducciones se devuelven a la estructura del documento original de forma que se puedan procesar y distribuir igual que la versión inglesa.

source: Thanks to this, discovering which parts of the document were changed and need an update becomes very easy. Another good point is that the tools will make almost all the work when the structure of the original document gets fundamentally reorganized and when some chapters are moved around, merged or split. By extracting the text to translate from the document structure, it also keeps you away from the text formatting complexity and reduces your chances to get a broken document (even if it does not completely prevent you to do so).
es: Gracias a esto, descubrir qué partes del documento han cambiado y se necesitan actualizar se vuelve muy fácil. Otro punto fuerte es que las herramientas harán prácticamente toda la tarea cuando la estructura del documento original se reorganice y algunos capítulos se reubiquen, junten o separen. Al extraer el texto a traducir de la estructura del documento, también le mantiene lejos de la complejidad del formateo de texto y reduce las oportunidades de dañar el documento (aunque no le prevenga completamente de hacerlo).

source: Please also see the L<FAQ> below in this document for a more complete list of the advantages and disadvantages of this approach.
es: Por favor, lea también las L<Preguntas frecuentes> más abajo en éste documento para una lista más completa de las ventajas y desventajas de este acercamiento al problema.

source: Currently, this approach has been successfully implemented to several kinds of text formatting formats:
es: Actualmente se han implementado satisfactoriamente algunos tipos de formatos de texto:

source: The good old manual pages' format, used by so much programs out there. The po4a support is very welcome here since this format is somewhat difficult to use and not really friendly to the newbies. The L<Locale::Po4a::Man(3pm)|Man> module also supports the mdoc format, used by the BSD man pages (they are also quite common on Linux).
es: El clásico formato de las páginas de manual, usadas por un gran número de programas. La compatibilidad con po4a es bienvenida ya que el formato es algo difícil de usar, y no muy amistoso para los novicios. El módulo L<Locale::Po4a::Man(3pm)|Man> es también compatible con el formato mdoc, empleado en las páginas de manual BSD (bastante comunes en Linux).
