Repository: elric/deb-l10n
Catalog: po4a-pod-*.po
Languages: es

source: This works because the next line matching the beginboundary /^=head1/ after the section "NAME" (translated to "NOM" in French), is the one declaring the authors. So, the addendum will be put between both sections.
es: Esto funciona porque la siguiente linea que encaja con «beginboundary /^=head1/» después de la sección «NOMBRE», es la que declara los autores. Por lo tanto, se colocará el apéndice entre ambas secciones.

source: The use of po4a proved to be a bit error prone for the users since you have to call two different programs in the right order (po4a-updatepo and then po4a-translate), each of them needing more than 3 arguments. Moreover, it was difficult with this system to use only one po file for all your documents when more than one format was used.
es: El uso de po4a ha demostrado que puede dar lugar a errores ya que debe llamar a dos programas distinto en el orden adecuado (po4a-updatepo y luego po4a-translate), y cada uno necesita más de 3 argumentos. Además, era difícil con este sistema usar sólo un fichero po para todos los documentos cuando se usaba más de un formato.

source: The L<po4a(1)> program was designed to solve those difficulties. Once your project is converted to the system, you write a simple configuration file explaining where your translation files are (po and pot), where the original documents are, their formats and where their translations should be placed.
es: El programa L<po4a(1)> se diseñó para solucionar esas dificultades. Una vez que haya convertido su proyecto a este sistema, puede escribir un sencillo fichero de configuración explicando dónde están los ficheros de traducción (po y pot), dónde están los documentos originales, sus formatos y dónde se deberían guardar las traducciones.

source: Then, calling po4a(1) on this file ensure that the po files are synchronized against the original document, and that the translated document are generated properly. Of course, you will want to call this program twice: once before editing the po file to update them and once afterward to get completely updated translated document. But you only need to remember one command line.
es: Luego, una simple invocación a po4a(1) con este fichero como argumento asegura que los ficheros po se sincronicen con el documento original, y que los documentos traducidos se generan correctamente. Por supuesto, le interesará invocar este programa dos veces: una antes de editar el fichero po para actualizarlo, y otra para obtener los documentos traducidos totalmente actualizados. Pero sólo necesita recordar una orden.

source: po4a modules have options (specified with the -o option) that can be used to change the module behavior.
es: Los módulos de po4a tienen opciones (especificados con la opción «-o»), que se pueden usar para modificar el comportamiento del módulo.

source: It is also possible to customize a module or new / derivative / modified modules by putting a module in F<lib/Locale/Po4a/>, and adding F<lib> to the paths specified by the PERLLIB or PERL5LIB environment. For example:
es: También es posible configurar un módulo o módulos nuevos, derivados o modificados mediante la inserción de un módulo en F<lib/Locale/Po4a/>, y añadiendo F<lib> a las rutas especificadas en los entornos PERLLIB o PERL5LIB. Por ejemplo:

source: Note: the actual name of the lib directory is not important.
es: Nota: el nombre real del directorio «/lib» no es importante.

source: How does it work?
es: ¿Cómo funciona?

source: What's the big picture here?
es: Visión general

source: The po4a architecture is object oriented (in Perl. Isn't that neat?). The common ancestor to all parser classes is called TransTractor. This strange name comes from the fact that it is at the same time in charge of translating document and extracting strings.
es: La arquitectura de po4a está orientada a objetos (en Perl. Muy pulcro, ¿no?). El antecesor de todas las clases de analizadores se llama TransTractor. Este extraño nombre viene del hecho de que se encarga al mismo tiempo de traducir el documento («translate») y de extraer las cadenas («extract»).

source: More formally, it takes a document to translate plus a po file containing the translations to use as input while producing two separate outputs: Another po file (resulting of the extraction of translatable strings from the input document), and a translated document (with the same structure than the input one, but with all translatable strings replaced with content of the input po). Here is a graphical representation of this:
es: Más formalmente, toma un documento a traducir además del fichero po que contiene las traducciones a usar como entrada mientras produce dos salidas separadas: Otro fichero po (resultado de la extracción de las cadenas traducibles del documento de entrada), y un documento traducido (con la misma estructura que el de entrada, pero con las cadenas traducibles reemplazadas por el contenido del po de entrada). Esta es una representación de gráfica este proceso:

source: Input document --\ /---> Output document \ TransTractor:: / (translated) +-->-- parse() --------+ / \ Input po --------/ \---> Output po (extracted)
es: Documento de entrada -\ /---> Documento de salida \ TransTractor:: / (traducido) +-->-- parse() ------+ / \ po de entrada --------/ \---> po de salida (extraído)

source: This little bone is the core of all the po4a architecture. If you omit the input po and the output document, you get po4a-gettextize. If you provide both input and disregard the output po, you get po4a-translate.
es: Esta pequeño hueso es el núcleo de toda la arquitectura de po4a. Si omite el po de entrada y el documento de salida, obtiene po4a-gettextize. Si proporciona ambas entradas y descarta el po de salida, obtiene po4a-translate.

source: TransTractor::parse() is a virtual function implemented by each module. Here is a little example to show you how it works. It parses a list of paragraphs, each of them beginning with <p>.
es: TransTractor::parse() es una función virtual integrada en cada módulo. Aquí hay un pequeño ejemplo que muestra cómo funciona. Analiza una lista de párrafos, cada uno empezando con <p>

source: 1 sub parse { 2 PARAGRAPH: while (1) { 3 $my ($paragraph,$pararef,$line,$lref)=("","","",""); 4 $my $first=1; 5 while (($line,$lref)=$document->shiftline() && defined($line)) { 6 if ($line =~ m/<p>/ && !$first--; ) { 7 $document->unshiftline($line,$lref); 8 9 $paragraph =~ s/^<p>//s; 10 $document->pushline("<p>".$document->translate($paragraph,$pararef)); 11 12 next PARAGRAPH; 13 } else { 14 $paragraph .= $line; 15 $pararef = $lref unless(length($pararef)); 16 } 17 } 18 return; # Did not got a defined line? End of input file. 19 } 20 }
es: 1 sub parse { 2 PARAGRAPH: while (1) { 3 $my ($paragraph,$pararef,$line,$lref)=("","","",""); 4 $my $first=1; 5 while (($line,$lref)=$document->shiftline() && defined($line)) { 6 if ($line =~ m/<p>/ && !$first--; ) { 7 $document->unshiftline($line,$lref); 8 9 $paragraph =~ s/^<p>//s; 10 $document->pushline("<p>".$document->translate($paragraph,$pararef)); 11 12 next PARAGRAPH; 13 } else { 14 $paragraph .= $line; 15 $pararef = $lref unless(length($pararef)); 16 } 17 } 18 return; # ¿No obtuvo una línea definida? Fin del fichero de entrada. 19 } 20 }

source: On line 6, we encounter E<lt>pE<gt> for the second time. That's the signal of the next paragraph. We should thus put the just obtained line back into the original document (line 7) and push the paragraph built so far into the outputs. After removing the leading E<lt>pE<gt> of it on line 9, we push the concatenation of this tag with the translation of the rest of the paragraph.
es: En la línea 6, encontramos E<lt>pE<gt> por segunda vez. Esta es la señal de que hemos encontrado el siguiente párrafo. Debemos entonces devolver la línea obtenida de vuelta al documento (línea 7) y enviar el párrafo construido hasta el momento a las salidas. Después de eliminar el E<lt>pE<gt> inicial en la línea 9, insertamos la concatenación de esta etiqueta junto con la traducción del resto del párrafo.

source: This translate() function is very cool. It pushes its argument into the output po file (extraction) and returns its translation as found in the input po file (translation). Since it's used as part of the argument of pushline(), this translation lands into the output document.
es: La función «translate()» está muy bien. Envía su argumento al fichero po de salida (extracción) y devuelve su traducción tal y como es en el fichero po de entrada (traducción). Ya que se usa como parte del argumento de «pushline()», esta traducción acaba en el documento de salida.

source: Isn't that cool? It is possible to build a complete po4a module in less than 20 lines when the format is simple enough...
es: ¿Como mola, no? Es posible construir un módulo completo de po4a en menos de 20 líneas si el formato es suficientemente simple...

source: You can learn more about this in L<Locale::Po4a::TransTractor(3pm)|Locale::Po4a::TransTractor(3pm)>.
es: Encontrará más acerca de esto en L<Locale::Po4a::TransTractor(3pm)|Locale::Po4a::TransTractor(3pm)>.

source: Gettextization: how does it work?
es: Gettextización: ¿Cómo funciona?

source: The idea here is to take the original document and its translation, and to say that the Nth extracted string from the translation is the translation of the Nth extracted string from the original. In order to work, both files must share exactly the same structure. For example, if the files have the following structure, it is very unlikely that the 4th string in translation (of type 'chapter') is the translation of the 4th string in original (of type 'paragraph').
es: La idea aquí es tomar el documento original y su traducción, y considerar que la enésima cadena extraída de la traducción es la traducción de la enésima cadena extraída del original. Para que funcione, ambos ficheros deben compartir exactamente la misma estructura. Por ejemplo, si los ficheros tienen la siguiente estructura, es muy poco probable que la cuarta cadena de la traducción (de tipo 'capítulo') sea la traducción de la cuarta cadena del original (de tipo 'párrafo').

source: Original Translation
es: Original Traducción

source: chapter chapter paragraph paragraph paragraph paragraph paragraph chapter chapter paragraph paragraph paragraph
es: capítulo capítulo párrafo párrafo párrafo párrafo párrafo capítulo capítulo párrafo párrafo párrafo

source: For that, po4a parsers are used on both the original and the translation files to extract po files, and then a third po file is built from them taking strings from the second as translation of strings from the first. In order to check that the strings we put together are actually the translations of each other, document parsers in po4a should put information about the syntactical type of extracted strings in the document (all existing ones do so, yours should also). Then, this information is used to make sure that both documents have the same syntax. In the previous example, it would allow us to detect that string 4 is a paragraph in one case, and a chapter title in another case and to report the problem.
es: Para ello, los analizadores de po4a se utilizan tanto con el fichero original como con el traducido para extraer los ficheros po, y luego se construye un tercer fichero po a partir de ellos tomando las cadenas del segundo como traducciones de las del primero. Para comprobar que las cadenas que juntamos se correspondan, los analizadores de documentos de po4a deben dar información sobre el tipo sintáctico de las cadenas extraídas en el documento (todos los que hay lo hacen, el suyo también lo debería hacer). Esa información se utiliza después para asegurar que ambos documentos tienen la misma sintaxis. En el ejemplo anterior, nos permitiría detectar que la cuarta cadena es un párrafo en un caso, y el título de un capítulo en el otro e informar del problema.

source: In theory, it would be possible to detect the problem, and resynchronize the files afterward (just like diff does). But what we should do of the few strings before desynchronizations is not clear, and it would produce bad results some times. That's why the current implementation don't try to resynchronize anything and verbosely fail when something goes wrong, requiring manual modification of files to fix the problem.
es: En teoría, sería posible detectar el problema, y resincronizar los ficheros posteriormente (al igual que diff). Pero no está claro qué deberíamos hacer con las cadenas antes de las asincronías, y a veces podría producir malos resultados. Es por ello que la implementación actual no intenta resincronizar nada, e informa extensamente del fallo cuando algo va mal, requiriendo la modificación manual de los ficheros para arreglar el problema.

source: Even with these precautions, things can go wrong very easily here. That's why all translations guessed this way are marked fuzzy to make sure that the translator review and check them.
es: Incluso con estas precauciones, las cosas se pueden estropear muy fácilmente. Es por ello que todas las traducciones encontradas así se marcan como borrosas, para asegurar que el traductor las repase y corrija.

source: Addendum: How does it work?
es: Apéndice («Addendum»): ¿Cómo funciona?

source: Well, that's pretty easy here. The translated document is not written directly to disk, but kept in memory until all the addenda are applied. The algorithms involved here are rather straightforward. We look for a line matching the position regexp, and insert the addendum before it if we're in mode=before. If not, we search for the next line matching the boundary and insert the addendum after this line if it's an C<endboundary> or before this line if it's a C<beginboundary>.
es: Bueno, esto es muy simple. El documento traducido no se escribe directamente al disco, sino que se mantiene en memoria hasta que se insertan todos los apéndices. Los algoritmos involucrados son más bien sencillos. Buscamos una línea que encaje con la expresión regular de la ubicación, e insertamos el apéndice antes del mismo si estamos en mode=before. De no ser así, buscamos la siguiente linea que encaje con el «boundary» (límite) e insertamos el apéndice a continuación de esta línea si es un C<endboundary> o antes de esta línea si es un C<beginboundary>.

source: FAQ
es: Preguntas frecuentes

source: Why to translate each paragraph separately?
es: ¿Porqué traducir cada párrafo por separado?

source: Yes, in po4a, each paragraph is translated separately (in fact, each module decides this, but all existing modules do so, and yours should also). There are two main advantages to this approach:
es: Sí, en po4a, cada párrafo se traduce por separado (de hecho, cada módulo lo decide, pero todos los existentes lo hacen, y el suyo también debería hacerlo). Hay dos ventajas principales al hacerlo así:

source: When the technical parts of the document are hidden from the scene, the translator can't mess with them. The fewer markers we present to the translator the less error he can do.
es: Cuando se ocultan las partes técnicas del documento, el traductor no puede alterarlas. Cuantas menos marcas presentemos al traductor, menos errores podrá hacer.

source: Cutting the document helps in isolating the changes to the original document. When the original is modified, finding what parts of the translation need to be updated is eased by this process.
es: El hecho de cortar el documento ayuda a aislar los cambios en el documento original. Este proceso facilita encontrar qué partes de la traducción se necesitan actualizar cuando se modifica el documento original.

source: Even with these advantages, some people don't like the idea of translating each paragraph separately. Here are some of the answers I can give to their fear:
es: Incluso con estas ventajas, a algunas personas no les gusta la idea de traducir cada párrafo por separado. Aquí hay algunas respuestas que les puedo dar:

source: This approach proved successfully in the KDE project and allows people there to produce the biggest corpus of translated and up to date documentation I know.
es: Este enfoque ha demostrado resultados satisfactorios en el proyecto KDE y permite a sus miembros producir la cantidad más grande de documentación traducida y actualizada que conozco.

source: The translators can still use the context to translate, since the strings in the po file are in the same order than in the original document. Translating sequentially is thus rather comparable whether you use po4a or not. And in any case, the best way to get the context remains to convert the document to a printable format since the text formatting ones are not really readable, IMHO.
es: Los traductores pueden seguir usando el contexto para traducir, ya que las cadenas del fichero po están en el mismo orden que las del documento original. Por ello, traducir secuencialmente es comparable, use o no po4a. Y en cualquier caso, la mejor forma de obtener el contexto sigue siendo convertir el documento a un formato imprimible, ya que los textos formateados son, en mi opinión, ilegibles.

source: This approach is the one used by professional translators. I agree, that they have somewhat different goals than open-source translators. The maintenance is for example often less critical to them since the content changes rarely.
es: Este enfoque es el que usan los traductores profesionales. Estoy de acuerdo en que ellos tienen diferentes objetivos que los traductores de código abierto. Por ejemplo, la actualización es a menudo menos importante para ellos, ya que el contenido cambia muy poco.

source: Why not to split on sentence level (or smaller)?
es: ¿Porqué no realizar las divisiones a nivel de oración (o más pequeñas)?

source: Professional translator tools sometimes split the document at the sentence level in order to maximize the reusability of previous translations and speed up their process. The problem is that the same sentence may have several translations, depending on the context.
es: A veces las herramientas de traducción profesionales dividen los documentos a nivel de frases para maximizar la reusabilidad de las traducciones previas, y acelerar el proceso. El problema es que la misma frase puede tener varias traducciones, dependiendo del contexto.

source: Paragraphs are by definition longer than sentences. It will hopefully ensure that having the same paragraph in two documents will have the same meaning (and translation), regardless of the context in each case.
es: Los párrafos son por definición más largos que las frases. Con un poco de suerte se puede asegurar que si se tiene el mismo párrafo en dos documentos, tendrán el mismo significado (y traducción), sin importar el contexto en cada caso.

source: Splitting on smaller parts than the sentence would be B<very bad>. It would be a bit long to explain why here, but interested reader can refer to the L<Locale::Maketext::TPJ13(3pm)|Locale::Maketext::TPJ13(3pm)> man page (which comes with the Perl documentation), for example. To make short, each language has its specific syntactic rules, and there is no way to build sentences by aggregating parts of sentences working for all existing languages (or even for the 5 of the 10 most spoken ones, or even less).
es: Dividirlo en partes más pequeñas que frases sería B<muy malo>. Podría tomar mucho tiempo explicar el motivo aquí, pero si le interesa puede consultar la página de manual de L<Locale::Maketext::TPJ13(3pm)|Locale::Maketext::TPJ13(3pm)> (que viene con la documentación de Perl), por ejemplo. Brevemente, cada idioma tiene sus reglas de sintaxis específicas, y no hay forma de construir frases encajando partes de frases para todos los idiomas existentes (incluso para 5 de los 10 idiomas más hablados, o incluso menos).

source: Why not put the original as comment along with translation (or other way)?
es: ¿Porqué no se pone el original como comentario junto con la traducción (o de otra forma)?

source: At the first glance, gettext don't seem to be adapted to all kind of translations. For example, it didn't seemed adapted to debconf, the interface all Debian packages use for their interaction with the user during installation. In that case, the texts to translate were pretty short (a dozen of line for each package), and it was difficult to put the translation in a specialized file since it has to be available before the package installation.
es: A simple vista, gettext no parece estar adaptado a todos los tipos de traducciones. Por ejemplo, no parecía adaptado a debconf, la interfaz que usan todos los paquetes de Debian para sus interacciones con el usuario durante la instalación. En ese caso, los textos a traducir eran muy cortos (una docena de lineas para cada paquete), y era muy difícil poner la traducción en un fichero específico ya que tiene que estar disponible antes de la instalación del paquete.

source: That's why the debconf developer decided to implement another solution, where translations are be placed in the same file than the original. This is rather appealing. One would even want to do this for xml, for example. It would look like that:
es: Es por ello que los desarrolladores de debconf decidieron implementar otra solución, donde las traducciones se situasen en el mismo fichero que el original. Esto es bastante atractivo. Uno podría incluso desear hacerlo en xml, por ejemplo. Tendría esta aspecto:

source: <section> <title lang="en">My title</title> <title lang="fr">Mon titre</title>
es: <section> <title lang="en">My title</title> <title lang="es">Mi título</title>

source: <para> <text lang="en">My text.</text> <text lang="fr">Mon texte.</text> </para> </section>
es: <para> <text lang="en">My text.</text> <text lang="es">Mi texto.</text> </para> </section>

source: But it was so problematic that a po-based approach is now used. Only the original can be edited in the file, and the translations must take place in po files extracted from the master template (and placed back at package compilation time). The old system was deprecated because of several issues:
es: Pero fue tan problemático que se terminó usando una implementación basada en po. En el fichero, solo se puede editar el original, y las traducciones se deben hacer en los ficheros po extraídos de la plantilla original (y devueltos al paquete en tiempo de compilación). El sistema antiguo se consideró obsoleto debido a varios problemas:

source: * maintenance problems
es: * problemas de mantenimiento

source: If several translators provide a patch at the same time, it gets hard to merge them together.
es: Si varios traductores envían un parche a la vez, fusionarlos es difícil.

source: How will you detect changes to the original, which need to be applied to the translations? In order to use diff, you have to note which version of the original you translated. I.e., you need a po file in your file ;)
es: ¿Como detectará los cambios en el original que se deban aplicar a las traducciones? Para poder usar diff, se debe tener en cuenta qué versión del original se tradujo. Es decir, necesita un fichero po en su fichero ;)

source: * encoding problems
es: * problemas de codificación

source: This solution is viable when only European languages are involved, but the introduction of Korean, Russian and/or Arab really complicate the picture. UTF could be a solution, but there are still some problems with it.
es: La solución es viable cuando sólo se utilizan idiomas europeos, pero la introducción del Coreano, Ruso y/o Árabe realmente complica el asunto. La solución sería UTF, pero aún hay algunos problemas con él.
