Repository: elric/deb-l10n
Catalog: po4a-pod-*.po
Languages: es

source: This is the Perl Online Documentation format. The language and extensions themselves are documented that way, as well as most of the existing Perl scripts. It makes easy to keep the documentation close to the actual code by embedding them both in the same file. It makes programmer life easier, but unfortunately, not the translator one.
es: Este es el formato de «Perl Online Documentation» (Documentación en línea de Perl). El lenguaje y sus mismas extensiones están documentados así, igual que la mayoría de scripts de Perl. Hace muy fácil mantener la documentación cerca del código al integrarlos en el mismo fichero. Facilita la vida del programador, pero por desgracia, no la del traductor.

source: Even if somewhat superseded by XML nowadays, this format is still used rather often for documents which are more than a few screens long. It allows you to make complete books. Updating the translation of so long documents can reveal to be a real nightmare. diff reveals often useless when the original text was re-indented after update. Fortunately, po4a can help you in that process.
es: Aunque hoy en día Xml prácticamente lo haya sustituido, este formato aún se usa habitualmente para documentos más extensos que algunas pantallas, y le permite hacer libros completos. Actualizar una traducción de documentos tan largos puede ser realmente un infierno. A menudo diff se vuelve inútil cuando se ha reindentado el texto original después de la actualización. Afortunadamente, po4a le puede ayudar en ese proceso.

source: Currently, only the debiandoc and docbook DTD are supported, but adding support to a new one is really easy. It is even possible to use po4a on an unknown sgml dtd without changing the code by providing the needed information on the command line. See L<Locale::Po4a::Sgml(3pm)> for details.
es: Actualmente, sólo son compatibles los DTD de debiandoc y de docbook, pero añadir compatibilidad con uno nuevo es realmente fácil. Incluso es posible usar po4a en un dtd desconocido de sgml sin cambiar el código, introduciendo la información necesaria en la línea de órdenes. Véase L<Locale::Po4a::Sgml(3pm)> para más detalles.

source: The LaTeX format is a major documentation format used in the Free Software world and for publications. The L<Locale::Po4a::LaTeX(3pm)|LaTeX> module was tested with the Python documentation, a book and some presentations.
es: El formato LaTeX es un formato de documentación usado principalmente en el mundo del Software Libre y para publicaciones. Se probó el módulo L<Locale::Po4a::LaTeX(3pm)|LaTeX> con la documentación de Python, un libro y algunas presentaciones.

source: All the GNU documentation is written in this format (that's even one of the requirement to become an official GNU project). The support for L<Locale::Po4a::Texinfo(3pm)|Texinfo> in po4a is still at the beginning. Please report bugs and feature requests.
es: Toda la documentación de GNU está escrita en este formato (es incluso un requisito para ser un proyecto oficial de GNU). La compatibilidad de L<Locale::Po4a::Texinfo(3pm)|Texinfo> en po4a está en sus albores. Por favor, remita informes de fallo y peticiones de funcionalidades.

source: The XML format is a base format for many documentation formats.
es: El formato XML sirve de base para muchos formatos de documentación.

source: Currently, the docbook DTD is supported by po4a. See L<Locale::Po4a::Docbook(3pm)> for details.
es: Actualmente, el formato DTD de docbook es compatible con po4a. Para más detalles, véase L<Locale::Po4a::Docbook(3pm)>.

source: others
es: otros

source: Po4a can also handle some more rare or specialized formats, such as the documentation of compilation options for the 2.4.x kernels or the diagrams produced by the dia tool. Adding a new one is often very easy and the main task is to come up with a parser of your target format. See L<Locale::Po4a::TransTractor(3pm)> for more information about this.
es: po4a también puede tratar algunos formatos raros o específicos, tales como la documentación de las opciones de compilación del kernel 2.4.x o los diagramas producidos por la herramienta dia. Añadir uno nuevo es a menudo una tarea muy sencilla, y la tarea principal es conseguir un analizador para el formato escogido. Consulte L<Locale::Po4a::TransTractor(3pm)> para más información.

source: Unsupported formats
es: Formatos no compatibles

source: Unfortunately, po4a still lacks support for several documentation formats.
es: Desafortunadamente, po4a no es compatible con varios formatos de documentación.

source: There is a whole bunch of other formats we would like to support in po4a, and not only documentation ones. Indeed, we aim at plugging all "market holes" left by the classical gettext tools. It encompass package descriptions (deb and rpm), package installation scripts questions, package changelogs, and all specialized file formats used by the programs such as game scenarios or wine resource files.
es: Nos gustaría añadir la compatibilidad de po4a con un grupo de otros formatos, y no sólo de documentación. De hecho, queremos cubrir todos los «vacíos del mercado» dejados por las herramientas clásicas de gettext. Esto incluye descripciones de paquetes (deb y rpm), preguntas de los scripts de instalación de paquetes, el registro de cambios de los paquetes, y todos los formatos específicos usados por programas tales como escenarios de juegos o los ficheros de recursos de wine.

source: How to use po4a?
es: ¿Cómo usar po4a?

source: Graphical overview
es: Visión esquemática

source: The following schema gives an overview of the process of translating documentation using po4a. Do not be afraid by its apparent complexity, it comes from the fact that the I<whole> process is represented here. Once you converted your project to po4a, only the right part of the graphic is relevant.
es: El siguiente esquema ofrece una visión global del proceso de traducción de documentación usando po4a. No se asuste por su aparente complejidad, ello se debe a que aquí se representa el proceso I<completo>. Una vez que haya convertido su proyecto a po4a sólo será relevante la parte derecha del gráfico.

source: Note that "master.doc" is taken as an example for the documentation to be translated and "translation.doc" is the corresponding translated text. The suffix could be ".pod", ".xml", or ".sgml" depending on its format. Each part of the picture will be detailed in the next sections.
es: Observe que «original.doc» se toma como un ejemplo de la documentación a traducir, y que «traducción.doc» es el texto traducido correspondiente. La extensión podría ser «.pod, «.xml» o «.sgml» dependiendo del formato. Cada parte del dibujo se explicará con detalle en las siguientes secciones.

source: master.doc | V +<-----<----+<-----<-----<--------+------->-------->-------+ : | | : {translation} | { update of master.doc } : : | | : XX.doc | V V (optional) | master.doc ->-------->------>+ : | (new) | V V | | [po4a-gettextize] doc.XX.po--->+ | | | (old) | | | | ^ V V | | | [po4a-updatepo] | V | | V translation.pot ^ V | | | doc.XX.po | | | (fuzzy) | { translation } | | | | ^ V V | | {manual editing} | | | | | V | V V doc.XX.po --->---->+<---<---- doc.XX.po addendum master.doc (initial) (up-to-date) (optional) (up-to-date) : | | | : V | | +----->----->----->------> + | | | | | V V V +------>-----+------<------+ | V [po4a-translate] | V XX.doc (up-to-date)
es: original.doc | V +<-----<----+<-----<-----<--------+------->-------->-------+ : | | : {traducción} | { actualización de original.doc } : : | | : XX.doc | V V (opcional) | original.doc ->------->----->+ : | (new) | V V | | [po4a-gettextize] doc.XX.po--->+ | | | (antiguo) | | | | ^ V V | | | [po4a-updatepo] | V | | V traducción.pot ^ V | | | doc.XX.po | | | («fuzzy» (borrosa)) | { traducción } | | | | ^ V V | | {edición manual} | | | | | V | V V doc.XX.po --->---->+<---<---- doc.XX.po apéndice original.doc (inicial) (actualizado) (opcional) (actualizado) : | | | : V | | +----->----->----->------> + | | | | | V V V +------>-----+------<------+ | V [po4a-translate] | V XX.doc (actualizado)

source: On the left part, the conversion of a translation not using po4a to this system is shown. On the top of the right part, the action of the original author is depicted (updating the documentation). The middle of the right part is where the automatic actions of po4a are depicted. The new material are extracted, and compared against the exiting translation. Parts which didn't change are found, and previous translation is used. Parts which where partially modified are also connected to the previous translation, but with a specific marker indicating that the translation must be updated. The bottom of the figure shows how a formatted document is built.
es: En la parte izquierda se muestra la conversión de una traducción que no usa po4a a este sistema. En la parte superior derecha se representa la acción del autor original (actualizar la documentación). En la parte central derecha se simbolizan las acciones automáticas de po4a. Se extrae el nuevo material, y se compara con la traducción existente. Se encuentran las partes que no han cambiado, y se usa la traducción previa. Las partes parcialmente modificadas también se conectan con la traducción anterior, pero se añade un marcador indicando que la traducción se debe actualizar. La parte inferior de la figura muestra como se construye el documento formateado.

source: Actually, as a translator, the only manual operation you have to do is the part marked {manual editing}. Yeah, I'm sorry, but po4a helps you translate. It does not translate anything for you...
es: En realidad, como traductor, la única operación manual que debe hacer es la parte marcada como {edición manual}. Sí, lo siento, pero po4a le ayuda a traducir. No traduce nada por si solo...

source: This section presents the needed steps required to begin a new translation with po4a. The refinements involved in converting an existing project to this system are detailed in the relevant section.
es: Esta sección presenta los pasos necesarios para iniciar una nueva traducción con po4a. Los refinamientos involucrados en la conversión de un proyecto existente a este sistema se detallan en la sección pertinente.

source: To begin a new translation using po4a, you have to do the following steps:
es: Para iniciar una nueva traducción utilizando po4a, debe seguir los siguientes pasos:

source: Extract the text which have to be translated from the original E<lt>master.docE<gt> document into a new translation template E<lt>translation.potE<gt> file (the gettext format). For that, use the I<po4a-gettextize> program this way:
es: Extracción del texto que se tiene que traducir del documento E<lt>original.docE<gt> a una nueva plantilla de traducción E<lt>traducción.potE<gt> (el formato de gettext). Para ello, use el programa I<po4a-gettextize> de la siguiente manera:

source: $ po4a-gettextize -f <format> -m <master.doc> -p <translation.pot>
es: $ po4a-gettextize -f <formato> -m <original.doc> -p <traducción.pot>

source: E<lt>formatE<gt> is naturally the format used in the master.doc document. As expected, the output goes into translation.pot. Please refer to L<po4a-gettextize(1)> for more details about the existing options.
es: Naturalmente, E<lt>formatoE<gt> es el formato usado en el documento «original.doc». Tal como es de esperar, la salida va a «traducción.pot». Consulte L<po4a-gettextize(1)> para más detalles sobre las opciones existentes.

source: Actually translate what should be translated. For that, you have to rename the pot file for example to doc.XX.po (where XX is the ISO639 code of the language you are translating to, e.g. "fr" for French), and edit the resulting file. It is often a good idea to not name the file XX.po to avoid confusion with the translation of the program messages, but this your call. Don't forget to update the po file headers, they are important.
es: Ahora toca traducir lo que se debe traducir. Para ello, debe renombrar el fichero pot a «doc.XX.po», por ejemplo (donde XX es el código ISO639 del idioma al que esté traduciendo, por ejemplo «fr» para el francés), y edite el fichero resultante. A menudo es una buena idea no llamar al fichero «XX.po» para evitar confusiones con la traducción de los mensajes de programa, pero esto depende de usted. No se olvide de actualizar las cabeceras de los ficheros po, son importantes.

source: The actual translation can be done using the Emacs po mode or kbabel (KDE based) or gtranslator (GNOME based), or whichever program you prefer to use them. A good ol' vi could do the trick too, even if there is no specialized mode for this task.
es: La traducción en sí misma se puede hacer con el modo po de Emacs o kbabel (basado en KDE) o gtranslator (basado en GNOME), o cualquier programa que prefiera. Incluso el clásico vi puede bastar, aunque no tenga un modo especializado para esta tarea.

source: If you wish to learn more about this, you definitively need to refer to the gettext documentation, available in the B<gettext-doc> package.
es: Si desea aprender más, definitivamente necesita consultar la documentación de gettext, disponible en el paquete B<gettext-doc>.

source: Once you're done with the translation, you want to get the translated documentation and distribute it to users along with the original one. For that, use the L<po4a-translate(1)> program like that (where XX is the language code):
es: Una vez que haya terminado la traducción, querrá obtener la documentación traducida para distribuirla a los usuarios junto con el original. Para ello, utilice el programa L<po4a-translate(1)> de la siguiente manera («XX» es el código del idioma):

source: $ po4a-translate -f <format> -m <master.doc> -p <doc.XX.po> -l <XX.doc>
es: $ po4a-translate -f <formato> -m <original.doc> -p <doc-XX.po> -l <XX.doc>

source: As before, E<lt>formatE<gt> is the format used in the master.doc document. But this time, the po file provided with the -p flag is part of the input. This is your translation. The output goes into XX.doc.
es: Al igual que antes, E<lt>formatoE<gt> es el formato usado en el documento «original.doc». Pero esta vez, el fichero po introducido con el parámetro «-p» es parte de la entrada. Ésta es su traducción. La salida va a «XX.doc».

source: Please refer to L<po4a-translate(1)> for more details.
es: Consulte L<po4a-translate(1)> para más detalles.

source: To update your translation when the original master.doc file has changed, use the L<po4a-updatepo(1)> program like that:
es: Para actualizar su traducción cuando el fichero de origen «original.doc» cambie, use el programa L<po4a-updatepo(1)> de la siguiente manera:

source: $ po4a-updatepo -f <format> -m <new_master.doc> -p <old_doc.XX.po>
es: $ po4a-updatepo -f <formato> -m <nuevo_original.doc> -p <doc_antiguo.XX.po>

source: (Please refer to L<po4a-updatepo(1)> for more details)
es: Consulte L<po4a-updatepo(1)> para más detalles.

source: Naturally, the new paragraph in the document won't get magically translated in the C<po> file with this operation, and you'll need to update the C<po> file manually. Likewise, you may have to rework the translation for paragraphs which were modified a bit. To make sure you won't miss any of them, they are marked as "fuzzy" during the process and you have to remove this marker before the translation can be used by po4a-translate. As for the initial translation, the best is to use your favorite po editor here.
es: Naturalmente, los nuevos párrafos del documento no se traducirán mágicamente en el fichero C<po> con esta operación, y necesitará actualizar el fichero C<po> manualmente. Así mismo, puede que tenga que rehacer las traducciones de los párrafos que se hayan modificado un poco. Para asegurar que no pasará ninguna por alto, se marcan como «fuzzy» (borrosas) durante el proceso, y deberá quitar esta marca manualmente antes de que pueda usar la traducción con po4a-translate. Igual que para la traducción inicial, aquí lo mejor es usar su editor po favorito.

source: Once your C<po> file is up-to-date again, without any untranslated or fuzzy string left, you can generate a translated documentation file, as explained in the previous section.
es: Una vez su fichero C<po> esté otra vez actualizado, sin ninguna cadena por traducir ni cadenas difusas, puede generar el fichero de documentación traducido, tal y como se explicó en la sección anterior.

source: Often, you used to translate manually the document happily until a major reorganization of the original master.doc document happened. Then, after some unpleasant tries with diff or similar tools, you want to convert to po4a. But of course, you don't want to loose your existing translation in the process. Don't worry, this case is also handled by po4a tools and is called gettextization.
es: Seguramente, usted acostumbraba a traducir manualmente el documento felizmente hasta que llegó una reorganización del documento de origen «original.doc». Entonces, después de algunos intentos fracasados con diff o herramientas similares, desea pasarse a po4a. Pero, por supuesto, no quiere perder su traducción en el proceso. No se preocupe, las herramientas de po4a también tienen en cuenta este caso, se llama «gettextización».

source: The key here is to have the same structure in the translated document and in the original one so that the tools can match the content accordingly.
es: La condición más importante es que tanto el documento traducido como el original tengan la misma estructura de manera que las herramientas puedan encajar los contenidos correctamente.

source: If you are lucky (i.e., if the structures of both documents perfectly match), it will work seamlessly and you will be set in a few seconds. Otherwise, you may understand why this process has such an ugly name, and you'd better be prepared to some grunt work here. In any case, remember that it is the price to pay to get the comfort of po4a afterward. And the good point is that you have to do so only once.
es: Si está de suerte (es decir, si las estructuras de ambos documentos encajan a la perfección), todo funcionará a la perfección y habrá terminado en unos segundos. En caso contrario, deberá entender porqué este proceso tiene un nombre tan feo, y debería estar preparado para un poco de sucia faena. En cualquier caso, recuerde que éste es el precio a pagar para conseguir luego la comodidad de po4a. Y la mejor parte es que sólo deberá hacer esto una vez.

source: I cannot emphasis this too much. In order to ease the process, it is thus important that you find the exact version which were used to do the translation. The best situation is when you noted down the cvs revision used for the translation and you didn't modify it in the translation process, so that you can use it.
es: No puedo enfatizarlo más. Para facilitar el proceso, es importante encontrar la versión exacta que se usó para la traducción. La mejor situación se da cuando anotó qué revisión del cvs se usó para la traducción y que no se modificó durante el proceso de traducción, de forma que pueda usarla.

source: It won't work well when you use the updated original text with the old translation. It remains possible, but is harder and really should be avoided if possible. In fact, I guess that if you fail to find the original text again, the best solution is to find someone to do the gettextization for you (but, please, not me ;).
es: No funcionará bien si usa el texto original actualizado con una traducción vieja. Es un proceso posible, pero más difícil y en realidad se debe evitar en la medida que sea posible. De hecho, imagino que si no consigue encontrar el texto original otra vez, la mejor solución es encontrar a alguien que haga la gettextización por usted (pero por favor, que no sea yo ;).

source: Maybe I'm too dramatic here. Even when things go wrong, it remains ways faster than translating everything again. I was able to gettextize the existing French translation of the Perl documentation in one day, even if things B<did> went wrong. That was more than two megabytes of text, and a new translation would have lasted months or more.
es: Quizá esté siendo demasiado dramático en este punto. Aunque las cosas vayan mal, sigue siendo mucho más rápido que traducirlo todo otra vez. Yo hice la gettextización de la traducción al francés existente de la documentación de Perl en un día, a pesar de que las cosas fueron B<mal>. Eran más de dos megabytes de texto, y una traducción nueva hubiera podido durar como mínimo meses.

source: Let me explain the basis of the procedure first and I will come back on hints to achieve it when the process goes wrong. To ease comprehension, let's use above example once again.
es: Permítame explicar primero las bases del proceso, y luego ya volveremos a los indicaciones para conseguirlo cuando el proceso vaya mal. Para facilitar la comprensión, usaremos el ejemplo anterior una vez más:

source: Once you have the old master.doc again which matches with the translation XX.doc, the gettextization can be done directly to the po file doc.XX.po without manual translation of translation.pot file:
es: Una vez que tiene el anticuado «original.doc», que encaja con el «XX.doc» traducido, puede ejecutar la gettextización directamente sobre el fichero po «doc.XX.po» sin realizar una traducción manual del fichero «traducción.pot»:

source: $ po4a-gettextize -f <format> -m <old_master.doc> -l <XX.doc> -p <doc.XX.po>
es: $ po4a-gettextize -f <formato> -m <orignal_anticuado.doc> -l <XX.doc> -p <doc.XX.po>

source: When you're lucky, that's it. You converted your old translation to po4a and can begin with the updating task right away. Just follow the procedure explained a few section ago to synchronize your po file with the newest original document, and update the translation accordingly.
es: Si está de suerte, eso es todo. Ha convertido su vieja traducción a po4a y ya puede iniciar la tarea de actualización en el momento. Simplemente siga el proceso explicado unas secciones antes para sincronizar su fichero po con el documento original más reciente, y actualizar la traducción de acuerdo al mismo.

source: Please note that even when things seem to work properly, there is still room for errors in this process. The point is that po4a is unable to understand the text to make sure that the translation match the original. That's why all strings are marked as "fuzzy" in the process. You should check each of them carefully before removing those markers.
es: Tenga en cuenta que aunque parezca que todo ha ido bien, aún queda lugar para los errores en este proceso. El caso es que po4a no es capaz de entender el texto para asegurarse de que la traducción se refiere al original dado. Es por ello que las cadenas se marcan como borrosas («fuzzy») durante el proceso. Debe comprobar cuidadosamente cada cadena antes de eliminar esas marcas.

source: Often the document structures don't match exactly, preventing po4a-gettextize from doing its job properly. At that point, the whole game is about editing the files to get their damn structures matching.
es: A menudo las estructuras de los documentos no encajan a la perfección, impidiendo a po4a-gettextize realizar su tarea. Llegados a este punto, todo el proceso se traslada a la edición de los ficheros para hacer encajar sus malditas estructuras.
