Repository: elric/deb-l10n
Catalog: po4a-pod-*.po
Languages: es

source: This function works like wrap_msg(), but it takes a module name as the first argument, and leaves a space at the left of the message.
es: Esta función funciona como wrap_msg(), pero toma un nombre de módulo como primer argumento, y deja un espacio a la izquierda del mensaje.

source: This function works like wrap_msg(), but it takes a file:line reference as the first argument, a module name as the second one, and leaves a space at the left of the message.
es: Esta función funciona como wrap_msg(), pero toma una referencia fichero:línea como primer argumento, un nombre de módulo como segundo, y deja un espacio a la izquierda del mensaje.

source: Wrappers for other modules
es: Patrones de diseño («wrappers») para otros módulos

source: When the Locale::Gettext module cannot be loaded, this module provide dummy (empty) implementation of the following functions. In that case, po4a messages won't get translated but the program will continue to work.
es: Este módulo proporciona una integración de las siguientes funciones en caso de que no se pueda cargar el módulo Locale::Gettext. De ser así, los mensajes de po4a no se traducirán pero el programa seguirá funcionando.

source: If Locale::gettext is present, this wrapper also calls setlocale(LC_MESSAGES, "") so callers don't depend on the POSIX module either.
es: Si Locale::gettext está presente, este «wrapper» también invoca setlocale (LC_MESSAGES, ""), para que aquello que lo invoque no dependa tampoco del módulo de POSIX.

source: Locale::Po4a::Debconf - Convert debconf templates from/to PO files
es: Locale::Po4a::Debconf - Conversión de plantillas debconf desde/a ficheros PO.

source: Locale::Po4a::Debconf is a module to help the translation of the debconf templates into other [human] languages.
es: Locale::Po4a::Debconf es un módulo que asiste en la traducción de plantillas debconf a otros lenguajes (humanos).

source: Not tested.
es: No está probado.

source: DO NOT USE THIS MODULE TO PRODUCE TEMPLATES. It's only good to extract data.
es: NO USE ESTE MÓDULO PARA PRODUCIR PLANTILLAS. Sólo sirve para extraer datos.

source: This module is loosely inspired from both po-debconf and debconf code. The adaptation for po4a was done by:
es: Este módulo esta vagamente inspirado en el código de po-debconf y debconf. La a po4a la realizó:

source: Copyright 2005 by SPI, inc.
es: Copyright 2005 por SPI, inc.

source: Locale::Po4a::Dia - Convert uncompressed Dia diagrams from/to PO files
es: Locale::Po4a::Dia - Conversión de diagramas descomprimidos de Dia desde/a ficheros PO.

source: Locale::Po4a::Dia is a module to help the translation of diagrams in the uncompressed Dia format into other [human] languages.
es: Locale::Po4a::Dia es un módulo que asiste en la traducción de diagramas en el formato Dia descomprimido a otros lenguajes (humanos).

source: You can get Dia (the graphical editor for these diagrams) from: http://www.gnome.org/projects/dia/
es: Puede obtener Dia (el editor gráfico para éstos diagramas) en: http://www.gnome.org/projects/dia/

source: TRANSLATING WITH PO4A::DIA
es: TRADUCIR CON PO4A::DIA

source: This module only translates uncompressed Dia diagrams. You can save your uncompressed diagrams with Dia itself, unchecking the "Compress diagram files" at the "Save Diagram" dialog.
es: Este módulo sólo traduce diagramas de Dia descomprimidos. Puede guardar sus diagramas descomprimidos directamente con Dia, desmarcando la opción «Comprimir ficheros del diagrama» en el diálogo «Guardar diagrama».

source: Another way is to uncompress the dia files from command line with: gunzip < original.dia > uncompressed.dia
es: Otra manera es descomprimir los ficheros Dia desde la línea de órdenes con: gunzip < original.dia > descomprimido.dia

source: This module is fully functional, as it relies in the L<Locale::Po4a::Xml> module. This only defines the translatable tags (E<lt>dia:stringE<gt>), and filters the internal strings (the content of the E<lt>dia:diagramdataE<gt> tag), not interesting for translation.
es: Este módulo es completamente funcional, ya que se basa en el módulo L<Locale::Po4a::Xml>. Únicamente define las etiquetas traducibles (E<lt>dia:stringE<gt>), y filtra las cadenas internas (el contenido de la etiqueta E<lt>dia:diagramdataE<gt>), que no interesa traducir.

source: Copyright (c) 2004 by Jordi Vilalta <jvprat@gmail.com>
es: Copyright (c) 2004 por Jordi Vilalta <jvprat@gmail.com>

source: Locale::Po4a::Docbook - Convert Docbook XML documents from/to PO files
es: Locale::Po4a::Docbook - Conversión de documentos Docbook XML desde/a ficheros PO.

source: Locale::Po4a::Docbook is a module to help the translation of DocBook XML documents into other [human] languages.
es: Locale::Po4a::Docbook es un módulo que asiste en la traducción de documentación en formato DocBook XML a otros lenguajes (humanos).

source: Please note that this module is still under heavy development, and not distributed in official po4a release since we don't feel it to be mature enough. If you insist on trying, check the CVS out.
es: Tenga en cuenta que este módulo aún está en desarrollo, y no se distribuye en los lanzamientos oficiales de po4a porque aún no lo consideramos suficientemente maduro. Si desea probarlo de todas formas, puede conseguirlo en el CVS.

source: This module is fully functional, as it relies in the L<Locale::Po4a::Xml> module. This only defines the translatable tags and attributes.
es: Este módulo es completamente funcional, ya que se basa en el módulo L<Locale::Po4a::Xml>. Sólo define las etiquetas y atributos que se pueden traducir.

source: The only known issue is that it doesn't handle entities yet, and this includes the file inclusion entities, but you can translate most of those files alone (except the typical entities files), and it's usually better to maintain them separated.
es: El único problema conocido es que aún no trata las entidades, y eso incluye a las entidades de inclusión de ficheros, pero en la mayoría de casos puede traducir esos ficheros por separado (excepto los típicos ficheros de entidades), y generalmente es mejor mantenerlos separados.

source: Locale::Po4a::Guide - Convert Guide XML documents from/to PO files
es: Locale::Po4a::Guide - Conversión de documentos Guide XML desde/a ficheros PO.

source: Locale::Po4a::Guide is a module to help in the translation of the Gentoo Linux documentation in the Guide XML format into other [human] languages.
es: Locale::Po4a::Guide es un módulo que asiste en la traducción de la documentación de Gentoo Linux en formato Guide XML a otros lenguajes (humanos).

source: This format is documented here: http://www.gentoo.org/doc/en/xml-guide.xml
es: Este formato está documentado aquí: http://www.gentoo.org/doc/en/xml-guide.xml

source: The only known issue is that it doesn't include files with the <include href="..."> tag, but you can translate all those files alone, and it's usually better to have them separated.
es: El único problema conocido es que no incluye ficheros con la etiqueta <include href="...">, pero puede traducir esos ficheros por separado, y generalmente es mejor mantenerlos separados.

source: Locale::Po4a::Halibut - Convert Halibut documents and derivates from/to PO files
es: Locale::Po4a::Halibut - Conversión de documentos Halibut y derivados de/a ficheros PO.

source: Locale::Po4a::Halibut is a module to help the translation of Halibut documents into other [human] languages.
es: Locale::Po4a::Halibut es un módulo que asiste en la traducción de documentos Halibut a otros lenguajes (humanos).

source: This module contains the definitions of common Halibut commands and environments.
es: Este módulo contiene las definiciones de las órdenes y los entornos comunes de Halibut.

source: This module is still beta. Please send feedback and feature requests.
es: Este módulo aún esta en un estado beta. Envíe comentarios y peticiones de características.

source: CAVEAT
es: ADVERTENCIA

source: Some constructs are badly supported. The known ones are documented below.
es: La compatibilidad con algunas constructos no es de calidad. A continuación están documentados aquellos conocidos.

source: Verbatim blocks
es: Grupos de caracteres literales

source: The verbatim block is not considered as a whole. Each line will be translated separately.
es: Los grupos de caracteres literales no se toman como un conjunto. Cada línea se traducirá separadamente

source: This program is free software; you may redistribute it and/or modify it under the terms of GPL (see COPYING file).
es: Esto es software libre; puede redistribuirlo y/o modificarlo bajo las condiciones de la GPL (véase el fichero COPYING).

source: Locale::Po4a::Html - Convert html documents from/to PO files
es: Locale::Po4a::Html - Conversión de documentos html desde/a ficheros PO.

source: Locale::Po4a::Html is a module to help the translation of documentation in the HTML format into other [human] languages.
es: Locale::Po4a::Html es un módulo que asiste en la traducción de documentación en formato HTML a otros lenguajes (humanos).

source: Please note that this module is not distributed with the main po4a archive because we don't feel it mature enough for that. If you insist on using it anyway, check it from the CVS out.
es: Tenga en cuenta que este módulo aún está en desarrollo, y no se distribuye en los lanzamientos oficiales de po4a porque aún no lo consideramos suficientemente maduro. Si desea probarlo de todas formas, puede obtenerlo del CVS.

source: Locale::Po4a::Ini - Convert ini files from/to PO files
es: Locale::Po4a::Ini - Conversión de ficheros INI desde/a ficheros PO.

source: Locale::Po4a::Ini is a module to help the translation of INI files into other [human] languages.
es: Locale::Po4a::Ini es un módulo que asiste en la traducción de ficheros INI a otros lenguajes (humanos).

source: The module searches for lines of the following format and extracts the quoted text:
es: Este módulo busca líneas con el siguiente formato y extrae el texto entrecomillado:

source: identificator="text than can be translated"
es: identificator="este texto se puede traducir"

source: NOTE: If the text is not quoted, it will be ignored.
es: NOTA: Si no hay texto entre comillas, se ignorará.

source: Copyright 2006 by BitDefender
es: Copyright 2006 por BitDefender

source: Locale::Po4a::KernelHelp - Convert kernel configuration help from/to PO files
es: Locale::Po4a::KernelHelp - Conversión de la ayuda de configuración del núcleo desde/a ficheros PO.

source: Locale::Po4a::KernelHelp is a module to help the translation of documentation for the Linux kernel configuration options into other [human] languages.
es: Locale::Po4a::KernelHelp es un módulo que asiste en la traducción de la documentación de las opciones de configuración del núcleo de Linux a otros lenguajes (humanos).

source: This module is just written, and needs more tests. Most of the needed work will concern the tools used to parse this file (and configure the kernel), so that they accept to read the documentation from another (translated) file.
es: Este módulo se escribió recientemente y necesita más pruebas. El trabajo más necesario tiene que ver con las herramientas que se utilizan para analizar estos ficheros (y configurar el núcleo), de forma que acepten la lectura de la documentación de otros ficheros (traducidos).

source: Copyright 2002 by SPI, inc.
es: Copyright 2002 por SPI, inc.

source: Locale::Po4a::LaTeX - Convert LaTeX documents and derivates from/to PO files
es: Locale::Po4a::LaTeX - Conversión de documentos LaTeX y derivados desde/a ficheros PO.

source: Locale::Po4a::LaTeX is a module to help the translation of LaTeX documents into other [human] languages. It can also be used as a base to build modules for LaTeX-based documents.
es: Locale::Po4a::LaTeX es un módulo que asiste en la traducción de documentos en LaTeX a otros lenguajes (humanos). También se puede usar como base para construir módulos para documentos basados en LaTeX.

source: This module contains the definitions of common LaTeX commands and environments.
es: Este módulo contiene las definiciones de las órdenes y los entornos más habituales de LaTeX.

source: See the L<Locale::Po4a::TeX(3pm)|Locale::Po4a::TeX> manpage for the list of recognized options.
es: Véase la página de manual L<Locale::Po4a::TeX(3pm)|Locale::Po4a::TeX> para una lista de las opciones reconocidas.

source: Copyright 2004, 2005 by Nicolas FRANÇOIS <nicolas.francois@centraliens.net>.
es: Copyright 2004, 2005 por Nicolas FRANÇOIS <nicolas.francois@centraliens.net>.

source: Locale::Po4a::Man - Convert manual pages from/to PO files
es: Locale::Po4a::Man - Conversión de páginas de manual desde/a ficheros PO.

source: Locale::Po4a::Man is a module to help the translation of documentation in the nroff format (the language of manual pages) into other [human] languages.
es: Locale::Po4a::Man es un módulo que asiste en la traducción de documentación en formato nroff (el lenguaje de las páginas de manual) a otros lenguajes (humanos).

source: TRANSLATING WITH PO4A::MAN
es: TRADUCIR CON PO4A::MAN

source: This module tries pretty hard to make translator's life easier. For that, the text presented to translators isn't a verbatim copy of the text found in the man page. Indeed, the cruder parts of the nroff format are hidden, so that translators can't mess up with them.
es: Este módulo intenta facilitar la vida a los traductores. Para ello, el texto presentado a los traductores no es una copia exacta del texto encontrado en la página de manual. De hecho, las partes más crudas del formato nroff se ocultan de forma que los traductores no se líen con ellas.

source: Text wrapping
es: Justificación de texto

source: Unindented paragraphs are automatically rewrapped for the translator. This can lead to some minor difference in the generated output, since the rewrapping rules used by groff aren't very clear. For example, two spaces after a parenthesis are sometimes preserved, while typographic rules only ask to preserve the two spaces after the period sign (ok, I'm not native speaker, and I'm not sure of that. If you have any other information, you're welcome).
es: Los párrafos sin indentar se justifican automáticamente para el traductor. Esto puede llevar a pequeñas diferencias en la salida generada, ya que las reglas de justificación usadas por groff no son muy claras. Por ejemplo, dos espacios después de un paréntesis se mantienen a veces, mientras que las reglas tipográficas solamente piden preservar dos espacios después de punto (vale, no soy un hablante nativo, y no estoy seguro de eso. Si tiene otra información será bienvenida).

source: Anyway, the difference will only be about the position of the extra spaces in wrapped paragraph, and I think it's worth.
es: De todas formas, la diferencia sólo será sobre la posición de los espacios adicionales en el párrafo justificado, y pienso que vale la pena.

source: Font specification
es: Especificar el tipo de letra

source: The first change is about font change specifications. In nroff, there are several ways to specify if a given word should be written in small, bold or italics. In the text to translate, there is only one way, borrowed from the pod (perl online documentation) format:
es: El primer cambio es sobre la especificación de los cambios de tipo de letra. En nroff, hay varias formas de especificar si una palabra dada se debe escribir en pequeño, negrita o cursiva. En el texto a traducir hay solo una forma, tomada del formato pod (documentación en línea de perl):

source: IE<lt>textE<gt> -- italic text
es: IE<lt>textoE<gt> -- texto en cursiva

source: equivalent to \fItext\fP or ".I text"
es: equivale a \fItexto\fP o ".I text"

source: BE<lt>textE<gt> -- bold text
es: BE<lt>textoE<gt> -- texto en negrita

source: equivalent to \fBtext\fP or ".B text"
es: equivale a \fBtexto\fP o ".B texto"

source: RE<lt>textE<gt> -- roman text
es: RE<lt>textoE<gt> -- texto estándar

source: equivalent to \fRtext\fP
es: equivale a \fRtext\fP

source: CWE<lt>textE<gt> -- constant width text
es: CWE<lt>textoE<gt> -- texto con ancho constante

source: equivalent to \f(CWtext\fP or ".CW text"
es: equivale a \f(CWtexto\fP o ".CW texto"

source: Remark: The CW face is not available for all groff devices. It is not recommended to use it. It is provided for your convenience.
es: Comentario: La fuente CW no está disponible en todos los dispositivos groff. Se recomienda no usarla, pero se proporciona para su comodidad.

source: Automatic characters transliteration
es: Transliteración automática de caracteres

source: Po4a automatically transliterate some characters to ease the translation or the review of the translation. Here is the list of the transliterations:
es: Po4a realiza una transliteración automática de algunos caracteres para facilitar la traducción o revisión de una. Esta es una lista de los caracteres afectados por el proceso:

source: hyphens
es: guiones

source: Hyphens (-) and minus signs (\-) in man pages are all transliterated as simple dashes (-) in the PO file. Then all dash are transliterated into roff minus signs (\-) when the translation is inserted into the output document.
es: Los guiones (-) y signos de resta (\-) en las páginas de manual pasan a ser rayas simples (-) en el fichero PO. Entonces, todas las rayas sufren una transliteración, pasando a ser signos de resta (\-) cuando se inserta la traducción en el documento de salida.

source: Translators can force an hyphen by using the roff glyph '\[hy]' in their translations.
es: Los traductores pueden forzar el guión usando el glifo de roff '\[hy]' en sus traducciones.

source: non-breaking spaces
es: espacios duros («non-breaking spaces»)

source: Translators can use non-breaking spaces in their translations. These non-breaking spaces (0xA0 in latin1) will be transliterated into a roff non-breaking space ('\ ').
es: Los traductores pueden usar espacios duros en sus traducciones. Tras la transliteración, estos espacios duros (0xA0 en latin1) se convertirán en un espacio duro de roff ('\ ').

source: quotes transliterations
es: las comillas en la transliteración

source: `` and '' are respectively tranliterated into \*(lq and \*(rq.
es: «``» y «''» pasan a ser «\*(lq» y «\*(rq», respectivamente, después de la transliteración.

source: To avoid these transliterations, translators can insert a zero width roff character (i.e., using `\&` or '\&' respectively).
es: Para evitar estas transliteraciones, los traductores pueden insertar un carácter de ancho cero de roff (p. ej., usando «`\&`» o «'\&'» respectivamente.

source: Putting 'E<lt>' and 'E<gt>' in translations
es: Introducir «E<lt>» y «E<gt>» en las traducciones

source: Since these chars are used to delimit parts under font modification, you can't use them verbatim. Use EE<lt>ltE<gt> and EE<lt>gtE<gt> instead (as in pod, one more time).
es: Ya que estos caracteres se usan para delimitar las partes bajo una modificación de tipo de letra, no puede usarlos literalmente. Use «EE<lt>ltE<gt>» y «EE<lt>gtE<gt>» en su lugar (una vez más, al igual que en pod).

source: These are this module's particular options:
es: Estas son las opciones particulares de este módulo:

source: Activate debugging for some internal mechanisms of this module. Use the source to see which parts can be debugged.
es: Activar la depuración de fallos para algunos mecanismos internos del módulo. Use el código fuente para ver qué partes se pueden depurar.

source: Increase verbosity.
es: Aumentar el nivel de verbosidad.

source: This option permits to change the behavior of the module when it encounter a .de, .ie or .if section. It can take the following values:
es: Esta opción le permite cambiar el comportamiento del módulo cuando encuentra una sección .de, .ie o .if. Puede tomar los siguientes valores:

source: This is the default value. The module will fail when a .de, .ie or .if section is encountered.
es: Este es el vlor predefinido. El módulo fallará cuando encuentre una sección .de, .ie o .if.

source: Indicates that the .de, .ie or .if sections must be copied as is from the original to the translated document.
es: Indicar que las secciones .de, .ie y .if se deben copiar tal cual desde el original al documento traducido.

source: Indicates that the .de, .ie or .if sections will be proposed for the translation. You should only use this option if a translatable string is contained in one of these section. Otherwise, I<verbatim> should be preferred.
es: Indicar que las secciones .de, .ie y .if se propondrán para la traducción. Solo debería usar esta opción de existir una cadena traducible dentro de una de estas secciones. De no ser así, se prefiere I<verbatim>.

source: This option specifies that the file was generated, and that po4a should not try to detect if the man pages was generated from another format. This permits to use po4a on generated man pages. This option does not take any argument.
es: Esta opción especifica que ya se generó el fichero, y que po4a no debería intentar detectar si las páginas de manual se generaron a partir de otro formato. Esto permite usar po4a en páginas de manual generadas. Esta opción no toma ningún argumento.

source: This option is only useful for mdoc pages.
es: Esta opción sólo es de utilidad con páginas mdoc.

source: It selects a stricter support of the mdoc format by telling po4a not to translate the 'NAME' section. mdoc pages whose 'NAME' section is translated won't generate any header of footer.
es: Selecciona una compatibilidad más estricta del formato mdoc diciendo a po4a que no traduzca la sección «NAME». Las páginas mdoc cuya sección «NAME» está traducida no generarán cabecera ni pié de página alguna.

source: According to the groff_mdoc page, the NAME, SYNOPSIS and DESCRIPTION sections are mandatory. There are no known issues with translated SYNOPSIS or DESCRIPTION section, but you can also specify these sections this way: -o mdoc=NAME,SYNOPSIS,DESCRIPTION
es: De acuerdo a la página groff_mdoc, las secciones «NAME», «SYNOPSIS» y «DESCRIPTION» son obligatorias. No hay problemas conocidos con las secciones «SYNOPSIS» y «DESCRIPTION» cuando están traducidas, pero puede especificar estas secciones de la siguiente manera: -o mdoc=NAME,SYNOPSIS,DESCRIPTION

source: This mdoc issue can also be solved with an addendum like this one: PO4A-HEADER:mode=before;position=^.Dd .TH DOCUMENT_TITLE 1 "Month day, year" OS "Section Name"
es: Este problema de mdoc se puede resolver también con un apéndice («addendum») como el que sigue: PO4A-HEADER:mode=before;position=^.Dd .TH DOCUMENT_TITLE 1 "Month day, year" OS "Section Name"

source: The following options permit to specify the behavior of a new macro (defined with a .de request), or of a macro not supported by po4a. They take in argument a coma separated list of macros. For example:
es: Las siguientes opciones permiten especificar el comportamiento de una nueva macro (definida con una petición .de), o de una macro no compatible con po4a. Toman una lista separada por comas de macros como argumento. Por ejemplo:

source: Note: if a macro is not supported by po4a and if you consider that it is a standard roff macro, you should submit it to the po4a development team.
es: Nota: si una macro no es compatible con po4a, y considera que es una macro de roff estándar, debería enviarlo al equipo de desarrollo de po4a.

source: B<untranslated> indicates that this macro (at its arguments) don't have to be translated.
es: B<untranslated> indica que esta macro (en cuanto a sus argumentos) no precisan traducción.

source: B<noarg> is like B<untranslated>, except that po4a will verify that no argument is added to this macro.
es: B<noarg> es como B<untranslated>, a excepción de que po4a revisará que no se añada ningún argumento a esta macro.
