Repository: elric/deb-l10n
Catalog: po4a-pod-*.po
Languages: es

source: It may help to read the section L<Gettextization: how does it work?> below. Understanding the internal process will help you to make this work. The good point is that po4a-gettextize is rather verbose about what went wrong when it happens. First, it pinpoints where in the documents the structures' discrepancies are. You will learn the strings that don't match, their positions in the text, and the type of each of them. Moreover, the po file generated so far will be dumped to gettextization.failed.po.
es: Le puede ayudar leer la sección L<Gettextización: ¿Cómo funciona?>, más abajo. La comprensión del funcionamiento interno del proceso le ayudará a hacerlo funcionar. El punto bueno es que po4a-gettextize da mucha información cuando algo no va bien. Primero, apunta dónde se encontró la discrepancia de estructuras en los documentos. Luego le mostrará las cadenas que no encajan, su posición en el texto, y el tipo de cada una. Además, el fichero po generado hasta el momento se guardará en «gettextization.failed.po».

source: Remove all extra parts of the translations, such as the section in which you give the translator name and thank every people who contributed to the translation. Addenda, which are described in the next section, will allow you to re-add them afterward.
es: Elimine todas las partes añadidas de las traducciones, como secciones donde se especifique el nombre del traductor, o los agradecimientos de gente que colaboró con la traducción. Los apéndices, descritos en la siguiente sección, le permitirán volver a añadir estos contenidos.

source: Do not hesitate to edit both the original and the translation. The most important thing is to get the po file. You will be able to update it afterward. That being said, editing the translation should be preferred when both are possible since it makes things easier when the gettextization is done.
es: No dude en editar tanto el original como la traducción. Lo más importante es conseguir el fichero po. Ya tendrá tiempo de actualizarlo luego. Dicho esto, es preferible editar la traducción cuando se pueden editar ambos, ya que facilita las cosas cuando haya finalizado la gettextización.

source: If needed, kill some parts of the original if they happen to not be translated. When synchronizing the po with the document afterward, they will come back from themselves.
es: Si es necesario, elimine algunas partes del original si no estaban traducidas. Cuando más adelante sincronice el po con el documento, volverán por si solas.

source: If you changed the structure a bit (to merge two paragraphs, or split another one), undo those changes. If there is issues in the original, you should inform the original author. Fixing them in your translation only fix it for a part of the community. And moreover, it's impossible when using po4a ;)
es: Si cambió un poco la estructura (para juntar dos párrafos, o dividir alguno), deshaga esos cambios. Si hay problemas con el original, debería informar al autor original del texto. Arreglarlo sólo en la traducción solo ofrece la solución a una parte de la comunidad. Y además, es imposible cuando se usa po4a ;)

source: Sometimes, the paragraph content does match, but their types don't. Fixing it is rather format-dependant. In pod and man, it often comes from the fact that one of the two contains a line beginning with a white space where the other doesn't. In those formats, such paragraph cannot be wrapped and thus become a different type. Just remove the space and you are fine. It may also be a typo in the tag name.
es: A veces el contenido del párrafo encaja, pero su tipo no. Arreglar eso depende mucho del formato. En pod y man, a menudo es culpa de que una de las dos líneas empieza con un espacio y la otra no. En estos formatos, este párrafo no se podría justificar y su tipo cambiaría. Simplemente elimine el espacio y ya está. También puede tratarse de un error tipográfico en el nombre de la etiqueta.

source: Likewise, two paragraphs may get merged together in pod when the separating line contains some spaces, or when there is no empty line before the =item line and the content of the item.
es: De manera parecida, dos párrafos se podrían fusionar en un pod cuando la línea de separación contiene algunos espacios, o cuando no hay una línea de separación antes de la línea =item y del contenido del elemento («item»).

source: Sometimes, there is a desynchronization between the files, and the translation is attached to the wrong original paragraph. It is the sign that the real problem was before in the files. Check gettextization.failed.po to see when the desynchronization begins, and fix it there.
es: A veces, hay un asincronismo entre ficheros y la traducción se empareja con un párrafo original equivocado. Éste es un signo de que el problema real ya existía en los ficheros. Compruebe «gettextization.failed.po» para ver cuando empieza la asincronismo, y arréglelo ahí.

source: Sometimes, you get the strong feeling that po4a ate some parts of the text, either the original or the translation. gettextization.failed.po indicates that both of them where gently matching, and then the gettextization fails because it tried to match one paragraph with the one after (or before) the right one, as if the right one disappeared. Curse po4a as I did when it first happened to me. Generously.
es: A veces le puede dar la impresión de que po4a omitió algunas partes del texto, ya sea del original o de la traducción. «gettextization.failed.po» indica que ambos encajaban correctamente, y luego falló porque intentó encajar un párrafo con el anterior (o posterior) con el correcto, como si el correcto hubiera desaparecido. Maldiga po4a como yo hice la primera vez que me pasó. Abundantemente.

source: This unfortunate situation happens when the same paragraph is repeated over the document. In that case, no new entry is created in the po file, but a new reference is added to the existing one instead.
es: Esta desafortunada situación se debe a que el mismo párrafo se repite a lo largo del documento. En ese caso, no se crea una nueva entrada en el fichero po, sino que se añade una nueva referencia a la ya existente.

source: So, when the same paragraph appears twice in the original but are not translated in the exact same way each time, you will get the feeling that a paragraph of the original disappeared. Just kill the new translation. If you prefer to kill the first translation instead when it was actually better, remove the second one from where it is and put it in place of the first one.
es: Por lo tanto, cuando el mismo párrafo aparece dos veces en el original pero no está traducido exactamente igual cada vez, tendrá esa sensación de que desapareció un párrafo del original. Simplemente elimine la traducción nueva. Si cree que la segunda traducción es mejor, elimínela de donde está, y póngala en el lugar de la primera.

source: In the contrary, if two similar but different paragraphs were translated in the exact same way, you will get the feeling that a paragraph of the translation disappeared. A solution is to add a stupid string to the original paragraph (such as "I'm different"). Don't be afraid, those things will disappear during the synchronization, and when the added text is short enough, gettext will match your translation to the existing text (marking it as fuzzy, but you don't really care since all strings are fuzzy after gettextization).
es: En caso contrario, si dos párrafos parecidos pero diferentes se tradujeron de la misma forma le puede dar la impresión de que desapareció un párrafo de la traducción. La solución es añadir una cadena estúpida al párrafo original (algo como «soy diferente») para solucionarlo. No se asuste. Estas cosas desaparecerán durante la sincronización, y cuando el texto añadido sea suficientemente corto, gettext encajara su traducción con el texto existente (marcándola como borrosa, pero no importa, ya que todas las cadenas se marcan como borrosas durante la gettextización).

source: Hopefully, those tips will help you making your gettextization work and obtain your precious po file. You are now ready to synchronize your file and begin your translation. Please note that on large text, it may happen that the first synchronization takes a long time.
es: Con un poco de suerte estos trucos le ayudarán a realizar su gettextización y a obtener su preciado fichero po. Ahora está preparado para sincronizar su fichero y empezar la traducción. Tenga en cuenta que en textos grandes la primera sincronización puede tardar mucho tiempo.

source: For example, the first po4a-updatepo of the Perl documentation's French translation (5.5 Mb po file) took about two days full on a 1Ghz G5 computer. Yes, 48 hours. But the subsequent ones only take a dozen of seconds on my old laptop. This is because the first time, most of the msgid of the po file don't match any of the pot file ones. This forces gettext to search for the closest one using a costly string proximity algorithm.
es: Por ejemplo, el primer po4a-updatepo de la traducción al francés de la documentación de Perl (un fichero po de 5.5 Mb) tomó alrededor de dos días enteros en una máquina G5 a 1Ghz. Sí, 48 horas. Pero las siguientes veces tan solo tardaba una docena de segundos en mi viejo portátil. Esto se debe a que la primera vez la mayoría de msgid del fichero po no encajaban con ninguno de los del fichero pot. Esto obliga a gettext a buscar la cadena más parecida usando un costoso algoritmo de proximidad de cadenas.

source: Because of the gettext approach, doing this becomes more difficult in po4a than it was when simply editing a new file along the original one. But it remains possible, thanks to the so-called B<addenda>.
es: Debido al enfoque de gettext, ésto se vuelve más difícil en po4a que antes, cuando simplemente se editaba el nuevo fichero paralelamente al original. Pero sigue siendo posible, gracias a los llamados B<apéndices> («addenda»).

source: It may help the comprehension to consider addenda as a sort of patches applied to the localized document after processing. They are rather different from the usual patches (they have only one line of context, which can embed perl regular expression, and they can only add new text without removing any), but the functionalities are the same.
es: Para ayudar a la comprensión, considere los apéndices como unos parches aplicados al documento traducido después del proceso. Son bastante diferentes que los parches habituales (solo tienen una línea de contexto, que puede incluir una expresión regular de perl y únicamente pueden añadir texto, sin eliminar nada), pero la funcionalidad es la misma.

source: Their goal is to allow the translator to add extra content to the document which is not translated from the original document. The most common usage is to add a section about the translation itself, listing contributors and explaining how to report bug against the translation.
es: Su objetivo es permitir al traductor añadir contenido adicional al documento que no está traducido del documento original. El uso más habitual es añadir una sección sobre la misma traducción, listando los colaboradores y explicando como informar de los errores en la traducción.

source: Addendum must be provided as a separate file. The first line constitutes a header indicating where in the produced document they should be placed. The rest of the addendum file will be added verbatim at the determined position of the resulting document.
es: El apéndice (addendum) se debe proporcionar como un fichero separado. La primera línea forma una cabecera que indica el lugar del documento resultante donde se debe colocar. El resto del fichero apéndice se añadirá tal cual en la posición determinada en el documento resultante.

source: The header have a pretty rigid syntax: It must begin with the string "PO4A-HEADER:", followed by a semi-colon (;) separated list of "key=value" fields. White spaces ARE important. Note that you cannot use the semi-colon char (;) in the value, and that quoting it doesn't help.
es: La cabecera tiene una sintaxis muy rígida: debe empezar con la cadena «PO4A-HEADER:», seguida por una lista de campos «llave=valor» separados por un punto y coma (;). Los espacios en blanco SON importantes. Tenga en cuenta que no puede usar el carácter de punto y coma (;) en los valores, y que las comillas no ayudan en este caso.

source: Again, it sounds scary, but the examples given below should help you to find how to write the header line you need. To illustrate the discussion, assume we want to add a section called "About this translation" after the "About this document" one.
es: Una vez más, suena espantoso, pero los ejemplos proporcionados a continuación deberían ayudarle a encontrar la forma de escribir la línea de cabecera que necesita. Para ilustrar la discusión, suponga que quiere añadir una sección llamada «Acerca de esta traducción» después de la denominada «Acerca de este documento».

source: Here are the possible header keys:
es: Aquí están las posibles llaves de la cabecera:

source: position (mandatory)
es: position (obligatoria)

source: a regexp. The addendum will be placed near the line matching this regexp. Note that we're speaking about the translated document here, not the original. If more than a line match this expression (or none), the addition will fail. It is indeed better to report an error than inserting the addendum at the wrong location.
es: Una expresión regular. El apéndice se ubicará cerca de la línea que coincida con esta expresión regular. Tenga en cuenta que estamos hablando del documento traducido, no del original. Si hay más de una linea que coincida con esta expresión (o ninguna), la adición fallará. Siempre es mejor informar de un error que insertar el apéndice en el sitio equivocado.

source: This line is called I<position point> in the following. The point where the addendum is added is called I<insertion point>. Those two points are near one from another, but not equal. For example, if you want to insert a new section, it is easier to put the I<position point> on the title of the preceding section and explain po4a where the section ends (remember that I<position point> is given by a regexp which should match a unique line).
es: Esta línea se llama I<punto de ubicación> («position»). El punto donde se insertará el apéndice se llama I<punto de inserción> («insertion»). Estos dos puntos están muy próximos, pero no son iguales. Por ejemplo, si desea una nueva sección, es más fácil definir el I<punto de ubicación> con el título de la sección anterior, y explicarle a po4a dónde termina la sección (recuerde que el I<punto de ubicación> viene dado por la expresión regular, que debe coincidir con una única linea).

source: The localization of the I<insertion point> with regard to the I<position point> is controlled by the C<mode>, C<beginboundary> and C<endboundary> fields, as explained below.
es: La ubicación del I<punto de inserción> respecto al punto de ubicación está controlado por los campos C<mode>, C<beginboundary> y C<endboundary>, explicados a continuación.

source: In our case, we would have:
es: En nuestro caso tendríamos:

source: position=<title>About this document</title>
es: position=<title>Acerca de este documento</title>

source: mode (mandatory)
es: mode (obligatorio)

source: It can be either the string "before" or "after", specifying the position of the addendum, relative to the I<position point>.
es: Puede ser tanto «before» (antes) o «after» (después), especificando la posición del apéndice, relativa al I<punto de ubicación>.

source: Since we want the new section to be placed below the one we are matching, we have:
es: Ya que queremos que la sección nueva se sitúe debajo de la que hemos emparejado, tenemos:

source: beginboundary (used only when mode=after, and mandatory in that case)
es: beginboundary (inicio del límite, usada sólo con mode=after, y obligatoria en ese caso)

source: endboundary (idem)
es: endboundary (fin del límite, ídem)

source: regexp matching the end of the section after which the addendum goes.
es: Expresión regular que encaja con el final de la sección que precede a la posición del apéndice.

source: When mode=after, the I<insertion point> is after the I<position point>, but not directly after! It is placed at the end of the section beginning at the I<position point>, ie after or before the line matched by the C<???boundary> argument, depending on whether you used C<beginboundary> or C<endboundary>.
es: Con mode=after, el I<punto de inserción> está después del I<punto de ubicación>, ¡pero no justamente después! Está situado al final de la sección que empieza en el I<punto de ubicación>, es decir, antes o después de la línea encajada por el argumento C<???boundary>, dependiendo de si usó C<beginboundary> o C<endboundary>.

source: In our case, we can choose to indicate the end of the section we match by adding:
es: En nuestro caso, podemos decidirnos por indicar el final de la sección que queremos emparejar añadiendo:

source: or to indicate the beginning of the next section by indicating:
es: o indicar el principio de la siguiente sección indicando:

source: In both case, our addendum will be placed after the E<lt>/sectionE<gt> and before the E<lt>sectionE<gt>. The first one is better since it will work even if the document gets reorganized.
es: En ambos casos, nuestro apéndice se ubicará después de E<lt>/sectionE<gt> y antes de E<lt>sectionE<gt>. La primera opción es mejor ya que funcionará aunque se reorganice el documento.

source: Both forms exist because documentation formats are different. In some of them, there is a way to mark the end of a section (just like the C<E<lt>/sectionE<gt>> we just used), while some other don't explicitly mark the end of section (like in man). In the former case, you want to make a I<boundary> matching the I<end of a section>, so that the I<insertion point> comes after it. In the latter case, you want to make a I<boundary> matching the I<beginning of next section>, so that the I<insertion point> comes just before it.
es: Las dos formas existen debido a que los formatos de documentación son diferentes. En algunos de ellos, hay una forma de marcar el final de una sección (tal como C<E<lt>/sectionE<gt>>, que ya hemos usado), mientras que otros no marcan explícitamente el final de una sección (como en man). En el primer caso, es preferible encajar un I<boundary> con el I<final de sección>, para que el I<punto de inserción> venga después. En el segundo caso, deberá encajar un I<boundary> con el I<principio de la siguiente sección> para que el I<punto de inserción> venga justo antes de éste.

source: This can seem obscure, but hopefully, the next examples will enlighten you.
es: Puede parecer críptico, pero espero que los siguientes ejemplos le iluminen.

source: To sum up the example we used so far, in order to add a section called "About this translation" after the "About this document" one in a sgml document, you can use either of those header lines:
es: Para resumir el ejemplo usado hasta el momento, si desea insertar una sección llamada «Acerca de esta traducción» después de la sección «Acerca de este documento» en un documento sgml, debe usar una de estas líneas de cabecera:

source: PO4A-HEADER: mode=after; position=About this document; endboundary=</section> PO4A-HEADER: mode=after; position=About this document; beginboundary=<section>
es: PO4A-HEADER: mode=after; position=Acerca de este documento; endboundary=</section> PO4A-HEADER: mode=after; position=Acerca de este documento; beginboundary=<section>

source: If you want to add something after the following nroff section:
es: Si desea añadir algo después de la siguiente sección de nroff:

source: .SH "AUTHORS"
es: .SH "AUTORES"

source: you should put a C<position> matching this line, and a C<beginboundary> matching the beginning of the next section (ie C<^\.SH>). The addendum will then be added B<after> the I<position point> and immediately B<before> the first line matching the C<beginboundary>. That is to say:
es: debería poner un C<position> que con encaje esta linea, y un C<beginboundary> que encaje con el principio de la siguiente sección (es decir C<^\.SH>). El apéndice se añadiría B<después> del I<punto de ubicación> e inmediatamente B<antes> de la primera línea que encaje con C<beginboundary>. Ésto es:

source: PO4A-HEADER:mode=after;position=AUTHORS;beginboundary=\.SH
es: PO4A-HEADER:mode=after;position=AUTORES;beginboundary=\.SH

source: If you want to add something into a section (like after "Copyright Big Dude") instead of adding a whole section, give a C<position> matching this line, and give a C<beginboundary> matching any line.
es: Si desea añadir algo dentro de una sección (como después de «Copyright Big Dude») en vez de añadir una sección completa, introduzca un C<position> que encaje con esta línea, e introduzca un C<beginboundary> que encaje con cualquier linea.

source: If you want to add something at the end of the document, give a C<position> matching any line of your document (but only one line. Po4a won't proceed if it's not unique), and give an C<endboundary> matching nothing. Don't use simple strings here like "C<EOF>", but prefer which have less chance to be in your document.
es: Si desea añadir algo al final del documento, especifique un C<position> que encaje con cualquier linea del documento (pero sólo una línea. Po4a no procederá si no es única), y ponga un C<endboundary> que no encaje con nada. No utilice cadenas simples como «C<EOF>», sino las que tengan menos probabilidad de salir en el documento.

source: PO4A-HEADER:mode=after;position=<title>About</title>;beginboundary=FakePo4aBoundary
es: PO4A-HEADER:mode=after;position=<title>Acerca de</title>;beginboundary=BoundaryFalsoDePo4a

source: In any case, remember that these are regexp. For example, if you want to match the end of a nroff section ending with the line
es: En cualquier caso, recuerde que se tratan de expresiones regulares. Por ejemplo, si desea encajar con el final de una sección de nroff que termina con la línea

source: don't use C<.fi> as endboundary, because it will match with "the[ fi]le", which is obviously not what you expect. The correct endboundary in that case is: C<^\.fi$>.
es: no utilice C<.fi> como endboundary, porque esto encajará con «el[ fi]chero», que obviamente no es lo que espera. El endboundary correcto en este caso sería: C<^\.fi$>.

source: If the addendum doesn't go where you expected, try to pass the -vv argument to the tools, so that they explain you what they do while placing the addendum.
es: Si el apéndice no se ubica donde esperaba, pruebe introduciendo el parámetro «-vv» a las herramientas, para que le expliquen qué hacen al colocar el apéndice.

source: More detailed example
es: Ejemplo más detallado

source: Original document (pod formatted):
es: Documento original (en formato pod):

source: |=head1 NAME | |dummy - a dummy program | |=head1 AUTHOR | |me
es: |=head1 NOMBRE | |relleno - un programa de relleno | |=head1 NOMBRE | |yo

source: Then, the following addendum will ensure that a section (in French) about the translator is added at the end of the file. (in French, "TRADUCTEUR" means "TRANSLATOR", and "moi" means "me")
es: Luego, el siguiente apéndice asegurará que se añade una sección (en español) sobre el traductor al final del fichero.

source: |PO4A-HEADER:mode=after;position=AUTEUR;beginboundary=^=head | |=head1 TRADUCTEUR | |moi
es: |PO4A-HEADER:mode=after;position=AUTOR;beginboundary=^=head | |=head1 TRADUCTOR | |yo

source: In order to put your addendum before the AUTHOR, use the following header:
es: Para poner su apéndice antes del AUTOR, utilice la siguiente cabecera:

source: PO4A-HEADER:mode=after;position=NOM;beginboundary=^=head1
es: PO4A-HEADER:mode=after;position=NOMBRE;beginboundary=^=head1
