Repository: elric/deb-l10n
Catalog: po4a-pod-*.po
Languages: es

source: This class is the ancestor of every po4a parsers used to parse a document to search translatable strings, extract them to a po file and replace them by their translation in the output document.
es: Esta clase es la antecesora de todos los analizadores de po4a usados para analizar un documento buscando cadenas traducibles, extraerlas a un fichero po y reemplazarlas por su traducción en el documento de salida.

source: More formally, it takes the following arguments as input:
es: Más formalmente, toma los siguientes parámetros como entrada:

source: a document to translate ;
es: un documento a traducir ;

source: a po file containing the translations to use.
es: un fichero po que contiene las traducciones a usar.

source: As output, it produces:
es: Como salida produce:

source: another po file, resulting of the extraction of translatable strings from the input document ;
es: otro fichero po, resultante de la extracción de las cadenas traducibles del documento de entrada ;

source: a translated document, with the same structure than the one in input, but with all translatable strings replaced with the translations found in the po file provided in input.
es: un documento traducido, con la misma estructura que el de la entrada, pero con todas las cadenas traducibles reemplazadas por las traducciones encontradas en el fichero po suministrado en la entrada.

source: Here is a graphical representation of this:
es: Aquí tiene una representación gráfica:

source: Input document --\ /---> Output document \ / (translated) +-> parse() function -----+ / \ Input po --------/ \---> Output po (extracted)
es: Documento de entrada -\ /---> Documento de salida \ / (traducido) +-> función parse() --+ / \ po de entrada --------/ \---> po de salida (extraído)

source: FUNCTIONS YOUR PARSER SHOULD OVERRIDE
es: FUNCIONES QUE SU ANALIZADOR DEBE IMPLEMENTAR

source: This is where all the work takes place: the parsing of input documents, the generation of output, and the extraction of the translatable strings. This is pretty simple using the provided functions presented in the section "INTERNAL FUNCTIONS" below. See also the synopsis, which present an example.
es: Aquí es dónde se hace todo el trabajo: el análisis de los documentos de entrada, la generación de la salida, y la extracción de las cadenas traducibles. Es realmente simple usando las funciones presentadas en la sección «FUNCIONES INTERNAS» más abajo. Véase la sinopsis, que presenta un ejemplo.

source: This function is called by the process() function bellow, but if you choose to use the new() function, and to add content manually to your document, you will have to call this function yourself.
es: Esta función es invocada por la función «process()» a continuación, pero si elije usar la función «new()», y añadir contenido manualmente a su documento, deberá llamar ésta función manualmente.

source: This function returns the header we should add to the produced document, quoted properly to be a comment in the target language. See the section "Educating developers about translations", from L<po4a(7)|po4a.7>, for what it is good for.
es: Esta función devuelve la cabecera que debemos añadir al documento creado, tratada de forma que sea un comentario para el lenguaje destino. Para ver las ventajas de esto, véase la sección «Educar a los programadores sobre las traducciones», en L<po4a(7)|po4a.7>.

source: The following example parses a list of paragraphs beginning with "<p>". For the sake of simplicity, we assume that the document is well formatted, i.e. that '<p>' tags are the only tags present, and that this tag is at the very beginning of each paragraph.
es: El siguiente ejemplo analiza una lista de párrafos que empiezan con «<p>». Para simplificar, suponemos que el documento está correctamente formateado, es decir, que sólo hay presentes etiquetas '<p>', y que esta etiqueta está justo al principio de cada párrafo.

source: PARAGRAPH: while (1) { my ($paragraph,$pararef)=("",""); my $first=1; my ($line,$lref)=$self->shiftline(); while (defined($line)) { if ($line =~ m/<p>/ && !$first--; ) { # Not the first time we see <p>. # Reput the current line in input, # and put the built paragraph to output $self->unshiftline($line,$lref);
es: PARAGRAPH: while (1) { my ($paragraph,$pararef)=("",""); my $first=1; my ($line,$lref)=$self->shiftline(); while (defined($line)) { if ($line =~ m/<p>/ && !$first--; ) { # No es la primera vez que vemos <p>. # Devuelve la línea actual a la entrada, # y pon el párrafo construido en la salida. $self->unshiftline($line,$lref);

source: # Now that the document is formed, translate it: # - Remove the leading tag $paragraph =~ s/^<p>//s;
es: # Ahora que tenemos el documento creado, lo traducimos: # - Eliminamos el tag principal $paragraph =~ s/^<p>//s;

source: # - push to output the leading tag (untranslated) and the # rest of the paragraph (translated) $self->pushline( "<p>" . $document->translate($paragraph,$pararef) );
es: # - Ponemos en la salida la etiqueta inicial (sin traducir) y el # resto del párrafo (traducido) $self>pushline( "<p>" . $document->translate($paragraph,$parraref) );

source: next PARAGRAPH; } else { # Append to the paragraph $paragraph .= $line; $pararef = $lref unless(length($pararef)); }
es: next PARAGRAPH; } else { # Añadir al párrafo. $paragraph .= $line; $pararef = $lref unless(length($pararef)); }

source: # Reinit the loop ($line,$lref)=$self->shiftline(); } # Did not get a defined line? End of input file. return; } }
es: # Reiniciar el bucle ($line,$lref)=$self->shiftline(); } ¿ # ¿No se obtuvo una línea definida? Fin del fichero de entrada. return; } }

source: Once you've implemented the parse function, you can use your document class, using the public interface presented in the next section.
es: Una vez haya implementado la función de análisis, ya puede usar su clase de documento usando la interfaz pública presentada en la siguiente sección.

source: PUBLIC INTERFACE for scripts using your parser
es: INTERFAZ PÚBLICA para scripts que usen su analizador

source: This function can do all you need to do with a po4a document in one invocation. Its arguments must be packed as a hash. ACTIONS:
es: Esta función puede hacer todo lo que quiera hacer con un documento po4a en una invocación:. Sus argumentos deben estar empaquetados como una tabla hash. ACCIONES:

source: Reads all the po files specified in po_in_name
es: Lectura de todos los ficheros po especificados en po_in_name

source: Reads all original documents specified in file_in_name
es: Lectura del documento original especificado en file_in_name

source: Parses the document
es: Análisis del documento

source: Reads and applies all the addenda specified
es: Lectura y aplicación de todos los apéndices especificados

source: Writes the translated document to file_out_name (if given)
es: Escribir el documento traducido en file_out_name (si se da)

source: Writes the extracted po file to po_out_name (if given)
es: Escribir el fichero po extraido en po_out_name (si se da)

source: ARGUMENTS, beside the ones accepted by new() (with expected type):
es: ARGUMENTOS, aparte de los aceptados por «new()» (con el tipo esperado):

source: List of filenames where we should read the input document.
es: Lista de los nombres de ficheros de los que se debe leer el documento de entrada.

source: Charset used in the input document (if it isn't specified, it will try to detect it from the input document).
es: Juego de caracteres usado en el documento de entrada (si no se especifica, se intentará detectar del documento de entrada)

source: Filename where we should write the output document.
es: Nombre del fichero donde se debe grabar el documento de salida.

source: Charset used in the output document (if it isn't specified, it will use the po file charset).
es: Juego de caracteres usado en el documento de salida (si no se especifica, se usará el juego de caracteres del fichero po).

source: List of filenames where we should read the input po files from, containing the translation which will be used to translate the document.
es: Lista de los nombres de ficheros de los que se deben leer los ficheros po de entrada, y que contienen la traducción que se usará para traducir el documento.

source: Filename where we should write the output po file, containing the strings extracted from the input document.
es: Nombre de fichero en el que se debe escribir el fichero po de salida, el cual contendrá las cadenas extraídas del documento de entrada.

source: List of filenames where we should read the addenda from.
es: Lista de los nombres de los ficheros de los que se deben leer los apéndices.

source: Charset for the addenda.
es: Juego de caracteres de los apéndices.

source: Create a new Po4a document. Accepted options (but be in a hash):
es: Crear un nuevo documento Po4a. Las opciones aceptadas (que deben estar en una tabla hash):

source: Sets the verbosity.
es: Configurar el nivel de verbosidad.

source: Sets the debugging.
es: Configurar la depuración.

source: Manipulating document files
es: Manipular ficheros de documentos.

source: Add another input document at the end of the existing one. The argument is the filename to read.
es: Añadir otro documento de entrada al final del ya existente. El argumento es el nombre del fichero a leer.

source: Please note that it does not parse anything. You should use the parse() function when you're done with packing input files into the document.
es: Cabe destacar que esto no analiza nada. Debe usar la función parse() cuando haya terminado de cargar los ficheros de entrada en el documento.

source: Write the translated document to the given filename.
es: Escribir el documento traducido al fichero dado.

source: Manipulating po files
es: Manipular ficheros po

source: Add the content of a file (which name is passed in argument) to the existing input po. The old content is not discarded.
es: Añadir el contenido de un fichero (cuyo nombre se introduce como argumento) al po de entrada existente. El contenido anterior no se desecha.

source: Write the extracted po file to the given filename.
es: Escribir el fichero po extraido al nombre de fichero dado.

source: Returns some statistics about the translation done so far. Please note that it's not the same statistics than the one printed by msgfmt --statistic. Here, it's stats about recent usage of the po file, while msgfmt reports the status of the file. It is a wrapper to the Locale::Po4a::Po::stats_get function applied to the input po file. Example of use:
es: Devolver algunas estadísticas sobre el punto actual de la traducción en curso ahora. Estas no son las mismas estadísticas que las que muestra «msgfmt --statistic». Aquí las estadísticas son sobre el uso reciente del fichero po, mientras que msgfmt informa del estado del fichero. Esto es un «wrapper» (patrón de diseño) de la función Locale::Po4a::Po::stats_get aplicada al fichero po de entrada. Ejemplo de uso:

source: [normal use of the po4a document...]
es: [uso normal del documento po4a...]

source: ($percent,$hit,$queries) = $document->stats(); print "We found translations for $percent\% ($hit from $queries) of strings.\n";
es: ($porcentaje,$aciertos,$solicitudes) = $documento->stats(); print "Se han encontrado traducciones para el $porcentaje\% ($aciertos de $solicitudes) de cadenas.\n";

source: Manipulating addenda
es: Manipular apéndices

source: Please refer to L<po4a(7)|po4a.7> for more information on what addenda are, and how translators should write them. To apply an addendum to the translated document, simply pass its filename to this function and you are done ;)
es: Consulte L<po4a(7)|po4a.7> para más información acerca de los apéndices, y cómo los traductores deben escribirlos. Para aplicar un apéndice a un documento traducido, simplemente introduzca su nombre de fichero en ésta función y ya está ;)

source: This function returns a non-null integer on error.
es: Esta función devuelve un entero no nulo en caso de error.

source: Getting input, providing output
es: Obtener entrada, proporcionar salida.

source: Four functions are provided to get input and return output. They are very similar to shift/unshift and push/pop. The first pair is about input, while the second is about output. Mnemonic: in input, you are interested in the first line, what shift gives, and in output you want to add your result at the end, like push does.
es: Para obtener la entrada y devolver la salida se proporcionan cuatro funciones. Son muy parecidas a shift/unshift y push/pop. El primer par trata la entrada, mientras que el segundo trata la salida. Mnemónica: en la entrada, está interesado en la primera línea, lo que obtiene shift, y en la salida se quiere insertar el resultado al final, como hace push.

source: This function returns the next line of the doc_in to be parsed and its reference (packed as an array).
es: Esta función devuelve la próxima línea de «doc_in» para su análisis, y su referencia (empaquetado como un vector).

source: Unshifts a line of the input document and its reference.
es: Devolver una línea del documento de entrada y su referencia.

source: Push a new line to the doc_out.
es: Insertar una nueva línea al doc_out.

source: Pop the last pushed line from the doc_out.
es: Extraer la última linea insertada al doc_out.

source: Marking strings as translatable
es: Marcar cadenas como traducibles

source: One function is provided to handle the text which should be translated.
es: Se proporciona una función para tratar el texto que debe ser traducido.

source: Mandatory arguments:
es: Argumentos obligatorios:

source: A string to translate
es: Una cadena a traducir

source: The reference of this string (ie, position in inputfile)
es: La referencia a esa cadena (p.ej., la posición en el fichero de entrada).

source: The type of this string (ie, the textual description of its structural role ; used in Locale::Po4a::Po::gettextization() ; see also L<po4a(7)|po4a.7>, section I<Gettextization: how does it work?>)
es: El tipo de ésta cadena (p.ej., la descripción textual de la estructura ; utilizada en Locale::Po4a::Po::gettextization(); véase también la sección I<Gettextización: ¿cómo funciona?>) en L<po4a(7)|po4a.7>.

source: This function can also take some extra arguments. They must be organized as a hash. For example:
es: Esta función también puede tomar algunos argumentos adicionales. Estos deben estar en una tabla hash. Por ejemplo:

source: boolean indicating whether we can consider that whitespaces in string are not important. If yes, the function canonizes the string before looking for a translation or extracting it, and wraps the translation.
es: Booleano que indica si podemos considerar que los espacios en blanco de la cadena carecen de importancia. En ese caso, la función canoniza la cadena antes de buscar su traducción o extraerla, y justifica la traducción.

source: An extra comment to add to the entry.
es: Un comentario adicional para añadir a la entrada.

source: Actions:
es: Acciones:

source: Pushes the string, reference and type to po_out.
es: Inserta la cadena, referencia y escribe en po_out.

source: Returns the translation of the string (as found in po_in) so that the parser can build the doc_out.
es: Devolver la traducción de la cadena (encontrada en po_in) de forma que el analizador pueda construir el doc_out.

source: Handles the charsets to recode the strings before sending them to po_out and before returning the translations.
es: Tratar los juegos de caracteres para recodificar las cadenas antes de enviarlas a po_out y antes de devolver las traducciones.

source: Misc functions
es: Funciones varias

source: Returns if the verbose option was passed during the creation of the TransTractor.
es: Devuelve si se pasó la opción de verbosidad durante la creación del TransTractor.

source: Returns if the debug option was passed during the creation of the TransTractor.
es: Devuelve si se pasó la opción de depuración de fallos durante la creación del TransTractor.

source: This tells TransTractor that a new charset (the first argument) has been detected from the input document. It can usually be read from the document header. Only the first charset will remain, coming either from the process() arguments or detected from the document.
es: Esto informa al TransTractor que se ha detectado un nuevo juego de caracteres (el primer argumento) en el documento de entrada. Habitualmente se puede encontrar en la cabecera del documento. Solo permanecerá el primer juego de caracteres, ya venga de los argumentos de «process()» o si se detectó en el documento.

source: This function will return the charset that should be used in the output document (usually useful to substitute the input document's detected charset where it has been found).
es: Esta función devuelve el juego de caracteres que se debe usar en el documento de salida (normalmente es útil para sustituir el juego de caracteres detectado en el documento de entrada donde se encontró).

source: It will use the output charset specified in the command line. If it wasn't specified, it will use the input po's charset, and if the input po has the default "CHARSET", it will return the input document's charset, so that no encoding is performed.
es: Utilizará el juego de caracteres especificado en la linea de órdenes. Si no se ha especificado, utilizará el juego de caracteres del po de entrada, y si el po de entrada aún tiene el «CHARSET» por defecto, devolverá el juego de caracteres del documento de entrada, para que no se realice ninguna codificación.

source: This function returns the recoded text passed as argument, from the input document's charset to the output document's one. This isn't needed when translating a string (translate() recodes everything itself), but it is when you skip a string from the input document and you want the output document to be consistent with the global encoding.
es: Esta función devuelve el texto recodificado introducido como argumento, desde el juego de caracteres del documento de entrada al del documento de salida. No es necesario cuando se traduzca una cadena (translate() ya lo recodifica por su cuenta), pero sí lo es cuando se salta alguna cadena del documento de entrada y quiere mantener la consistencia del documento de salida con la codificación global.

source: FUTURE DIRECTIONS
es: DIRECCIONES FUTURAS

source: One shortcoming of the current TransTractor is that it can't handle translated document containing all languages, like debconf templates, or .desktop files.
es: Una deficiencia del TransTractor actual es que no puede tratar documentos traducidos que contengan todos los idiomas, como las plantillas de debconf, o en los ficheros «.desktop».

source: To address this problem, the only interface changes needed are:
es: Para tratar este problema, los únicos cambios necesarios en la interfaz son:

source: take a hash as po_in_name (a list per language)
es: tomar una tabla hash como po_in_name (una lista por idioma)

source: add an argument to translate to indicate the target language
es: añadir un argumento a «translate» para indicar el idioma de destino

source: make a pushline_all function, which would make pushline of its content for all language, using a map-like syntax:
es: hacer una función pushline_all, que haría un pushline de su contenido para todos los idiomas, usando una sintaxis parecida al map:

source: Will see if it's enough ;)
es: Ya veremos si es suficiente ;)

source: Locale::Po4a::Wml - Convert wml (web markup language) documents from/to PO files
es: Locale::Po4a::Wml - Conversión de documentos wml (web markup language) desde/a ficheros PO.

source: Locale::Po4a::Wml is a module to help the translation of wml documents into other [human] languages. Do not mixup the WML we are speaking about here (web markup language) and the WAP crap used on cell phones.
es: Locale::Po4a::Wml es un módulo que asiste en la traducción de documentación en formato WML a otros lenguajes (humano). No confunda el WML que se trata aquí con la porquería del WAP usado en teléfonos móviles.

source: Please note that this module relies upon the Locale::Po4a::Xhtml module, which also relies upon the Locale::Po4a::Xml module. This means that all tags for web page expressions are assumed to be written in the XHTML syntax.
es: Observe que este módulo depende del módulo Locale::Po4a::Xhtml, el cual depende a su vez del módulo Locale::Po4a::Xml. Esto significa que se supone que todas las etiquetas para las expresiones de páginas web están escritas con sintaxis XHTML.

source: This module works for some simple documents, but is still young. Currently, the biggest issue of the module is probably that it cannot handle documents that contain non-XML inline tags such as <email "foo@example.org">, which are often defined in the Wml. Improvements will be added in the future releases.
es: Este módulo funciona con algunos documentos simples, pero aún es reciente. Actualmente, puede que el mayor problema de este módulo sea que no puede tratar documentos que contienen etiquetas en línea que no son XML tales como <email "foo@ejemplo.org">, que a menudo están definidos en el WML. Experimentará mejoras en versiones futuras.

source: Locale::Po4a::Xhtml - Convert Xhtml documents from/to PO files
es: Locale::Po4a::Xhtml - Conversión de documentos Xhtml desde/a ficheros PO.

source: The goal of the po4a (po for anything) project is to ease translations (and more interestingly, the maintenance of translations) using gettext tools on areas where they were not originally expected like documentation.
es: El objetivo del proyecto po4a («po for all», po para todo) es facilitar la traducción (y más interesante, el mantenimiento de las traducciones) usando las herramientas de gettext en áreas dónde no eran de esperar, como en la documentación.

source: Locale::Po4a::Xhtml is a module to help the translation of Xhtml documents into other [human] languages.
es: Locale::Po4a::Xhtml es un módulo que asiste en la traducción de documentación en el formato Xhtml a otros lenguajes (humanos).

source: Include files specified by an include SSI (Server Side Includes) element (e.g. <!--#include virtual="/foo/bar.html" -->).
es: Incluir ficheros especificados con un elemento include SSI («Server Side Includes»), por ejemplo <!--#include virtual="/foo/bar.html" -->).

source: B<Note:> You should use it only for static files.
es: B<Nota:> Debería usar esto sólo con ficheros estáticos.

source: An additional I<rootpath> parameter can be specified. It specifies the root path to find files included by a B<virtual> attribute.
es: Puede especificar un parámetro I<rootpath> adicional. Ésto especifica la ruta raíz donde encontrar los ficheros incluidos por un atributo I<rootpath>.

source: "It works for me", which means I use it successfully on my personal Web site. However, YMMV: please let me know if something doesn't work for you. In particular, tables are getting no testing whatsoever, as we don't use them.
es: «A mi me funciona», lo que significa que lo uso con éxito en mi sitio Web personal. Aún así, puede ser distinto en su caso. Por favor, infórmame si no funciona en su caso. En particular, tablas, ya que no las revisamos debido a que no las usamos.

source: Copyright (c) 2004 by Yves Rütschlé <po4a@rutschle.net> Copyright (c) 2007-2008 by Nicolas François <nicolas.francois@centraliens.net>
es: Copyright (c) 2004 por Yves Rütschlé <po4a@rutschle.net> Copyright (c) 2007-2008 por Nicolas François <nicolas.francois@centraliens.net>

source: Locale::Po4a::Xml - Convert XML documents and derivates from/to PO files
es: Locale::Po4a::Xml - Conversión de documentos XML y derivados desde/a ficheros PO.
