Repository: elric/deb-l10n
Catalog: po4a-pod-*.po
Languages: es

source: build translated documentation
es: Construir documentación traducida.

source: <command>po4a-build</command> <group> <arg>-f</arg> <arg>--file </arg> <replaceable> FILE</replaceable> </group> <group> <arg>--pot-only</arg> </group>
es: <command>po4a-build</command> <group> <arg>-f</arg> <arg>--file </arg> <replaceable> fichero</replaceable> </group> <group> <arg>--pot-only</arg></group>

source: DESCRIPTION
es: DESCRIPCIÓN

source: <command>po4a-build</command> is intended to make it as easy to produce translated documentation as it can be to produce the current untranslated content.
es: La meta de <command>po4a-build</command> es facilitar la creación de documentación traducida tanto como lo es producir el contenido del mismo sin traducir.

source: When <command>po4a</command> prepares the translated content as POD or DocBook XML, the final documentation can then be built using <command>po4a-build</command>. Both the untranslated and translated content is built as a single process, updating the POT files at the same time.
es: Puede usar la orden <command>po4a-build</command> para construir la documentación final a la vez que <command>po4a</command> prepara el contenido traducido bien como POD o DocBookXML. El contenido ya traducido y sin traducir se generan en un sólo proceso, actualizando los ficheros pot a la vez.

source: Existing build instructions are replaced by a single call to <command>po4a-build</command> and a simple configuration file is used to tell <command>po4a-build</command> how to build each element and which binary packages will include the translated and untranslated content.
es: Puede reemplazar las instrucciones de compilación con una sola invocación a <command>po4a-build</command> y un fichero de configuración, empleado para decir a <command>po4a-build</command> cómo generar cada elemento y qué paquetes binarios incluirán el contenido y sin traducir.

source: Once built, the content will be in package-specific directories beneath the <option>BASEDIR</option> specified in the configuration file. For a binary package foo, with translations into German and French, this would result in:
es: Una vez generado, el contenido estará en los directorios específicos a cada paquete incluidos en <option>BASEDIR</option> (directorio padre) especificado en el fichero de configuración. De usar un paquete binario «foo», con traducciones en alemán y francés, el resultado sería este:

source: This makes it easy to include all the generated content into the binary package with a single install location:
es: Esto facilita incluir todo el contenido generado dentro de los paquetes binarios, con una sola ubicación al instalar.

source: This rule will not need to be updated when new translations are added and adding a second binary package (bar) allows the content for that package to kept separate.
es: No precisa actualizar esta regla al añadir traducciones nuevas, y permite añadir un segundo paquete binario («bar») manteniendo su contenido separado.

source: Supported formats
es: Formatos compatibles

source: Currently, <command>po4a-build</command> supports the following combinations:
es: A día de hoy, <command>po4a-build</command> es compatible con las siguientes combinaciones:

source: Docbook XML for Section 1.
es: DocBook XML para la Sección 1.

source: Docbook XML for Section 3.
es: DocBook XML para la Sección 3.

source: DocBook XML for HTML.
es: DocBook XML para HTML

source: POD for Section 1.
es: POD para la secciones 1.

source: POD for Section 3.
es: POD para la Sección 3.

source: POD for Section 5.
es: POD para la Sección 5.

source: POD for Section 7.
es: POD para la Sección 7.

source: All supported formats, in all supported combinations, can be handled in a single <filename>po4a-build.conf</filename> configuration file and in a single call to <command>po4a-build</command>. See <citerefentry><refentrytitle>po4a-build.conf</refentrytitle><manvolnum>5</manvolnum></citerefentry>.
es: Puede gestionar con un solo fichero de configuración <filename>po4a-build.conf</filename> y una sola invocación de <command>po4a-build</command> todos los formatos compatibles, en todas las combinaciones compatibles. Consulte <citerefentry><refentrytitle>po4a-build.conf</refentrytitle><manvolnum>5</manvolnum></citerefentry>.

source: CONFIGURATION
es: CONFIGURACIÓN

source: <command>po4a-build</command> uses a default configuration file, <filename>po4a-build.conf</filename> which should be in the top level directory of your package VCS. (Use the <option>-f</option> option to specify a different file.) See <citerefentry><refentrytitle>po4a-build.conf</refentrytitle><manvolnum>5</manvolnum></citerefentry>.
es: Por omisión, <command>po4a-build</command> usa un fichero de configuración, <filename>po4a-build.conf</filename>, el cual debería estar en el directorio superior de su paquete VCS. (Use la opción <option>-f</option> para especificar un fichero diferente.) Consulte <citerefentry><refentrytitle>po4a-build.conf</refentrytitle><manvolnum>5</manvolnum></citerefentry>.

source: example configuration file
es: Ejemplo de fichero de configuración.

source: An example configuration file is available at:
es: Dispone de un ejemplo de fichero de configuración en:

source: configuration file layout
es: Partes del fichero de configuración.

source: The configuration file consists of several sections, general, XML/XSL support, POD support and HTML support.
es: El fichero de configuración consiste de varias secciones: general, compatibilidad con XML/XSL, POD y HTML.

source: General includes the name and location of the po4a config file (probably best to leave this as <filename>po4a.config</filename>), the po directory containing the documentation PO files (often <filename>doc/po</filename>), the full name of the POT file used to create the translations, the BASEDIR for the generated output, whether the package contains manpages in section 3 rather than just section 1 and the names of the binary packages which are to contain the generated output.
es: La sección general incluye el nombre y ubicación del fichero de configuración de po4a (quizá sea mejor nombrarlo <filename>po4a.config</filename>), el directorio de ficheros po que contiene la documentación en formato po, (a menudo <filename>doc/po</filename>), el nombre completo del fichero pot empleado para generar las traducciones, el BASEDIR para la salida generada, si el paquete contiene páginas de manual en la sección 3, en lugar de sólo en la sección 1, y los nombres de los paquetes binarios que contendrán la salida generada.

source: XML/XSL support includes specifying which of the binary packages use XSL support in the XMLPACKAGES variable, the top level DocBook file to pass to <command>xsltproc</command> and the location of the XML or Docbook files. The XSLFILE can be overridden, if necessary.
es: La compatibilidad con XML incluye especificar qué paquetes binarios usan compatibilidad con XSL, a través de la variable XMLPACKAGES. También debe especificar el fichero de DocBook en el nivel superior para introducirlo a <command>xsltproc</command>, y la ubicación de los ficheros XML o DocBook. De ser necesario, puede invalidar XSLFILE.

source: POD support includes specifying which of the binary packages use POD support in the PODPACKAGES variable and the full name of the POD file.
es: La compatibilidad con POD incluye especificar qué paquetes binarios usan compatibilidad con POD, a través de la variable PODPACKAGES y el nombre completo del fichero POD.

source: HTML support specifies the subdirectory to create below BASEDIR for the untranslated and translated HTML content and the DocBook file to generate the HTML. The HTMLXSL file can be overridden, if necessary.
es: Para obtener compatibilidad con HTML, tendrá que especificar el sub-directorio a crear, por debajo de BASEDIR, para el HTML traducido y sin traducir, y el fichero DocBook para generar el HTML. Puede invalidar el fichero HTMLXSL, de ser necesario.

source: COMMANDS
es: ÓRDENES

source: Only updates the POT file(s). <option>--pot-only</option> is intended to support packages including all POT files in the package source. Packages using autotools can easily add the POT file via EXTRA_DIST but packages just using a Makefile or certain VCS build helpers can find it awkward to add the POT file (which is a generated file) without putting the POT file into the VCS. To avoid this ugly and unnecessary work, <command>po4a-build</command> can update the POT file(s) at the start of the build, so that <command>dpkg-source</command> includes them into the source tarball.
es: Sólo actualizar uno o varios ficheros POT. La opción <option>--pot-only</option> está diseñada para ofrecer compatibilidad con paquetes que incluyen todos los ficheros POT en el paquete de fuentes. Aquellos paquetes que usan autotools pueden añadir el fichero POT a través de EXTRA_DIST, pero aquellos paquetes que emplean un makefile, o algunos asistentes de compilación de sistemas de control de versiones, encontrarán raro añadir el fichero POT (que es un fichero generado) sin poner el fichero POT en el sistema de control de versiones.

source: svn-buildpackage example
es: Ejemplo de svn-buildpackage.

source: <command>svn-buildpackage</command> has explicit support for this kind of addition, using the <option>useNativeDist</option> SVN property and the <option>native-dist</option> Make target.
es: <command>svn-buildpackage</command> tiene compatibilidad explícita para esta clase de añadidos, usando la propiedad <option>useNativeDist</option> de SVN y el «target» de Make <option>native-dist</option>.

source: # adds the POT file to the source tarball native-dist: Makefile po4a-build --pot-only
es: # añade el fichero pot al tarball de fuentes. native-dist: Makefile po4a-build --pot-only

source: print the usage message and exit.
es: Mostrar el mensaje de uso y salir.

source: OPTIONS
es: OPCIONES

source: <option>-f</option>|<option>--file</option><replaceable> FILE</replaceable>
es: <option>-f</option>|<option>--file</option><replaceable> fichero</replaceable>

source: Override the <command>po4a-build</command> default configuration file (<filename>po4a-build.conf</filename>) and supply your own.
es: Invalidar el fichero de configuración de <command>poa-build</command> (<filename>po4a-build.conf</filename>)e introducir otro.

source: Author
es: Autor

source: <command>po4a-build</command> was written by Neil Williams <email>codehelp@debian.org</email>.
es: <command>po4a-build</command> fue creado por Neil Williams <email>codehelp@debian.org</email>.

source: This manual page was written by Neil Williams <email>codehelp@debian.org</email>
es: Neil Williams escribió esta página de manual. <email>codehelp@debian.org</email>

source: <date>2006-04-08</date>
es: <date>08/04/2006</date>

source: Po4a Tools
es: Herramientas de po4a

source: display a translated man page according to a PO
es: Mostrar una página de manual traducida de acuerdo a un fichero po.

source: <command>po4aman-display-po</command> <arg choice='plain'>-p </arg> <arg choice='plain'><replaceable>PO_FILE</replaceable></arg> <arg choice='opt'><arg choice='plain'>-m </arg><arg choice='plain'><replaceable>MASTER_FILE</replaceable></arg></arg> <arg choice='opt'><arg choice='plain'>-o </arg><arg choice='plain'><replaceable>PO4A_OPT</replaceable></arg></arg>
es: <command>po4aman-display-po</command> <arg choice='plain'>-p </arg> <arg choice='plain'><replaceable>fichero_po</replaceable></arg> <arg choice='opt'><arg choice='plain'>-m </arg><arg choice='plain'><replaceable>fichero_original</replaceable></arg></arg> <arg choice='opt'><arg choice='plain'>-o </arg><arg choice='plain'><replaceable>opciones_po4a</replaceable></arg></arg>

source: <command>po4aman-display-po</command> can be used by a translator who wants to check how the man page being translated in a PO will be displayed.
es: El traductor puede usar <command>po4aman-display-po</command> para revisar como se verá una página de manual que está traduciendo con un fichero po.

source: The manual page must be in one of the formats supported by the po4a's <emphasis remap='I'>man</emphasis> module. The manual page can be provided on the command line, or installed on the system.
es: La página de manual debe tener uno de los formatos compatibles con el módulo de <emphasis remap='I'>man</emphasis> de po4a. Puede introducir la página de manual en la línea de órdenes, o que esté instalada en el sistema.

source: Manual pages generated from other formats, like docbook or pod, are not supported. See <citerefentry><refentrytitle>po4apod-display-po</refentrytitle><manvolnum>1</manvolnum></citerefentry> for an equivalent supporting <emphasis remap='I'>pod</emphasis> documents.
es: No son compatibles aquellas páginas de manual en otro formato, como docbook o pod. Véase <citerefentry><refentrytitle>po4apod-display-po</refentrytitle><manvolnum>1</manvolnum></citerefentry> para una orden similar compatible con documentos <emphasis remap='I'>pod</emphasis>.

source: <option>-p </option><replaceable>PO_FILE</replaceable>
es: <option>-p </option><replaceable>fichero_po</replaceable>

source: The PO file containing the translations.
es: El fichero po que contiene las traducciones.

source: <option>-m </option><replaceable>MASTER_FILE</replaceable>
es: <option>-m </option><replaceable>fichero_original</replaceable>

source: The original man page. It can be the absolute or relative path to the original man page (gzipped or not), the name the man page or the name and section of the man page (using the man.section format). When the master document is not provided with the <option>-m</option> option, <command>po4aman-display-po</command> tries to find the original man page based on the line reference of the first string in the PO.
es: La página de manual original. Puede usar la ruta absoluta o relativa de la página de manual original (en un fichero .gz o no), el nombre de la página de manual o el nombre y la sección de la página de manual (usando el formato «man.section»). Si no introduce la página de manual con la opción <option>-m</option>, <command>po4aman-display-po</command> intentará encontrar la página de manual original a través de la línea de referencia, presente en la primera cadena del fichero po.

source: <option>-o </option><replaceable>PO4A_OPT</replaceable>
es: <option>-o </option><replaceable>opciones_de_po4a</replaceable>

source: Some options to pass to <citerefentry><refentrytitle>po4a-translate</refentrytitle><manvolnum>1</manvolnum></citerefentry>.
es: Algunas opciones que puede introducir a <citerefentry><refentrytitle>po4a-translate</refentrytitle><manvolnum>1</manvolnum></citerefentry>.

source: SEE ALSO
es: VÉASE TAMBIÉN

source: AUTHOR
es: AUTOR

source: <date>2009-03-16</date>
es: <date>16/03/2009</date>

source: man display of a translated pod file according to a PO
es: Mostrar una página de manual de un fichero pod traducido de acuerdo a un po.

source: <command>po4apod-display-po</command> <arg choice='plain'>-p </arg> <arg choice='plain'><replaceable>PO_FILE</replaceable></arg> <arg choice='plain'>-m </arg> <arg choice='plain'><replaceable>POD_FILE</replaceable></arg> <arg choice='opt'><arg choice='plain'>-o </arg><arg choice='plain'><replaceable>PO4A_OPT</replaceable></arg></arg>
es: <command>po4apod-display-po</command> <arg choice='plain'>-p </arg> <arg choice='plain'><replaceable>fichero_po</replaceable></arg> <arg choice='plain'>-m </arg> <arg choice='plain'><replaceable>fichero_pod</replaceable></arg> <arg choice='opt'><arg choice='plain'>-o </arg><arg choice='plain'><replaceable>opciones_de_po4a</replaceable></arg></arg>

source: <command>po4apod-display-po</command> can be used by a translator who wants to check how the man page, generated from a pod file, being translated in a PO will be displayed. Generally, pod file is only available in source package or embedded in Perl script.
es: El traductor puede usar <command>po4apod-display-po</command> para revisar como se verá una página de manual traducida en un po al generarse desde un fichero pod. Generalmente, el fichero pod sólo está disponible en el paquete de fuentes o integrado en un script de Perl.

source: <option>-m </option><replaceable>POD_FILE</replaceable>
es: <option>-m </option><replaceable>fichero_pod</replaceable>

source: The original pod file used by po4a to generate PO file.
es: El fichero pod original que po4a usará para generar el fichero po.

source: NAME
es: NOMBRE

source: po4a - update both the po files and translated documents in one shot
es: po4a - Actualizar los ficheros po y los documentos traducidos a la vez

source: SYNOPSIS
es: SINOPSIS

source: po4a [options] E<lt>config_fileE<gt>
es: po4a [opciones] E<lt>fichero_de_configuraciónE<gt>

source: The po4a (po for anything) project goal is to ease translations (and more interestingly, the maintenance of translations) using gettext tools on areas where they were not expected like documentation.
es: El objetivo del proyecto po4a («po for all», po para todo) es facilitar la traducción (y más interesante, el mantenimiento de las traducciones) usando las herramientas de gettext en áreas donde no eran de esperar, como en la documentación.

source: The B<po4a> program is useful if you want to avoid calling L<po4a-gettextize(1)>, L<po4a-updatepo(1)>, and L<po4a-translate(1)> in complex Makefiles when you have multiple files to translate, different format, or need to specify different options for different documents.
es: El programa B<po4a> es útil cuando no desea invocar L<po4a-gettextize(1)>, L<po4a-updatepo(1)>, y L<po4a-translate(1)> a través de complejos ficheros Makefile cuando tiene varios ficheros a traducir, diferentes formatos o necesita especificar diferentes opciones para ciertos documentos.

source: Table of content
es: Tabla de contenidos

source: This document is organized as follow:
es: Este documento está organizado de la siguiente forma:

source: INTRODUCTION
es: INTRODUCCIÓN

source: CONFIGURATION FILE SYNTAX
es: SINTAXIS DEL FICHERO DE CONFIGURACIÓN

source: Specifying the template languages
es: Especificar las plantillas de idiomas

source: Specifying the paths to translator inputs
es: Especificar las rutas a las entradas del traductor

source: Autodetection of the paths and languages
es: Auto-detección de las rutas e idiomas

source: Specifying the documents to translate
es: Especificar los documentos a traducir

source: Specifying options for the modules
es: Especificar las opciones de los módulos

source: Specifying aliases
es: Especificar alias

source: Split mode
es: Modo dividido

source: SHORTCOMINGS
es: DEFICIENCIAS

source: AUTHORS
es: AUTORES

source: COPYRIGHT AND LICENSE
es: DERECHO DE COPIA Y LICENCIA

source: The B<po4a> program is in charge of updating both the po files (to sync them to the original documents) and the translated documents (to sync them to the po files). The main point is to make the use of po4a easier without having to remember of the command line options.
es: El programa B<po4a> se encarga de actualizar los ficheros po (para sincronizarlos con los documentos originales) y los documentos traducidos (para sincronizarlos con los ficheros po). El objetivo es simplificar el uso de po4a sin tener que recordar las opciones de línea de órdenes.

source: It also allows you to mix documents having different formats into the same pot file so that you can have only one such file per project.
es: También le permite mezclar documentos en diferentes formatos en el mismo fichero pot, de manera que puede tener un solo fichero por proyecto.

source: This behaviour can be mimicked by the other tools of the po4a suite (for example with makefiles), but it is rather difficult to do, and exhausting to redo the same complicated makefiles for each project using po4a.
es: Este comportamiento se puede imitar con las otras herramientas del paquete po4a (por ejemplo con ficheros «MAKEFILE»), pero es bastante difícil y agotador el tener que rehacer los mismos ficheros para cada proyecto que utilice po4a.

source: The dataflow can be summarized as follow. Any changes to the master document will be reflected in the po files, and all changes to the po files (either manual or caused by previous step) will be reflected in translation documents.
es: La corriente de datos se puede resumir de la siguiente manera. Todo cambio al documento original quedará reflejado en los ficheros po, y todo cambio en los ficheros po (bien manual o causado por el paso anterior) quedará reflejado en los documentos traducidos.

source: The dataflow cannot be inversed in this tool, and changes in translations are overwritten by the content of the po files. As a matter of fact, this tool cannot be used to convert existing translations to the po4a system. For that task, please refer to L<po4a-gettextize(1)>.
es: No se puede invertir el flujo de datos con esta herramienta, y el contenido de los ficheros po sobreescribirá los cambios en las traducciones. De hecho, no puede usar esta herramienta para convertir traducciones existentes al sistema de po4a. Para ello, véase L<po4a-gettextize(1)>.

source: The (mandatory) argument is the path to the configuration file to use. Its syntax aims at being simple and close to the configuration files used by the intl-tools projects.
es: El argumento (obligatorio) es la ruta del fichero de configuración a usar. Su sintaxis intenta ser simple y parecida a la de los ficheros de configuración usados por los proyectos intl-tools.

source: Comments in this files are noted by the char '#'. It comments everything until the end of the line. Lines can be continued by escaping the end of line. All non blank lines must begin with a [] command, followed by its arguments. (sound difficult said that way, but it is rather easy, I hope ;)
es: Los comentarios en estos ficheros se indican con el carácter «#». Esto lo comenta todo hasta el final de línea. Las líneas se pueden continuar escapando el final de línea. Todas las líneas con contenido deben empezar con una orden [], seguida por sus argumentos. (Suena difícil dicho así, pero es más bien fácil, espero ;).

source: B<Note:> It is recommended to use [po_directory] rather than [po4a_langs] and [po4a_paths]. See section B<Autodetection of the paths and languages> below.
es: B<Nota:> Recomendamos usar «[po_directory]» en lugar de [po4a_langs] y [po4a_paths]. Consulte la sección B<Auto-detección de las rutas e idiomas>.

source: This is an optional command that can simplify the whole config file, and will make it more scalable. You have to specify a list of the languages in which you want to translate the documents. This is as simple as:
es: Esta es una orden opcional que puede simplificar todo el fichero de configuración, y lo hará más escalable. Debe especificar una lista de los idiomas a los que desee traducir los documentos. Es así de simple:

source: This will enable you to expand $lang to all the specified languages in the rest of the config file.
es: Esto le permitirá expandir «$lang» a todos los idiomas especificados en el resto del fichero de configuración.

source: First, you have to specify where the translator input files (ie, the files used by translators to do their job) are located. It can be done by such a line:
es: Primero debe especificar dónde están los ficheros de entrada del traductor (es decir, los ficheros que utilizan los traductores para hacer su trabajo). Esto se puede hacer con una línea así:

source: The command is thus 'po4a_paths'. The first argument is the path to the pot file to use. All subsequent arguments are of the self-explanatory form:
es: Por ello, la orden es «po4a_paths». El primer argumento es la ruta del fichero pot a usar. Todos los argumentos posteriores tienen la siguiente forma, que se explica por si sola:
