Repository: elric/deb-l10n
Catalog: po4a-pod-*.po
Languages: es

source: <lang>:<path to the po file for this lang>
es: <idioma>:<ruta al fichero po de este idioma>

source: If you've defined the template languages, you can rewrite the line above this way:
es: Si ha definido la plantilla de idiomas, puede reescribir la linea anterior así:

source: [po4a_paths] doc/l10n/project.doc.pot $lang:doc/l10n/$lang.po
es: [po4a_paths] doc/l10n/proyecto.doc.pot $lang:doc/l10n/$lang.po

source: You can also use $master to refer to the document basename. In this case, po4a will use a split mode: one POT and one PO (for each language) will be created for each document specified in the po4a configuration file. See the B<Split mode> section.
es: También puede usar «$master» para referirse al nombre base del documento. En este caso po4a usará un modo dividido: se creará un pot y un po (por cada idioma) con cada documento especificado en el fichero de configuración de po4a. Véase la sección B<Modo dividido> («Split Mode»).

source: Another command can be used to specify the name of a directory where the PO and POT files are located. When it is used, po4a will detect the POT file as the only "*.pot" file from the specified directory. Po4a will also use the list of "*.po" files to define the list of languages (by stripping out the extension). These languages will be used for the substitution of the $lang variable in the rest of the configuration file.
es: Puede usar otra orden para especificar el nombre del directorio donde se ubican los ficheros POT y PO. Si se usa, po4a detectará el fichero POT como el único fichero «*.pot» en el directorio especificado. po4a usará también la lista de ficheros «*.po» para definir la lista de idiomas (eliminando la extensión). Estos idiomas se usarán como sustitución de la variable «$lang» en el resto del fichero de configuración.

source: This command should not be used together with the po4a_langs or po4a_paths commands.
es: No debería usar esta orden en combinación con las órdenes «po4a_langs» o «po4a_paths».

source: When using this command, you have to create an empty POT file on the first invocation of po4a to let it know the name of the POT file.
es: Al usar esta orden, tiene que crear un fichero pot vacío al ejecutar po4a por primera vez, para así hacerle saber el nombre del fichero pot.

source: You now naturally have to specify which documents are translated, their format, and where to put the translations. It can be made by such lines:
es: Naturalmente, debe especificar qué documentos están traducidos, su formato, y dónde guardar sus traducciones. Se puede hacer con líneas como las siguientes:

source: This should be rather self-explanatory also. Note that in the second case, doc/l10n/script.fr.add is an addendum to add to the French version of this document. Please refer to po4a(7) for more information about the addenda.
es: Esto también debería explicarse por si mismo. Tenga en cuenta que en el segundo caso, «doc/l10n/script.fr.add» es un apéndice a añadir a la versión francesa del documento. Consulte po4a(7) para más información sobre los apéndices.

source: More formally, the format is:
es: Más formalmente, el formato es:

source: [type: <format>] <master_doc> (<lang>:<localized_doc>)* \ (add_<lang>:<modifiers>*<addendum_path>)*
es: [type: <formato>] <doc_principal> <idioma>:<doc_traducido>* add_<idioma>:<argumentos>*<ruta_al_apéndice>*

source: If there is no modifier, I<addendum_path> is a path to an addendum. Modifiers are
es: De no existir argumentos, I<ruta_al_apéndice> es la ruta a un apéndice. Los modificadores son

source: Include I<addendum_path> if this file does exist, otherwise do nothing.
es: Incluir I<ruta_al_apéndice> si el fichero existe, y no hacer nada de lo contrario.

source: I<addendum_path> is not a regular addendum but a file containg a list of addenda, one by line. Each addendum may be preceded by modifiers.
es: I<ruta_al_apéndice> no es un apéndice normal, sino un fichero que contiene una lista de apéndices, uno por línea. Cada apéndice puede ir precedido de argumentos.

source: I<addendum_path> is discarded, it is not loaded and will not be loaded by any further addendum specification.
es: Si I<ruta_al_apéndice> se descarta, no se cargará, independientemente de cualquier especificación adicional referida al apéndice.

source: If all the languages had addenda with similar paths, you could also write something like:
es: Si todos los idiomas tienen apéndices con rutas similares, puede también escribir algo así.

source: po4a accepts options that will be passed to the module. These options are module specific and are specified with the -o switch.
es: po4a acepta opciones, que se pasan al módulo. Estas opciones son específicas a cada módulo y definidas con la opción «-o».

source: If you need a specific option for one of the document you want to translate, you can also specify it in the configuration file. Options are introduced by the I<opt> keyword. The argument of the I<opt> keyword must be quoted with double quotes if it contains a space (e.g. if you specify multiple options, or an option with an argument). You can also specify options that will only apply to a specific language by using the opt_I<lang> keyword.
es: Si precisa de una opción en particular para uno de los documentos que desea traducir, también puede especificarla en el fichero de configuración. Las opciones se introducen con la palabra clave I<opt>. Debe entrecomillar el argumento de la palabra clave I<opt> si éste contiene un espacio (p. ej., si especifica varias opciones, y o una opción con un argumento). Puede también especificar opciones qué solo afectan a un idioma en particular mediante la palabra clave opt_I<lang>.

source: Here is an example: [type:man] data-05/test2_man.1 $lang:tmp/test2_man.$lang.1 \ opt:"-k 75" opt_it:"-L UTF-8" opt_fr:-v
es: Este es un ejemplo: [type:man] data-05/test2_man.1 $lang:tmp/test2_man.$lang.1 \ opt:"-k 75" opt_it:"-L UTF-8" opt_fr:-v

source: Arguments may contain spaces if you use single quotes or escaped double quotes: [po4a_alias:man] man opt:"-o \"mdoc=NAME,SEE ALSO\" -k 20"
es: Los argumentos pueden contener espacios si usa comillas simples o unas comillas normales con un escape: [po4a_alias:man] man opt:"-o \"mdoc=NAME,SEE ALSO\" -k 20"

source: If you want to specify the same options for many documents, you may want to use an alias (see the B<Specifying aliases> section below).
es: Si desea especificar las mismas opciones para varios documentos, puede que quiera usar un alias (véase a continuación la sección B<Especificar alias>).

source: You can also set options for all the documents specified in the configuration file: [options] opt:"..." opt_fr:"..."
es: También puede definir opciones para todos los documentos especificados en el fichero de configuración: [options] opt:"..." opt_fr:"..."

source: If you must specify the same options for multiple files, you may be interested in defining a module alias. This can be done this way:
es: Si tiene que especificar las mismas opciones para varios ficheros, puede que le interese definir un alias de módulo. Puede hacer esto de la siguiente forma:

source: This define a module alias named I<test>, based on the I<man> module, with the I<-k 21> apply to all the languages and with I<-o debug=splitargs> applied to the Spanish translation.
es: Esto define un alias de módulo llamado I<test>, basado en el módulo <man>, I<-k 21> afectando a todos los idiomas y con I<-o debug=splitargs>, que sólo afectará a la versión en español.

source: This module alias can then be use like a regular module:
es: Este alias de módulo se puede usar como un módulo normal:

source: Note that you can specify additional options on a per file basis.
es: Observe que puede especificar opciones adicionales de manera individual.

source: The split mode is used when $master is used in the [po4a_paths] line.
es: El modo dividido se usa cuando «$master» aparece en la línea de [po4a_paths].

source: When the split mode is used, a temporary big POT and temporary big POs are used. This permits to share the translations between all the POs.
es: Mientras esté en uso el modo dividido, se usarán unos grandes POT y PO temporales. Esto permite compartir las traducciones entre todos los PO.

source: If two POs have different translations for the same string, po4a will mark this string as fuzzy and will submit both translations in all the POs which contain this string. Then, when a translator updates the translation and removes the fuzzy tag in one PO, the translation of this string will be updated in every POs automatically.
es: Si dos PO tienen diferentes traducciones de la misma cadena, po4a marcará esta cadena como borrosa y mandará ambas traducciones a todos los PO que contengan está cadena. Entonces, cuando un traductor actualice la traducción, y elimina la etiqueta de cadena borrosa («fuzzy») en un PO, se actualizará automáticamente la traducción de esta cadena en cada PO.

source: Minimal threshold for translation percentage to keep (ie, write) the resulting file (default: 80). Ie, by default, files have to be translated at at least 80% to get written.
es: El umbral mínimo del porcentaje de traducción para mantener (es decir, escribir) el fichero resultante (defecto: 80). Es decir, por omisión los ficheros deben estar traducidos como mínimo en un 80% para que se escriba el resultado.

source: Show a short help message.
es: Mostrar un mensaje corto de ayuda.

source: Charset of the files containing the documents to translate. Note that all master documents must use the same charset for now. This is a known limitation, and we are working on solving this.
es: El juego de caracteres de los ficheros que contienen los documentos a traducir. Tenga en cuenta que por ahora todos los documentos originales deben usar el mismo juego de caracteres. Esta es una limitación conocida, y estamos trabajando para solucionarla.

source: Charset of the files containing the localized documents. Note that all translated documents will use the same charset for now. This is a known limitation, and we are working on solving this.
es: El juego de caracteres de los ficheros que contienen los documentos traducidos. Tenga en cuenta que por ahora todos los documentos traducidos deben usar el mismo juego de caracteres. Esta es una limitación conocida, y estamos trabajando para solucionarla.

source: Charset of the addenda. Note that all the addenda should be in the same charset.
es: El juego de caracteres del apéndice. Todos los apéndices deben usar el mismo juego de caracteres.

source: Display the version of the script and exit.
es: Mostrar la versión del script y cerrar.

source: Increase the verbosity of the program.
es: Aumentar la cantidad de mensajes informativos del programa.

source: Decrease the verbosity of the program.
es: Disminuir la cantidad de mensajes informativos del programa.

source: Output some debugging information.
es: Devolver información de depuración fallos.

source: Extra option(s) to pass to the format plugin. Specify each option in the 'name=value' format. See the documentation of each plugin for more information about the valid options and their meanings.
es: Opción(es) adicionales que pasar a la extensión del formato. Especifique cada opción en el formato 'nombre=valor'. Véase la documentación de cada extensión para más información acerca de las opciones válidas y sus significados.

source: Always generate the POT and PO files, even if po4a considers it is not necessary.
es: Generar siempre los ficheros POT y POT, incluso si po4a no lo considera necesario.

source: The default behavior (when --force is not specified) is the following:
es: El comportamiento predeterminado (cuando no se especifica --force) es el siguiente:

source: If the POT file already exists, it is regenerated if a master document or the configuration file is more recent. The POT file is also written in a temporary document and po4a verifies that the changes are really needed.
es: Si ya existe el fichero POT, se generará otra vez si el documento original o el fichero de configuración es más reciente. El fichero POT se escribe también en un documento temporal y po4a revisa si los cambios son realmente necesarios.

source: Also, a translation is regenerated only if its master document, the PO file, one of its addenda or the configuration file is more recent. To avoid trying to regenerate translations which do not pass the threshold test (see B<--keep>), a file with the '.po4a-stamp' extension can be created (see B<--stamp>).
es: Así mismo, una traducción se genera otra vez sólo si el documento original, el fichero PO, una de sus apéndices o el fichero de configuración son más recientes. Para evitar generar nuevamente las traducciones que no pasan el umbral del examen (véase B<--keep>), puede crear un fichero con la extensión '.po4a-stamp' (véase <B--stamp>).

source: If a master document includes files, you should use the B<--force> flag because the modification time of these included files are not taken into account.
es: Debería usar la marca B<--force> si el documento original incluye ficheros, ya que no se toma en cuenta la fecha de modificación de estos ficheros incluidos.

source: The PO files are always re-generated based on the POT with B<msgmerge -U>.
es: Los ficheros PO se generan otra vez en base al POT con B<msgmerge -U>.

source: Tells po4a to create stamp files when a translation is not generated because it does not reach the threshold. These stamp files are named according to the expected translated document, with the I<.po4a-stamp> extension.
es: Activar la creación de ficheros de marcas cuando no se ha generado una traducción al no alcanzar éste el umbral. Estos ficheros de marcas se nombran de acuerdo al documento traducido esperado, con la extensión I<.po4a-stamp>.

source: Note: This only activates the creation of the I<.po4a-stamp> files. The stamp files are always used if they exist, and they are removed with B<--rm-translations> or when the file is finally translated.
es: Nota: Esto sólo activa la creación de ficheros I<.po4a-stamp>. En caso de existir siempre se usarán estos ficheros, y se eliminan con B<--rm-translations> o cuando el fichero está completamente traducido.

source: Do not generate the translated documents, only update the POT and PO files.
es: No generar los documentos traducidos, pero solo actualizar los ficheros POT y PO.

source: Remove the translated files (implies --no-translations).
es: Eliminar los ficheros traducidos (implica «--no-translations»).

source: Do not generate the .po~ backup files.
es: No generar los las copias de seguridad «.po~».

source: Remove the .po~ backup files (implies --no-backups).
es: Eliminar las copias de seguridad «.po~» (implica «--no-backups»).

source: --variable I<var>=I<value>
es: --variable I<var>=I<valor>

source: Define a variable that will be expanded in the po4a configuration file. Every occurrence of I<$(var)> will be replaced by I<value>. This option can be used multiple times.
es: Definir una variable que se expandirá en el fichero de configuración de po4a. Cada aparición de I<$(var)> se reemplazará por I<valor>. Puede introducir está opción varias veces.

source: Set the report address for msgid bugs. By default, the created POT files have no Report-Msgid-Bugs-To fields.
es: Definir el destinatario de los informas de fallo de los msgid. Por omisión, los ficheros POT creados no tienen el campo «Report-Msgid-Bugs-To».

source: Set the copyright holder in the POT header. The default value is "Free Software Foundation, Inc."
es: Definir el propietario del copyright en la cabecera del POT. El valor predeterminado es «Free Software Foundation, Inc».

source: Set the package name for the POT header. The default is "PACKAGE".
es: Definir el nombre del paquete en la cabecera del POT. El valor por omisión es «PACKAGE».

source: Set the package version for the POT header. The default is "VERSION".
es: Definir la versión del paquete en la cabecera del POT. El valor por omisión es «VERSION».

source: --msgmerge-opt options
es: --msgmerge-opt opciones

source: Extra options for msgmerge.
es: Opciones adicionales para msgmerge.

source: Note: $lang will be extended to the current language.
es: Nota: $lang se expandirá al idioma presente.

source: This option removes '--previous' from the options passed to msgmerge. This permits to support versions of gettext earlier than 0.16.
es: Esta opción añade «--previous» a las opciones introducidas a msgmerge. Esto permite la compatibilidad con versiones de gettext anteriores a 0.16.

source: This option adds '--previous' to the options passed to msgmerge. It requires gettext 0.16 or later, and is activated by default.
es: Esta opción añade «--previous» a las opciones introducidas a msgmerge. Requiere gettext 0.16 o posterior, y está activada por omisión.

source: Set the base directory for all input documents specified in the po4a configuration file.
es: Definir el directorio base de todos los documentos de entrada especificados en el fichero de configuración de po4a.

source: Set the base directory for all the output documents specified in the po4a configuration file.
es: Definir el directorio base de todos los documentos de salida especificados en el fichero de configuración de po4a.

source: Duplicates some code with the po4a-* programs.
es: Dúplica el código de algunos de los programas po4a-*.

source: Patch welcome ;)
es: Los parches son bienvenidos ;)

source: Copyright 2002, 2003, 2004 by SPI, inc.
es: Copyright 2002, 2003, 2004 por SPI, inc.

source: This program is free software; you may redistribute it and/or modify it under the terms of GPL (see the COPYING file).
es: Esto es software libre; puede redistribuirlo y/o modificarlo bajo las condiciones de la licencia GPL (véase el fichero COPYING).

source: po4a-gettextize - convert an original file (and its translation) to a po file
es: po4a-gettextize - Conversión de un fichero original (y su traducción) a un fichero po.

source: po4a-gettextize -f E<lt>fmtE<gt> -m E<lt>master.docE<gt> [-l E<lt>XX.docE<gt>] -p E<lt>XX.poE<gt>
es: po4a-gettextize -f E<lt>formatoE<gt> -m E<lt>principal.docE<gt> [-l E<lt>XX.docE<gt>] -p E<lt>XX.poE<gt>

source: (XX.po is the output, all others are inputs)
es: (XX.po es la salida, todos los otros son entrada)

source: The C<po4a-gettextize> script is in charge of converting documentation files to po files. If you start a new translation, C<po4a-gettextize> will extract the translatable strings from the documentation file and write a pot file from it.
es: El script C<po4a-gettextize> se ocupa de la conversión de los ficheros de documentación a ficheros po. Si empieza una nueva traducción, C<po4a-gettextize> extraerá las cadenas traducibles del fichero de documentación y escribirá un fichero pot con ello.

source: If you already have a translated file, C<po4a-gettextize> will try to extract the translations it contains and put them in place in the written po file. Be warned that very few intelligence is used in this process: the Nth string of the translated file is supposed to be the translation of the Nth string in the original. If it's not the case, you're dead. That's why it is very important that both files share exactly the same structure.
es: Si ya tiene un fichero traducido, C<po4a-gettextize> intentará extraer las traducciones que contiene y ponerlas en su sitio en el fichero po de salida. Tenga en cuenta que este proceso es muy poco inteligente: la enésima cadena del fichero traducido se toma como la traducción de la enésima cadena del original. Si no es el caso, está muerto. Es por eso que es muy importante que ambos ficheros compartan la misma estructura.

source: However, C<po4a-gettextize> will diagnose your death by detecting any desynchronisation between files, and reporting where they occur. In that case, you should edit manually the files to solve the reported disparity. Even if no error were reported, you should check carefully that the generated po file is correct (ie, that each msgstr is the translation of the associated msgid, and not the one before or after).
es: A pesar de todo, C<po4a-gettextize> diagnosticará su muerte detectando cualquier asincronía entre ficheros, y le informará de dónde se producen. En ese caso, deberá editar manualmente los ficheros para solucionar la disparidad mostrada. Aunque no se informe de ningún error, compruebe detalladamente que el fichero po generado es correcto (p.ej., que cada msgstr es la traducción del msgid asociado, y no del anterior o el siguiente).

source: Even if the script manages to do its job without any apparent problem, it still marks all extracted translations as fuzzy, to make sure that the translator will have a look at them, and detect any remaining problem.
es: Aunque parezca que el script hace su labor sin problemas aparentes, este marcará las traducciones extraídas como borrosas, para asegurar que el traductor le eche un vistazo, y pueda detectar cualquier problema residual.

source: If the master document has non-ascii characters, the new generated po file will be in utf-8, in order to allow non-standard characters in a culture independent way. Else (if the master document is completely in ascii), the generated po will use the encoding of the translated input document.
es: Si el documento original contiene caracteres no-ascii, el fichero po generado estará en utf-8, para permitir los caracteres no estándar de una forma independiente de la cultura. De no ser así (si el documento original está completamente en ascii), el fichero po generado utilizará la codificación del documento traducido de entrada.

source: Format of the documentation you want to handle. Use the --help-format option to see the list of available formats.
es: El formato de la documentación que desea tratar. Use la opción «--help-format» para ver la lista de los formatos disponibles.

source: File containing the master document to translate. You can use this option multiple times if you want to gettextize multiple documents.
es: El fichero que contiene el documento original a traducir. Puede usar esta opción varias veces se desea gettextizar varios documentos.

source: Charset of the file containing the document to translate.
es: El juego de caracteres del fichero que contiene el documento a traducir.

source: File containing the localized (translated) document. If you provided multiple master files, you may wish to provide multiple localized file by using this option more than once.
es: El fichero que contiene el documento localizado (traducido). Si introdujo varios documentos originales, puede que desee introducir varios documentos localizados, usando esta opción más de una vez.

source: Charset of the file containing the localized document.
es: El juego de caracteres del fichero que contiene la versión localizada del documento.

source: File where the message catalog should be written. If not given, the message catalog will be written to the standard output.
es: El fichero dónde se deberá grabar el catálogo de mensajes. Si no se proporciona, el catálogo de mensajes se escribirá por la salida estándar.

source: List the documentation format understood by po4a.
es: Lista los formatos de documentación reconocidos por po4a.

source: po4a-normalize - normalize a documentation file by parsing it in po4a, and writing it back
es: po4a-normalize - Normalizar un fichero de documentación analizándolo con po4a, y volver a escribirlo.

source: po4a-normalize -f E<lt>fmtE<gt> E<lt>master.docE<gt>
es: po4a-normalize -f E<lt>formatoE<gt> E<lt>principal.docE<gt>
