Repository: elric/deb-l10n
Catalog: qmail.po
Languages: es

source: Notice for qmail users
es: Aviso a los usuarios de qmail

source: Before making any changes to Qmail configuration, please read /usr/share/doc/qmail/README.Debian.gz. This file includes a description of the differences between Qmail in Debian, Qmail in other systems, and other mail transfer agents.
es: Consulte «/usr/share/doc/qmail/README.Debian.gz» antes de realizar cambios en la configuración de Qmail. Este fichero incluye una descripción de las diferencias entre Qmail en Debian, Qmail en otros sistemas, y otros agentes de transporte de correo.

source: If you were using a more conventional MTA previously, you will also want to read the "qmail-upgrade" manpage, which details user-visible differences between Sendmail and Qmail.
es: Si usaba un agente de transporte de correo más convencional se recomienda leer la página de manual «qmail-upgrade», que detalla las diferencias entre Sendmail y Qmail más visibles para el usuario.

source: If you are new to Qmail, you will want to at least peruse the Qmail FAQ, which can be found in /usr/share/doc/qmail.
es: Si nunca ha usado Qmail, se recomienda que al menos examine en detalle el PUF de Qmail, disponible en «/usr/share/doc/qmail».

source: Start Qmail now?
es: ¿Desea iniciar Qmail ahora?

source: Qmail will be started at the next reboot
es: Qmail se iniciará en el siguiente reinicio

source: You chose not to start Qmail now. It will be started automatically at next reboot.
es: Ha seleccionado no iniciar Qmail en este momento. Se iniciará automáticamente en el siguiente reinicio.

source: You can also start it manually with "/etc/init.d/qmail start" (as root) at a shell prompt.
es: También puede iniciarlo manualmente ejecutando «/etc/init.d/qmail start» como administrador en un intérprete de órdenes.

source: Remove Qmail users during a purge?
es: ¿Desea eliminar los usuarios de Qmail al purgar?

source: Please choose whether you want users created by the qmail package to be removed when this package is purged.
es: Seleccione si desea eliminar los usuarios que creó el paquete qmail al purgar éste.

source: Changes for virtual users
es: Cambios en los usuarios virtuales

source: recipientmap is gone from Qmail 1.03. The virtualdomains mechanism has been expanded to support virtual users. This machine's setup needs to be fixed.
es: «recipientmap» ya no existe en la versión 1.03 de Qmail. El mecanismo de dominios virtuales se ha extendido para ser compatible con usuarios virtuales. Es necesario arreglar la configuración de este sistema.

source: qlist utility discontinued
es: La herramienta qlist ya no está en desarrollo

source: The qlist utility was split out into a separate tarball by the upstream developer in Qmail 1.02.
es: El autor original separó la herramienta qlist en otro archivo tar en la versión 1.02 de Qmail.

source: This utility has not been packaged as it can be replaced by ezmlm. It can however be downloaded from http://pobox.com/~djb/qlist.html.
es: Esta herramienta no está empaquetada, ya que se puede reemplazar con ezmlm. Aún así, se puede descargar desde «http://pobox.com/~djb/qlist.html».

source: Please check in /usr/share/doc/qmail and the man pages for changes since Qmail 1.01.
es: Consulte los cambios introducidos desde la versión 1.01 de Qmail en «/usr/share/doc/qmail» y las páginas de manual.

source: Internet superserver configuration file (inetd.conf) changes
es: Cambios en el fichero de configuración del súper servidor de Internet («inetd.conf»)

source: The inetd superserver is not very efficient at handling Qmail, so the default installation uses tcpserver from ucspi-tcp instead.
es: El súper servidor «inetd» no es muy eficiente al gestionar Qmail, por ello la instalación predefinida usa el servidor tcp de ucspi-tcp.

source: For this reason, the smtp line in /etc/inetd.conf has been disabled.
es: Debido a ello, se ha desactivado la línea de smtp en «/etc/inetd.conf».

source: This means that you must configure things such as RELAYCLIENT using /etc/tcp.smtp, rather than /etc/hosts.allow (see /usr/share/doc/qmail/README for details).
es: Esto significa que debe configurar cosas tales como «RELAYCLIENT» usando «/etc/tcp.smtp», en lugar de «/etc/hosts.allow» (para más detalles, consulte «/usr/share/doc/qmail/README»).

source: Updating /etc/tcp.smtp database for tcpserver
es: Actualizando la base de datos de «/etc/tcp.stmp» para tcpserver

source: Override pre-existing Qmail installation?
es: ¿Desea reemplazar la instalación previa de Qmail?

source: An existing installation of Qmail has been detected. Please choose whether you want this installation to be overridden.
es: Se ha detectado una instalación previa de Qmail. Seleccione si desea reemplazar esa instalación.

source: Do not choose this option if you need to preserve the current setup for Qmail.
es: No seleccione esta opción si desea preservar la configuración actual de de Qmail.
