Repository: elric/deb-l10n
Catalog: slbackup.po
Languages: es

source: Configure the backup system now?
es: ¿Desea configurar el sistema de copias de seguridad ahora?

source: Select this if you want to configure the backup system now.
es: Seleccione esta opción si desea configurar el sistema de copias de seguridad en este momento.

source: If you choose to do so, you will get the opportunity to configure one client and the backup server, and a cron job will be configured to start the backup session once a day, on a moment of time of your choice.
es: Si selecciona esta opción, tendrá la oportunidad de configurar un cliente y un servidor de copias de seguridad, así como configurar una tarea de cron para iniciar una sesión diaria de copias de seguridad, a la hora que desee.

source: To configure more than one backup client, you could either use the Webmin-module provided by the webmin-slbackup package, or you can do this manually in the file /etc/slbackup/slbackup.conf.
es: Para configurar más de un cliente de copias de seguridad puede usar el módulo Webmin, que proporciona el paquete webmin-slbackup, o editar directamente el fichero «/etc/slbackup/slbackup.conf».

source: If you choose to not configure slbackup now, an example configuration file will be installed, but cron will not be configured to start any backup sessions. To activate backup, you can reconfigure the system by running 'dpkg-reconfigure slbackup' (as root) or manually by editing the /etc/slbackup/slbackup.conf and /etc/cron.d/slbackup files.
es: Si escoge no configurar slbackup en este momento, se instalará un fichero de configuración de ejemplo, pero no se configurará cron para la ejecución de ninguna sesión de copias de seguridad. Para activar el sistema de copias de seguridad, puede reconfigurar el sistema ejecutando «dpkg-reconfigure slbackup» (como administrador) o editar manualmente los ficheros «/etc/slbackup/slbackup.conf» y «/etc/cron.d/slbackup».

source: Start time of the backup session:
es: Tiempo de inicio de la sesión de copias de seguridad:

source: By default slbackup starts one backup session each day, and here you can choose when to start this session. Enter the time in a HH:MM-format.
es: Por omisión, slbackup inicia una sesión de copia de seguridad cada día, permitiéndole escoger el momento de iniciar esta sesión. Introduzca la hora con el formato «HH:MM».

source: Name of your client:
es: Nombre de su cliente:

source: In slbackup each client has a uniqe name which identifies it. This name does not necessarily have anything to do with the hostname. Please enter the unique name of the client you want to configure.
es: Con slbackup, cada cliente tiene un nombre único que le identifica. Este nombre no tiene porqué guardar relación con el nombre del equipo. Introduzca el nombre único del cliente que desea configurar.

source: Type of client to configure:
es: Tipo de cliente a configurar:

source: This determines what type of client that will be configured now.
es: Esto define el tipo de cliente que se configurará a continuación.

source: If you choose local, the server will back up data from this computer. If you choose extern, the server will back up data from another computer using a SSH connection (this choice assumes that you install SSH and provide a passwordless connection between the user running the backup software on this computer (probably root) and the user running the backup software on the client).
es: Si escoge la opción «local», el servidor copiará los datos de este equipo. Si escoge «extern», el servidor copiará los datos de otro equipo mediante una conexión SSH (esta opción presupone que SSH está instalado y que tiene una conexión sin contraseña entre el usuario que ejecuta el programa de copia de seguridad en este equipo, probablemente «root», y el usuario que ejecuta el programa de copia de seguridad en el cliente).

source: Client hostname or IP address:
es: Nombre del sistema cliente o dirección IP:

source: You have choosen to configure an external client. Please enter the client's hostname or IP address.
es: Ha escogido configurar un cliente externo. Introduzca el nombre del sistema cliente o la dirección IP.

source: User running the backup software on the client:
es: El usuario que inicia el programa de copia de seguridad en el cliente:

source: The backup software (rdiff-backup) will also run on the client, and the user that runs it has to have access to all the files that shall be backed up. Enter the username of the user that shall run the backup software on the client.
es: El programa de copia de seguridad (rdiff-backup) también se ejecutará en el cliente, y el usuario que lo ejecute debe tener acceso a todos los ficheros que se van a copiar. Introduzca el nombre del usuario que ejecutará el programa de copia de seguridad en el cliente.

source: Files and directories to back up:
es: Ficheros y directorios de los que crear una copia:

source: Enter the location of the files and/or directories that you want to back up on the client. Use a whitespace as a delimiter.
es: Introduzca la ubicación de los ficheros y/o directorios del cliente de los que desea crear una copia de seguridad. Use espacios en blanco para separarlos.

source: Example: /etc /home /var/backups
es: Ejemplo: /etc /home /var/backups

source: Time life of backups (in days):
es: Tiempo que se guardarán las copias de seguridad (en días):

source: slbackup is doing a kind of maintenance before each backup session, where backups that are older than a certain number of days will be deleted. In this dialog you can specify the number of days that you want to keep the backups for this client on the backup server. The default is 185 days (approximately six months).
es: slbackup realiza una sesión de mantenimiento previa a cada sesión de copia de seguridad, borrando las copias de seguridad con una antigüedad superior a unos días determinados. Puede definir en este diálogo el número de días que desea guardar las copias de este cliente en el servidor de copias de seguridad. Por omisión, son 185 días (6 meses aproximadamente).

source: If you want to keep the backups for this client forever, or want to do the maintenance yourself, 0 days will be treated as infinite.
es: Si desea guardar las copias de seguridad de este cliente indefinidamente, o desea realizar directamente las tareas de mantenimiento, cero días se tomarán como un valor infinito.

source: Type of server to configure / connect to:
es: Tipo de servidor a configurar a al que conectarse:

source: This determines what type of server slbackup will configure.
es: Esto define qué tipo de servidor configurará slbackup.

source: If you choose local, the backup will be stored on this computer. If you choose extern, the backup will be stored on another computer using a SSH connection (this choice assumes that you install SSH and provide a passwordless connection between the user running the backup software on this computer (probably root) and the user running the backup software on the backup server).
es: Si escoge la opción «local», las copias de seguridad se guardarán en este equipo. Si escoge «extern», el servidor copiará los datos en otro equipo mediante una conexión SSH (esta opción presupone que SSH está instalada y que tiene una conexión sin contraseña entre el usuario que ejecuta el programa de copias de seguridad en este equipo, probablemente «root», y el usuario que ejecuta el programa de copia de seguridad en el servidor de copias de seguridad).

source: Server's hostname or IP address:
es: Nombre de sistema del servidor o dirección IP:

source: You have chosen to configure an external backup server. Please enter the backup server's hostname or IP address.
es: Ha escogido configurar un servidor externo de copia de seguridad. Introduzca el nombre del equipo del servidor de copias de seguridad o la dirección IP.

source: Backup location on the server:
es: Ubicación de las copias de seguridad en el servidor:

source: Enter the location where you want the backups to be stored. slbackup will not create this directory for you. When you create this directory, make sure that you have enough disk space to store all the backups you define.
es: Introduzca la ubicación dónde desea guardar las copias de seguridad. slbackup no creará el directorio si no existe. Al crear el directorio, asegúrese de que tiene suficiente espacio en el disco para guardar todas las copias de seguridad que defina.

source: User running the backup software on the server:
es: Usuario que ejecuta el programa de copias de seguridad en el servidor:

source: The backup software (rdiff-backup) will also run on the server, and the user that runs it has to have access to the location where the files are going to be stored. Enter the username that shall run the backup software on the backup server.
es: El programa de copias de seguridad (rdiff-backup) también se ejecutará en el servidor, y el usuario que lo inicie debe tener acceso a la ubicación dónde se guardarán los ficheros. Introduzca el nombre del usuario que ejecutará el programa de copias de seguridad en el servidor de copias de seguridad.
