Repository: elric/deb-l10n
Catalog: po/ unattended-upgrades.po
Languages: es

source: Progress: %s %% (%s)
es: Progreso: %s %% (%s)

source: All upgrades installed
es: Se han instalado todas las actualizaciones

source: Installing the upgrades failed!
es: Fallo al instalar actualizaciones

source: error message: '%s'
es: Mensaje de fallo: «%s»

source: dpkg returned a error! See '%s' for details
es: Se ha detectado un fallo de dpkg. Para más detalles, consulte «%s»

source: Progress: %s %%: (%s)
es: Progreso: %s %%: (%s)

source: No '/usr/bin/mail', can not send mail. You probably want to install the 'mailx' package.
es: No se ha detectado «/usr/bin/mail», no se puede enviar correo. Considere instalar el paquete «mailx».

source: [reboot required] unattended-upgrades result for '%s'
es: [Se requiere un reinicio] Resultado de unattended-upgrades para «%s»

source: unattended-upgrades result for '%s'
es: Resultado de unattended-upgrades para «%s»

source: Unattended upgrade returned: %s
es: Valor devuelto por unattended-upgrade: %s

source: Warning: A reboot is required to complete this upgrade.
es: Advertencia: Se requiere reinciar para completar la actualización.

source: Packages that are upgraded:
es: Paquetes que actualizar:

source: Packages with upgradable origin but kept back:
es: Paquetes con una actualización disponible en la fuente pero que no se actualizarán:

source: Package installation log:
es: Registro de instalación de paquete:

source: Unattended-upgrades log:
es: Registro de unattended-upgrades:

source: Initial blacklisted packages: %s
es: Paquetes inicialmente bloqueados: %s

source: Starting unattended upgrades script
es: Iniciando script de unattended-upgrades

source: Allowed origins are: %s
es: Fuentes permitidas: %s

source: Unclean dpkg state detected, trying to correct
es: Se ha detectado un estado no limpio de dpkg, intentando corregir

source: Lock could not be acquired (another package manager running?)
es: No se puede establecer el bloqueo (¿otro gestor de paquetes ejecutándose?)

source: Cache lock can not be acquired, exiting
es: No se puede establecer el bloqueo de la caché, saliendo

source: Cache has broken packages, exiting
es: La caché tiene paquetes rotos, saliendo

source: package '%s' upgradable but fails to be marked for upgrade (%s)
es: El paquete «%s» es actualizable, pero no se puede marcar para la actualización (%s)

source: GetArchives() failed: '%s'
es: Fallo de GetArchives(): «%s»

source: An error ocured: '%s'
es: Se ha detectado un fallo: «%s»

source: The URI '%s' failed to download, aborting
es: Fallo al descargar desde el URI «%s», interrumpiendo

source: Download finished, but file '%s' not there?!?
es: La descarga ha finalizado, pero no se encuentra el fichero «%s»

source: Package '%s' has conffile prompt and needs to be upgraded manually
es: El paquete «%s» solicita confirmación a través de un conffile, y se debe actualizar de forma manual

source: package '%s' not upgraded
es: No se ha actualizado el paquete «%s»

source: Packages that are auto removed: '%s'
es: Paquetes eliminados de forma automática: «%s»

source: No packages found that can be upgraded unattended
es: No se han encontrado paquetes actualizables sin supervisión

source: Packages that are upgraded: %s
es: Paquetes que se han actualizado: %s

source: Writing dpkg log to '%s'
es: Escribiendo el registro de dpkg en «%s»

source: print debug messages
es: Mostrar mensajes de depuración de fallos

source: Simulation, download but do not install
es: Simulacro, descarga pero no instala

source: Upgrade in minimal steps (and allow interrupting with SIGINT
es: Actualizar en pequeños pasos (y permitir la interrupción con SIGINT)

source: You need to be root to run this application
es: Necesita tener privilegios de administrador para ejecutar esta aplicación

source: Unattended-upgrade in progress during shutdown, sleeping for 5s
es: Unattended-upgrade en proceso durante el apagado, esperando 5s

source: Giving up on lockfile after %s delay
es: Finalizando el bloqueo del fichero después de un retraso de %s
