Repository: elric/deb-l10n
Catalog: po-debconf/fs2ram.po
Languages: es

source: Content-preserving
es: Conservación de contenido

source: Structure-preserving
es: Conservación de estructura

source: Unconfigured
es: Sin configuración

source: Configuration for fs2ram:
es: Configuración para fs2ram:

source: Please select the fs2ram configuration that best meets your needs.
es: Seleccione la configuración para fs2ram que mejor se adapta a sus necesidades.

source: * Content-preserving: /var/tmp, /var/cache, and /var/log will be in RAM, reducing writes to the hard drive, and fs2ram will preserve the contents of these file systems across reboots. * Structure-preserving: /var/tmp, /var/cache, and /var/log will be in RAM, but fs2ram will only preserve their directory structures across reboots, not their (potentially private) contents. * Unconfigured: the fs2ram configuration file will be left empty and must be filled manually.
es: * Conservación de contenido: «/var/tmp, /var/cache», y «/var/log» se ubican en la RAM, lo que reduce las escrituras en el disco duro, y fs2ram conserva el contenido de estos sistemas de ficheros entre cada reinicio. * Conservación de estructura: «/var/tmp», «/var/cache», y «/var/log» se ubican en la RAM, pero fs2ram solo conserva la estructura de directorios entre cada reinicio, y no su contenido (potencialmente privado). * Sin configuración: el fichero de configuración de fs2ram se deja vacío y la edición debe ser manual.

source: Turn /tmp into a RAM file system?
es: ¿Desea convertir «/tmp» a un sistema de ficheros RAM?

source: Please choose whether /tmp should be converted into a tmpfs mount point. This is not the default for freshly installed systems.
es: Seleccione si desea convertir «/tmp» a un punto de montaje tmpfs. No es el comportamiento predefinido para sistemas recién instalados.

source: Turn /var/lock into a RAM file system?
es: ¿Desea convertir «/var/lock» a un sistema de ficheros RAM?

source: Please choose whether /var/lock should be converted into a tmpfs mount point. This is the default for freshly installed systems.
es: Seleccione si desea convertir «/var/lock» a un punto de montaje tmpfs. No es el comportamiento predefinido para sistemas recién instalados.
