Repository: elric/deb-l10n
Catalog: po-debconf/gitalist.po
Languages: es

source: Path to Git repositories:
es: Ruta a los repositorios Git:

source: Please specify the path from which Gitalist should serve Git repositories.
es: Indique la ruta desde la que Gitalist debería servir los repositorios Git.

source: These should be "bare" repositories.
es: Éstos deberían ser repositorios «bare».

source: Enable Gravatar support?
es: ¿Desea activar el uso de Gravatar?

source: Gravatar is a web service associating user email addresses with "avatars". It is independent of the Gitalist upstream authors. The pages generated by Gitalist can show these "avatars" for users who have registered with Gravatar.
es: Gravatar es un servicio web que asocia «avatares» a las direcciones de correo electrónico de los usuarios. Este servicio es independiente y los autores de Gitalist no tienen ninguna relación con éste. Las páginas que genera Gitalist pueden mostrar estos «avatares» para los usuarios que estén registrados en Gravatar.

source: Gravatar support in Gitalist is disabled by default because it can leak information about repositories, directories, and files via browser referrals to the Gravatar service.
es: El uso de Gravatar en Gitalist está desactivado de forma predeterminada, porque puede filtrar información sobre los repositorios, directorios y archivos a través de la información que se incluye en un navegador web al acceder, por referencia, al servicio de Gravatar.

source: File that contains a whitelist of repositories to be displayed:
es: Archivo que contiene una lista blanca de repositorios que mostrar:

source: If you use an SSH gatekeeper to maintain your git repositories on the server, such as Gitolite, you can specify the whitelist file that defines what repositories get presented in the webfrontend.
es: Si utiliza un controlador de acceso SSH que mantiene sus repositorios git en el servidor, como pueda ser Gitolite, puede definir un archivo de lista blanca que define los repositorios que se muestran en la interfaz web.

source: The default whitelist for Gitolite is the projects.list file in the parent directory of the directory where the git repositories are stored.
es: La lista blanca predeterminada de Gitolite es el archivo «project.list», en el directorio superior del que contiene los repositorios git.

source: Path to file that contains a whitelist of repositories:
es: Ruta al archivo que contiene la lista blanca de repositorios:

source: Please specify the path to the whiteliste file. This file contains an list of repositories that will be served by Gitalist.
es: Introduzca una ruta al archivo de lista blanca. Este archivo contiene una lista de repositorios que Gitalist mostrará.

source: Enable Gitalist in Apache as /gitalist?
es: ¿Desea activar Gitalist en Apache como /gitalist?

source: This will install Gitalist into you Apache configuration. Gitalist will be available as /gitalist.
es: Esto instalará Gitalist en su configuración de Apache. Gitalist estará disponible como /gitalist.

source: Gitalist needs the global Apache configuration AllowEncodedSlashes set to On. This could cause problems with your other webapplication for more information, please have a look at the Apache manual.
es: Gitalist requiere que la opción «AllowEncodedSlashes» se defina como «On» en la configuración global de Apache. Esto puede provocar problemas con otras aplicaciones web. Para más detalles consulte el manual de Apache.
